name: 認知科学（Cognitive Science）

thema: 【テーマ・目標】
認知科学のさまざまな分野の研究にふれながら，認知科学で扱う諸概念を学ぶ．

_lecture_content: 【講義内容】
認知科学が 20 世紀半ばに誕生したころの興奮は，人間の思考や認識の過程は重要な点で直列型
のコンピュータに似ているだろうという直観であった．その潮流のなかで計算的な方法やモデル
を厳密に適用することをきっかけとして，人間が典型的なコンピュータと異なっている点も明ら
かになってきた．認知科学は計算的で表象的なアプローチを基本とし，認知心理学や人工知能を
中心領域としつつ，哲学や言語学の一部もとりこみ，近年では神経科学との接点も増している．
このような認知科学の研究の実際にふれながら，
コンピュータと人間の情報処理について考える．
キーワード: 思考，認知，知覚，人工知能，心理学，哲学，言語学
keywords: thought, cognition, perception, artificial intelligence, psychology,
philosophy, linguistics

scgedule: 2．講義計画
各テーマで，1 ないし 2 回ずつ講義する．順序は前後することがある．
1-2. 認知科学の諸領域
3. 視覚認知
4. 空間認知
5. 認知の神経メカニズム
6. 学習過程と眼球運動
7. 言語獲得
8. 創造的思考の認知科学
9. 学びのプロセス
10. 音楽の認知科学
11. 使いやすさの認知科学
12. 技芸と認知
13. ゲームと認知過程
14. 多人数インタラクション
15. まとめ

grade: 3．成績の評価方法
授業中におこなう小テストと，学期末の課題（レポート）により評価する．

textbook: 4．教科書・参考書
参考書：
メンタルモデル：言語・推論・意識の認知科学，P. N. ジョンソン・レアード著，産業図書．
マインド：認知科学入門，ポール・サガード著，共立出版．
認知心理学，箱田裕司ほか著，有斐閣
各テーマに関する推奨図書は授業時に紹介する．

note: 5．履修にあたっての注意事項
なし

remark: ６．備考
なし

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
認知科学のさまざまな分野の研究にふれながら，認知科学で扱う諸概念を学ぶ．

annual: 1-４年次

semesta:  前期

unitnum: 2 単位

teacher: 伊藤 精英
佐藤 直行
角 康之
竹川 佳成
椿本 弥生
寺井 あすか
中田 隆行
中村 美智子
南部 美砂子
花田 光彦
松原 仁
美馬 のゆり

None
name: コンピュータと教育（Computer and Education）

thema: 【テーマ・目標】
コンピュータの教育的利用について，歴史とその背後にある学習理論の変遷について学ぶ．そこ
から，
「コンピュータがいかに学びを支援できるか」
という学習者の視点で，
コンピュータの教育
的利用の今後のあり方について考えていく．また同時に，学習の方法，理解の方法など，大学の
講義の参加の態度を養うとともに，生涯を通じて必要な，メタ学習（学び方の学び方）について，
意識的に学んでいく．

_lecture_content: 【講義内容】
コンピュータという道具は，本当に子どもの学びに役立つのだろうか．コンピュータを利用した
子どもの学びの可能性を考える．はじめに，コンピュータを導入することの歴史とその背景にあ
る教育観，学習観，知能観の変遷について紹介する．コンピュータを利用する可能性としての表
現活動やネットワークの利用について，具体的な学習活動の話をまじえながら，人の学びについ
て考える．さらに人工知能研究の知見をもとに，人間の知性をコンピュータの知から見直し，最
終的には，学習環境のデザインについて考える．
キーワード: 学習，教育，知識，記憶，ICT，知能
kewwords: learning, education, knowledge, memory, ICT, Intelligence

scgedule: 2．講義計画
1. 「学習スタイル」を知る
2. 「学ぶ」ということの意味
3. 学習心理学の歴史から
4. 記憶と知識
5. 頭がいいとは
6. 日本における利用の始まり
7. 実践者の意図と学習
8. 学校の文化と真正の文化
9. 学習における共同体の意味
10. テレビ番組との連動
11. デジタル教材の現状と課題
12. シリアスゲーム
13. 学習環境のデザイン：空間・活動・共同体
14. 教室におけるコンピュータの意味
15. 全体のまとめ（総集編）

grade: 3．成績の評価方法
講義時間中の課題提出の有無およびその内容，期末試験により総合的に評価する．

textbook: 4．教科書・参考書
参考書
美馬のゆり・山内祐平 『
「未来の学び」をデザインする空間・活動・共同体』 東京大学出版会
佐伯胖 『コンピュータと教育』 岩波書店
佐伯胖 『新・コンピュータと教育』 岩波書店
佐伯胖 『
「わかる」ということの意味』 岩波書店
三宅なほみ・白水始 『学習科学とテクノロジ』 放送大学教材
アラン・コリンズ 『デジタル社会の学びのかたち』 北大路書房

note: 5．履修にあたっての注意事項
履修するかどうかの判断は，オンライン授業フィードバックシステムの履修学生からのメッセー
ジを読んでから行うことを勧める．

remark: ６．備考
なし．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
コンピュータの教育的利用について，歴史とその背後にある学習理論の変遷について学ぶ．そこ
から，
「コンピュータがいかに学びを支援できるか」
という学習者の視点で，
コンピュータの教育
的利用の今後のあり方について考えていく．また同時に，学習の方法，理解の方法など，大学の
講義の参加の態度を養うとともに，生涯を通じて必要な，メタ学習（学び方の学び方）について，
意識的に学んでいく．

annual: 1-４年次

semesta:  前期

unitnum: 2 単位

teacher: 美馬 のゆり

None
name: 芸術論（Art Management）

thema: 【テーマ・目標】
視覚的な芸術表現の設計段階に焦点を当てながら講義を進めていく．
人工物や天然素材を題材として，その構造や肌理の描写を行うデッサンの中から芸術表現の設計
法を理解するのがテーマである．設計（デザイン）に取り組む上で必要となる基本的な知識と技
能について，デッサンを通じて学ぶことを目標とする．

_lecture_content: 【講義内容】
まず，視覚的な芸術表現の設計過程を理解し，そのために必要となる知識，道具，技法などにつ
いて概観する．
デッサンについて現状と歴史を概観し，その課題，可能性について理解する．
人工物や天然素材の基本的な構造や肌理の観察法について学ぶ．
構造や肌理が生み出す陰影を描写する方法について学ぶ．
描出した人工物や天然素材の画面内での配置方法について学ぶ．

scgedule: 2．講義計画
視覚的な芸術表現を設計してきたデッサンの現状と歴史を概観し，その流れを理解する．
デッサンの各段階で必要な手法や道具を選択し，実行に移すことができる．
設計の実践者になるための基本的なデッサンの描き方を習得する．
第 01 回 オリエンテーション 芸術表現におけるデッサンの位置づけについての概説
第 02 回 デッサンの歴史 原始
第 03 回 デッサンの歴史 ギリシャ・ローマ
第 04 回 デッサンの歴史 ルネサンス 透視図法
第 05 回 デッサンの歴史 ルネサンス 陰影法
第 06 回 デッサンの歴史 近代 画家のデッサン
第 07 回 デッサンの歴史 近代 彫刻家のデッサン
第 08 回 現代のデッサン 前半のまとめ，ふりかえり
第 09 回 天然素材をモチーフとしたデッサン１
第 10 回 天然素材をモチーフとしたデッサン２
第 11 回 天然素材をモチーフとしたデッサン３
第 12 回 人工物をモチーフとしたデッサン１
第 13 回 人工物をモチーフとしたデッサン２
第 14 回 人工物をモチーフとしたデッサン３
第 15 回 講義内で得た知識，技能の資料化と確認
前半はデッサンの歴史を理解し，後半は実際にデッサンを行い，技能のあり方について考える．

grade: 3．成績の評価方法
課題レポート 30% ，課題評価点７０％を元に総合的に評価する．

textbook: 4．教科書・参考書

note: 5．履修にあたっての注意事項
この授業は中学・高校の日本史，世界史，美術で取り上げられている美術史の知識を前提にデザ
インされている．

remark: ６．備考
毎回，デッサンの実技を伴う授業であるため，鉛筆，カッター，練りゴム，スケッチブックが必
要である．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
視覚的な芸術表現の設計段階に焦点を当てながら講義を進めていく．
人工物や天然素材を題材として，その構造や肌理の描写を行うデッサンの中から芸術表現の設計
法を理解するのがテーマである．設計（デザイン）に取り組む上で必要となる基本的な知識と技
能について，デッサンを通じて学ぶことを目標とする．

annual: 1-４年次

semesta:  前期

unitnum: 2 単位

teacher: 木村 健一

None
name: 人体生理学（Human Physiology）

thema: 【テーマ・目標】
システム情報科学において有効となる，システムとしての人体の構造と機能について理解する．

_lecture_content: 【講義内容】
次にあげる順で，分子から個体を成り立たせる一連の階層構造を網羅しながら，生体システムを
述べる．
・一般的な知識としての生化学，細胞生物学，遺伝学の知識
・個体を構成する器官系の構造と機能
・系を構成する器官の調節機構

scgedule: 2．講義計画
1.序論
2.生化学の基礎
3.細胞生物学の基礎
4.遺伝学の基礎
5.細胞膜の興奮と電気生理学
6.神経系
7.脳
8.筋の収縮
9.感覚（体性感覚・視覚・聴覚・味覚・嗅覚）
10.循環器系
11.消化器系
12.呼吸器系
13.代謝と栄養
14.内分泌系
15.まとめと期末試験

grade: 3．成績の評価方法
期末試験 50%，課題（レポート）50%により評価する．

textbook: 4．教科書・参考書
参考書：各種生理学の本

note: 5．履修にあたっての注意事項
初めて生物学の講義を履修する学生は，図書館にある，基礎・教養の生物学又は高校の教科書で
予習しながら受講すること．

remark: ６．備考
なし

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
システム情報科学において有効となる，システムとしての人体の構造と機能について理解する．

annual: 1-４年次

semesta:  前期

unitnum: 2 単位

teacher: 櫻沢 繁

None
name: ロボットの科学技術（Science and Technology of Robots）

thema: 【テーマ・目標】
ロボットを利用・設計するために必要な技術，およびその原理を理解する．手腕型の作業ロボット，
各種の移動ロボットや知能ロボットなどについて，その特徴や制約，必要な技術などをおおよそ説明
できるようになることが目標となる．

_lecture_content: 【講義内容】
この講義では，複雑な作業を私たちに代わって自動で行う装置であるロボットについて述べる．最
近では工場の腕型ロボットだけではなく，人型の作業ロボットや，掃除，さらに自動運転まで，日常
のさまざまな分野でロボットが導入され始めている．また，複雑な機械や制御機器，高精度センサな
どが手軽に利用できることになり，ロボットを作る・利用することが比較的簡単にできるようになっ
てきた．このため，ロボットが活用できる対象を考えたり，目的に合ったロボットを選定したり，作
成するという機会がますます増えている．だからこそ，ロボット固有の考え方や，背景となる幅広い
知識を教養としても身に付ける必要がある．
この講義では機械・電子・情報などの各分野でロボットに広く利用されている技術と，ロボットの
発想について，映像資料などを交えて解説したい．
キーワード: ロボット, センサ技術, 機械工学, 人工知能

scgedule: 2．講義計画
1. ロボットの概要 - 産業用ロボットから自律ロボットへ， ロボットの構成要素
2. ロボットアーム - ロボットアームの種類と目的，モータの原理と特性，制御の必要性
3. ロボットアーム - ロボットアームを自由な位置に持って行くための制御方法，運動学
4. ロボットアーム - 動力学，力，柔軟さを制御する方法
5. ロボットの移動方法 - 移動方法の種類，差動車輪の原理と位置・速度の計算，各種の車輪移動
6. ロボットの移動方法 - 脚ロボットの安定性，歩行パターン
7. 2 足歩行ロボットの原理 - 静歩行と動歩行，歩行の安定性の指標：ZMP， 静歩行を実現するに
は
8. 2 足歩行ロボットの原理 - 動歩行を実現するには，受動歩行
9. 中間テスト
10.ロボットのセンサ技術 - 距離，視覚センサ
11.ロボットのセンサ技術 - 位置，方位センサ
12.知能ロボットの技術 - 人型機械（オートマトン）とロボット，ロボット学習
13.ロボットのナビゲーション - 自動運転車両の技術，衝突回避の方法
14.ロボットの科学技術総論

grade: 3．成績の評価方法
（中間試験＋期末試験）70%，出席 30%で評価する．出席確認には HOPE での講義サイトへのロ
グイン時間の記録を利用するため，
講義にはかならず HOPE へアクセスできる機器を持参すること．

textbook: 4．教科書・参考書
教科書：
「絵でわかるロボットのしくみ」
，瀬戸，平田著，ISBN
978-4-06-154767-4{http://www.kspub.co.jp/book/detail/1547674.html}
参考書：日本機械学会編「ロボティクス」
{http://www.jsme.or.jp/publish/books/books-details/5614.html},

note: 5．履修にあたっての注意事項
HOPE を利用して，毎回の出欠，資料閲覧，授業理解度調査，確認クイズ，中間・期末テストなどを
行う．授業には HOPE のクイズ・小テストが動作する PC などを必ず持参すること．教科書を使用
するので，各自で入手すること．

remark: ６．備考
必須ではないが，高校・大学で物理学を履修していることが望ましい．その他詳細は，HOPE システ
ムのサイトを参照すること．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
ロボットを利用・設計するために必要な技術，およびその原理を理解する．手腕型の作業ロボット，
各種の移動ロボットや知能ロボットなどについて，その特徴や制約，必要な技術などをおおよそ説明
できるようになることが目標となる．

annual: 1-４年次

semesta:  前期

unitnum: 2 単位

teacher: 三上 貞芳

None
name: 情報メディア社会論（Information Media Society）

thema: 【テーマ・目標】
情報メディアと社会とのかかわりを実践的に学ぶことをとおして，メディア・リテラシーを獲得
することを大目標とする．そのために，以下の小目標を達成する．
1. メディアと社会との関係を，実践をとおして自分の言葉で説明する
2. メディアという観点から社会をとらえるものの見方を獲得する
3. メディアを活用して世界に働きかける姿勢を養う

_lecture_content: 【講義内容】
デジタル・ストーリーテリングという方法で映像作品を制作する．第一の目的は，制作をとおし
てメディアと社会について考える視座を養うことである．作品の質や制作技法はさほど重要では
ない．作品は各自 1 本ずつ制作するが，制作過程ではグループ作業も行う．講義は，プレゼンテ
ーション（発表）とピアまたはグループでのレビュー（相互コメント活動）を中心にすすめる．
制作過程に沿って，随時講義をおこなう．キャンパス内あるいは街にでて，調査や制作をおこな
う場合がある．
キーワード：デジタルストーリーテリング，ナラティブ（語り）
，メディアリテラシー，自己表現，
情報行動

scgedule: 2．講義計画
1. オリエンテーション
2. 課題説明と作品批評
3-5. 企画の相談・企画会議
6-8. 絵コンテ作成・中間報告 ※課題（作品＋口頭発表）
9-11. 撮影・制作
12. 最終発表の準備
13-14. 最終発表 ※課題（作品＋口頭発表）
15. まとめ ※課題（ミニレポート）

grade: 3．成績の評価方法
中間報告（２0 点）
，最終発表（5０点）
，ミニレポート（30 点）の累積点数により評価する．た
だし，全ての課題で 60%以上得点していることと，授業に 2/3 以上出席していることを単位取
得条件とする．課題の評価指針（ルーブリック）は授業中に示す．

textbook: 4．教科書・参考書
教科書：特になし．資料を配布する．
参考書：
水越伸（2014）21 世紀メディア論 改訂版．放送大学教育振興会
白石草（2011）メディアをつくる -「小さな声」を伝えるために-．岩波書店
伊達康博（2010）IT 社会における情報社会論．学文社
ジェームズ V.ワーチ（2004）心の声-媒介された行為への社会文化的アプローチ-．福村出版
川上善郎（2001）情報行動の社会心理学（シリーズ 21 世紀の社会心理学 5）
．北大路書房

note: 5．履修にあたっての注意事項
・映像制作経験の有無は不問.
・積極的な参加姿勢のある者のみ受講可.
・授業時間外での制作作業が生じる場合がある．

remark: ６．備考
なし．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
情報メディアと社会とのかかわりを実践的に学ぶことをとおして，メディア・リテラシーを獲得
することを大目標とする．そのために，以下の小目標を達成する．
1. メディアと社会との関係を，実践をとおして自分の言葉で説明する
2. メディアという観点から社会をとらえるものの見方を獲得する
3. メディアを活用して世界に働きかける姿勢を養う

annual: 1-４年次

semesta:  前期

unitnum: 2 単位

teacher: 椿本 弥生

None
name: 技術者倫理（Engineering Ethics）

thema: 【テーマ・目標】
技術者が社会の信頼を得て活動するために必要な倫理について学習する．

_lecture_content: 【講義内容】
3 年次必修のこの講義では，一人の人間が職業を通じて技術にかかわることの意義について，倫
理という観点から考察していく．
技術者倫理とは，技術がはらむリスク，組織や人間関係の圧力など，仕事をしていくうえで逃れ
ようのない様々な軋轢やジレンマと対峙しながら，技術者が自分なりの信念にもとづく行動規範
をいかに確立していくかについての理念と実践の体系である．技術者倫理に「これだ」という唯
一絶対の解はない．一人ひとりが，自らの内面精神（モラル）との対話，多元的な価値規範（社
会倫理，ビジネス倫理，技術倫理，情報倫理，環境倫理…）との対話を繰り返しながら，日々の
行動へと移される中で構築されていくものであることを，多数の事例を交えながら学ぶ．

scgedule: 2．講義計画
1.現代社会と倫理
生命倫理からグローバル・エシックスまで／科学技術に対する 3 つの立場
2.職業的アイデンティティと倫理
専門家集団の責任／情報技術の文化と倫理―ハッカー，OSS と Linux，プライバシー
3.組織と倫理
組織の倫理，集団圧力，人間関係とハラスメント／リーダーシップが組織を変える
4.技術のリスク，失敗への対処
失敗に学ぶ／リスクコミュニケーションの事例研究
5.法と倫理／技術の説明責任と情報公開
法的責任とコンプライアンス（法令遵守）／マニュアル，クレーム対応の事例研究
6.技術をめぐる所有権／報酬と倫理
技術は誰のものか／創造性への報酬
7.倫理規定・行動規定の策定とその実践
倫理規定に重要な要素／企業，大学，団体等の倫理規定・行動規定集の事例研究
（以上の項目に沿って講義を行う予定である．事例と小項目は変更の可能性がある）

grade: 3．成績の評価方法
めやすとして出席状況（30％）
，授業への参加態度・授業中の課題等（30％）
，期末レポート
（40％）
．
受講を通じた理解の進捗を重視する．受講を通じていかに主体的かつ論理的に「技術」と「倫理」
を論じることができるようになったかが評価される．

textbook: 4．教科書・参考書
教科書は特に定めない．以下，参考書（テーマ別）
（哲学倫理）加藤尚武『技術と人間の倫理』NHK ライブラリー23
（情報技術）デボラ・Ｇ・ジョンソン『コンピュータ倫理学』オーム社
（プライバシー）名和小太郎『個人データ保護―イノベーションによるプライバシー像の変容』
みすず書房

note: 5．履修にあたっての注意事項
・毎回の講義は受講者が自分なりにノートを取ることが望まれる．
・毎回のミニエッセイは，講義時間内に記述して提出する．

remark: ６．備考

target: 対象コース 全コース
学部共通必修

thema: 【テーマ・目標】
技術者が社会の信頼を得て活動するために必要な倫理について学習する．

annual: ３年次

semesta:  前期

unitnum: 2 単位

teacher: 田柳 恵美子
冨永 敦子

None
name: 人類文明の興亡史（History of Civilization）

thema: 【テーマ・目標】
ヨーロッパにおける「知の歴史」
・科学の成立にいたるまでのヨーロッパの知の営みを理解する
・われわれとは根本的に異なる社会における「合理的」なものの見方を理解する異文化理解
の視点を養うと同時に，われわれの社会の特徴も理解する

_lecture_content: 【講義内容】
近代以降われわれを規定しつづける「科学」がいかにして成立したのか，という問題を取り上げ
る．
「科学」
は西ヨーロッパを舞台に 19 世紀に成立したが，
その過程をヨーロッパの特殊性を見
ながら，考察する．

scgedule: 2．講義計画
１．オリエンテーション
２～４．
「古典」古代（古代ギリシアと古代ローマ，キリスト教）
５～６．中世（
「暗黒時代」
，12 世紀の目覚め）
７～１２．近世（
「ルネサンス」
，宗教改革，
「大航海」
，１７世紀科学革命）
１３． 理性の時代（啓蒙主義）
１４． 科学の時代（19 世紀～現代）
１５． まとめ

grade: 3．成績の評価方法
受講態度：コメントペーパーなどへの記入……２０％
小レポート……１５％分×３＝４５％
最終課題（レポート）……３５％
＊なお，成績の判定には最終課題の提出が必要不可欠，とする

textbook: 4．教科書・参考書
教科書は使用せず，適宜プリントを配布する
参考書については，講義中に紹介する

note: 5．履修にあたっての注意事項
本講義の担当教員は非常勤講師であるため，本学に常駐していない．
世界史／ヨーロッパ史の知識は，あるにこしたことはないが，なくても理解できるように講義す
るので心配はいらない．ただし，ぼんやり聞いているだけで理解できるとは思わないので，積極
的に受講すること．

remark: ６．備考
歴史は，過去に生きた人々の生を追体験する作業です．覚えるのではなく，なぜそのときそんな
行動をしたのか，理解するよう心がけて下さい．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
ヨーロッパにおける「知の歴史」
・科学の成立にいたるまでのヨーロッパの知の営みを理解する
・われわれとは根本的に異なる社会における「合理的」なものの見方を理解する異文化理解
の視点を養うと同時に，われわれの社会の特徴も理解する

annual: 1-４年次

semesta:  前期集中

unitnum: 2 単位

teacher: 横川 大輔

None
name: 言語と社会（Language and Society）

thema: 【テーマ・目標】
・話し合いの進め方および問題解決プロセスに関する理論と技術を体験的に学ぶ．
・社会的問題に対するディスカッションを通し，問題に対する論理的思考力を身につける．
・グループによる話し合いと発表のための作業を通し，チーム力を身につける．

_lecture_content: 【講義内容】
近年，社会では話し合いによる意思決定や問題解決への関心が高く，人々はそのような場に参加
することが期待されている．また，就職面接ではグループディスカッションが行われることも多
い．就職後は同僚・上司とコミュニケーションをとりながらチームで仕事をする経験も重ねてい
く．このような社会状況のもと，この授業では実際にディスカッションの「体験」と「観察」を
繰り返しながら，話し合いに関する理論的知識と話し合いのスキルを身につける．また，これら
の過程の成果として，グループによる合意形成を行い，その結果を発表する．
キーワード： コミュニケーション, コミュニケーションデザイン, メタ認知, 論理的思考, グルー
プ意思決定法, グループディスカッション, ファシリテーション, プレゼンテーション

scgedule: 2．講義計画
順番は前後することがある．ディスカッション体験とふりかえりは複数回行う．
1. ガイダンス：講義の進め方および履修上の注意・話し合いの重要性
2. 講義と演習：傾聴とアサーション
3. 講義と演習：問題解決におけるアイデア創出・問題発見
4. 講義と演習：問題解決のための思考法
5. 講義と演習：問題解決における意思決定
6. 演習：発表準備
7. 演習：発表
8. 講義と演習：話し合いの観察法と分析法
9. 演習：ディスカッション体験とふりかえり
10. 演習：コミュニケーション・スキルとトレーニング

grade: 3．成績の評価方法
・グループワークを主とする授業であるため，やむを得ない理由がない限り，欠席は不合格の対
象となる．
・ディスカッションテーマレポートを提出しないと不合格となる．
・フィッシュボウル式ディスカッションとふりかえり評価シートを４回すべて提出しないと不合
格となる．
・成績評価は上記の内容と，グループワークへの参加態度により，総合的に判断する．
・参加態度についてはピア評価（学生同士の評価）も取り入れる．

textbook: 4．教科書・参考書
授業スライドを配信し，参考書は随時紹介する．

note: 5．履修にあたっての注意事項
・ディスカッションなどグループワークは，フィードバックのため録音録画する．
・授業の大半はグループワークである．グループワークに真剣に取り組める人だけ履修すること．

remark: ６．備考
・毎回ＰＣを必ず持参すること．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
・話し合いの進め方および問題解決プロセスに関する理論と技術を体験的に学ぶ．
・社会的問題に対するディスカッションを通し，問題に対する論理的思考力を身につける．
・グループによる話し合いと発表のための作業を通し，チーム力を身につける．

annual: 1-４年次

semesta:  前期集中

unitnum: 2 単位

teacher: 大塚 裕子

None
name: 女性と社会（Issues Concerning Women in Contemporary Society）

thema: 【テーマ・目標】
現代社会をジェンダーの視点で読み解く．また「女性」
「男性」という性別が生み出される背景を
性別二元論，異性愛主義という社会規範とともに考える．

_lecture_content: 【講義内容】
「女性」とは何か．身体のちがいを理由づけに，わたしたちの社会はジェンダー（社会的・文化的
性別）を生み出してきた．
「女性」
「男性」という性別をめぐる「常識」に対する客観的な視点と，
そのような「常識」がいかにして，維持・再生産されてきたのかを事例に取り上げながら考察する．
ジェンダーがつくりだすものには，
「女らしさ」
「男らしさ」だけではなく，人間関係のあり方も含
まれる．家族，恋愛，結婚，パートナーシップなど，異性間のみの関係が前提とされてきた社会の
問題についても考察する．

scgedule: 2．講義計画
01．イントロダクション
02．ジェンダーとは何か？（１）
： ジェンダーの視点を学ぶ
03．ジェンダーとは何か？（２）
： 性の多様性
04．フェミニズムの思想と実践（１）
： 女性解放運動とあゆみ
05．フェミニズムの思想と実践（２）
： 日本における女性解放運動
06．性暴力の諸問題（１）
： 軍隊「慰安婦」問題
07．性暴力の諸問題（２）
： 軍事基地とジェンダー
08．セクシュアリティとは何か？： クィアという視点
09．性別二元論を問う（１）
： 性自認とトランスジェンダー（性別越境）
10．性別二元論を問う（２）
： トランスジェンダーと医療制度
11．性別二元論を問う（３）
： トランスジェンダーと法制度
12．異性愛主義を問う（１）
： 性的指向と同性愛者の人権
13．異性愛主義を問う（２）
： カミングアウトとクローゼット
14．異性愛主義を問う（３）
： さまざまな家族のかたち
15．ふりかえりと期末試験

grade: 3．成績の評価方法
（1）授業中のディスカッションへの参加 : 20%
（2）毎日の授業終了後に作成するレポート: 10%
（3）宿題として出された文献に関する課題（小レポート）: 10%
（4）期末試験（授業評価・自己評価レポート）: 60%
上記４項目に基づいて総合評価を行う．

textbook: 4．教科書・参考書
教科書は指定しない．おもな参考書は以下のとおり．
高橋準『ジェンダー学への道案内（四訂版）
』
（2014 年，北樹出版）
堀江有里『レズビアン・アイデンティティーズ』
（2015 年，洛北出版）
大越愛子・
倉橋耕平編
『ジェンダーとセクシュアリティ ――現代社会に育つまなざし』
（2013 年，
昭和堂）
ほか，講義内で紹介する．

note: 5．履修にあたっての注意事項
講義内に意見を求め，グループ・ディスカッションも行うので積極的に参加すること．また，講義
に向けての事前準備（備考欄に記載）を行うことを求める．

remark: ６．備考
講義開始前には，まず，日常のなかに無意識にある「女らしさ」
「男らしさ」について自覚的に疑問
をもって立ち止まる視点をもって準備していただきたい．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
現代社会をジェンダーの視点で読み解く．また「女性」
「男性」という性別が生み出される背景を
性別二元論，異性愛主義という社会規範とともに考える．

annual: 1-４年次

semesta:  前期集中

unitnum: 2 単位

teacher: 堀江 有里

None
name: 地域と社会（Region and Society）

thema: 【テーマ・目標】
21 世紀の超高齢・少子・人口減少の時代において，①「地域社会」にどのような再構築が求め
られているか，②中央ではなく「地域（地方）
」が本来持っている豊かさとは何か，③これからの
「地域社会」の可能性について学び，みずから地域社会の一員としての主体性のもとに現実の社
会を見直し，問題の発見や解決にのぞむ姿勢と発想力を獲得する．

_lecture_content: 【講義内容】
地域社会とは，本来は近隣のコミュニティ（共同体）を意味するものであったが，地方の都市化
が進んだ結果，近隣住民間の共同体意識は薄れ，地域社会の絆はぜい弱になり，多くの自治活動
は行政によって税金で賄われる公共事業となった．しかし，少子高齢化や人口減少が進み，より
効果的かつ持続可能なまちづくりが問い直されるなかで，改めて市民参加による自治や，地域本
来の豊かで多様な資源の再発見と新たな価値創出の活動が必要とされている.
本講義では，地域社会が抱える問題や現状について，海外との比較などを通じて広い視野から提
示し，自然と都市の近接した生活空間，歴史的に培われた個性的な文化風土など，地域社会の魅
力と可能性を検証する．20 世紀の東京や大都市一極集中の時代は終焉し，田舎への新たな回帰
が徐々に始まっているという見方もある．地域を舞台にした新しいビジネスや NPO などの取り
組み事例を実際に紹介するとともに，受講者自身にも地域再生のアイデアを提案してもらう．

scgedule: 2．講義計画
授業は下記のような内容骨子のもとに進める．
１．地域とは何か：定義，海外との比較
２．地域の魅力――シビックプライドを問い直す
３．地域と IT――スマートコミュニティによる格差の克服
４．地域と自治――市民参加の新しいかたち
５．地域を舞台にした新しいビジネス
６．地域社会の再生に取り組む新しい活動
７．地域の可能性をデザインする

grade: 3．成績の評価方法
・単位取得の必須要件と評価のめやす
(1) 事前課題と出席（40％）
(2) グループワークやフィールドワークへの積極的参加（20％）
(2) 授業での提出物と課題（40％）
※本講義は集中講義期間の４日程度の開講を想定しています. 9/9,10 の土日が含まれるかもし
れませんが，夏期休暇前には確定する予定です．原則的に全日全講義へ連続して出席することが
必須となります．

textbook: 4．教科書・参考書
特になし．必要な資料や参考書は適宜指定する．

note: 5．履修にあたっての注意事項
本講義は集中講義．フィールドワーク，グループワーク等も適宜行う．受講は高い問題意識を有
し，積極的な態度で参加できる学生に限られる．受講の必須条件として，開講前に提出課題を課
す．

remark: ６．備考
開講前に詳細なガイダンスを web 掲示板にて提示予定（7 月下旬～8 月上旬）
．受講定員を設定
する場合があるので注意すること．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
21 世紀の超高齢・少子・人口減少の時代において，①「地域社会」にどのような再構築が求め
られているか，②中央ではなく「地域（地方）
」が本来持っている豊かさとは何か，③これからの
「地域社会」の可能性について学び，みずから地域社会の一員としての主体性のもとに現実の社
会を見直し，問題の発見や解決にのぞむ姿勢と発想力を獲得する．

annual: 1-４年次

semesta:  前期集中

unitnum: 2 単位

teacher: 田柳 恵美子
外部講師（未定）

None
name: 情報産業論（Basic Strategies to The Network Economy）

thema: 【テーマ・目標】
本授業では，具体的な事例や白書等のデータを通して，日本および地域における情報政策，ビジ
ネストレンド，顧客ニーズ，人材育成について学ぶ．情報産業に関する知識を得るとともに，情
報産業のさまざまな事例について調べ，事例の目的・内容・効果・問題点・対応策を整理し，自
分なりに考察して記述できるようになることを目標とする．

_lecture_content: 【講義内容】
毎回の授業は，レクチャー，個人ワーク１，グループワーク，個人ワーク２，発表，小テストか
ら構成される．流れは以下のとおりである．
1) 教員のレクチャーにより，各回のテーマに関する知識を得る
2) レクチャー知り得た知識をもとに，個人ワーク１に取り組む
3) 個人ワーク１の内容について，グループでディスカッションする
4) ディスカッションの内容をもとに，個人ワーク２に取り組む
5) 個人ワーク２の内容を発表する
6) 小テストを受ける
個人ワーク１，２，グループワークの内容は，ワークシートに毎回入力する．

scgedule: 2．講義計画
1. オリエンテーション
2. 日本における情報政策(1)
3. 日本における情報政策(2)
4. 日本における情報政策(3)
5. 地域における情報産業(1)
6. 地域における情報産業(2)
7. 地域における情報産業(3)
8. 情報産業のビジネストレンド(1)
9. 情報産業のビジネストレンド(2)
10. 情報産業のビジネストレンド(3)
11. 情報産業のビジネストレンド(4)
12. 情報産業における顧客ニーズ(1)
13. 情報産業における人材育成
14. 情報産業におけるワークスタイル
15. まとめ：期末試験
キーワード ： 情報政策 地域活性化 ビジネストレンド ユーザー 人材

grade: 3．成績の評価方法
成績は，小テスト（40%）
，期末試験（40%）
，ワークシート（20%）によって評価する．
なお，出席回数が，全授業回の 3 分の 2 未満の場合は不合格とする．

textbook: 4．教科書・参考書
教科書：特になし
参考書：情報サービス産業白書などの白書

note: 5．履修にあたっての注意事項
・小テストは PC を用いて行うので，自分の PC を必ず持参すること．

remark: ６．備考
・授業内容の順序は前後することがある．
・補講および再試験は行わない．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
本授業では，具体的な事例や白書等のデータを通して，日本および地域における情報政策，ビジ
ネストレンド，顧客ニーズ，人材育成について学ぶ．情報産業に関する知識を得るとともに，情
報産業のさまざまな事例について調べ，事例の目的・内容・効果・問題点・対応策を整理し，自
分なりに考察して記述できるようになることを目標とする．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 冨永 敦子

None
name: 環境と産業（Environment and Industry）

thema: 【テーマ・目標】
21 世紀の産業社会に求められている環境経営，すなわち，持続可能な経済活動の理念と活動に
ついて学ぶ．

_lecture_content: 【講義内容】
これまでの産業社会において「環境」という用語は，主に企業活動によってもたらされる負の側
面である公害や自然破壊など，
負の側面を強調する文脈で用いられることが多かった．
その一方，
1980 年代より，環境負荷の低減と環境との共生を重視した「持続可能性（サステナビリティ）
」
に関する問題提起が行われた．現在では，環境経営は，企業の社会的責任（CSR）として位置づ
けられている．
本講義では，環境問題から環境経営に至った経緯を学び，21 世紀に求められる環境経営の理念
やあり方について理解を深める．それに際して，特に IT 分野における取り組み（グリーン IT，
スマートシティ構想）にも注目する．

scgedule: 2．講義計画
以下のテーマに沿って，多様な企業の実践事例を紹介する．これらの内容に関する調査や発表を
行うとともに，企業イメージの調査等の実践的課題を行う．これにより，環境経営の理念に関す
る基礎的な理念を理解する．
1) 環境問題と環境経営
2) 環境管理会計：環境負荷の測定と評価
3) 環境ディスクロージャの潮流
4) 環境経営時代の新たなビジネスモデル（生産様式や消費感の変遷）
5) グリーン・マーケティング，グリーン・ロジスティクス
6) グリーン・ニューディール政策と新しい環境技術
7) 環境と情報技術（グリーン IT，スマートシティ，スマートグリッド）
8) 企業の「環境報告書（CSR 報告書）
」を読む

grade: 3．成績の評価方法
授業への参加態度（30％）
，授業中の作業課題（30%）
，レポート課題（40％）に基づき評価を
行う．

textbook: 4．教科書・参考書
教科書は指定しない．適宜，資料を配付する．なお，本科目の理解を深める参考書として，以下
の書籍を挙げる．
三橋規宏「環境再生と日本経済」
（岩波新書）
，新井宏征「グーグルのグリーン戦略」
（インプレス
R&D）

note: 5．履修にあたっての注意事項
本講義では，テーマに合わせた実践的な学習課題を取り入れることを予定している．調査，議論，
レポートなど，自分自身の興味に沿った学びを行い，成果を発信するプロセスを重視する．相互
的な学びに際して，積極的に取り組むことが期待される．

remark: ６．備考
学生どうしの議論，発表，レポート作成に際して，最低限のコンピュータリテラシが求められる．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
21 世紀の産業社会に求められている環境経営，すなわち，持続可能な経済活動の理念と活動に
ついて学ぶ．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 辻 義人

None
name: メディアの科学（Media Studies）

thema: 【テーマ・目標】
心理学や教育学を基盤とした学習環境デザインの手法である ID（インストラクショナル・デザイ
ン）が中心的なテーマである．ID 理論を用いて，小規模な教材（紙の教材でも e ラーニングコン
テンツでも，どちらでも可）を設計・開発・評価できることを目標とする．

_lecture_content: 【講義内容】
他者に何らかの知識，技能，態度を効果的・効率的に教えるための学習コンテンツをデザインす
るための原理や方法を学ぶ．本講義では，教育工学，教育心理学，認知心理学などの観点から，
学習者と教材の相互作用に関する重要事項について取りあげる．なお本講義は，各受講者が自ら
の興味関心をふまえて持ちよった「教えたいこと」を対象として，実際に教材を作成する．講義
は，演習と予習を中心とした反転授業形式で進める．予習した内容について講義内で小テストを
行う．
キーワード：インストラクショナル・デザイン，マルチメディアラーニング，学習支援，教材，
教え方

scgedule: 2．講義計画
1. オリエンテーション・教材開発のイントロダクション・グループ分け
2. 教材を考える（１）
3. 教材を考える（２）
4. テストを作成する
5. 教材の構造を見極める
6. 教授メディアと指導方略
7. 教材企画書の作成
8. 教材企画書のチェック
9. 教材作成演習
10. 教材作成演習
11. 教材作成演習・中間報告会
12. 教材作成演習
13. 教材作成演習
14. 最終発表会・相互評価
15. まとめ

grade: 3．成績の評価方法
課題１～4 の累積点数で評価する．ただし，全ての課題が合格点（60%）に達していることを単
位取得条件とする．課題の評価指針（ルーブリック）は，この授業の Web サイトに掲載する．
[課題 1] 小テスト（20 点）
[課題 2] 教材企画書（20 点）
[課題 3] 課題（口頭発表＋相互評価）
（40 点）
[課題 4] 課題（ミニレポート）
（２０点）
なお,全授業回の 2/3 以上出席していることが単位取得の前提条件である．

textbook: 4．教科書・参考書
[教科書]
鈴木克明（2002）教材設計マニュアル-独学を支援するために-.北大路書房
[参考書]
ロバート・M. ガニェほか(2007) インストラクショナルデザインの原理．北大路書房

note: 5．履修にあたっての注意事項
・予習してきていることを前提として講義を進める．
・教科書に書かれていることを，そのまま講義で再説明することはない．講義では発展的な内容
について解説・議論する．
・積極的な参加姿勢のある者のみ受講可．

remark: ６．備考
・教科書を必ず購入すること．教科書のコピーは配布しない．
・授業外では，予習のほかに，制作作業が発生する場合がある．
・グループワークが多い講義である．積極的な参加を求める．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
心理学や教育学を基盤とした学習環境デザインの手法である ID（インストラクショナル・デザイ
ン）が中心的なテーマである．ID 理論を用いて，小規模な教材（紙の教材でも e ラーニングコン
テンツでも，どちらでも可）を設計・開発・評価できることを目標とする．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 椿本 弥生

None
name: 現代デザイン論（Modern Design）

thema: 【テーマ・目標】
[テーマ]現代は，情報化や国際化が進展する時代である．この講義では，社会や技術等が大きく
変化する中に於ける，デザインの現代的意味を理解する．
[内容]
デザインの意義，デザインの方法論，現場で行われている活動，近代化の中で変化するデザイン
の思想などを学び，情報化社会の中でのデザインの在り方を展望する．

_lecture_content: 【講義内容】
デザインは，産業と造形活動を結び付けることから始まった．有用で魅力のあるモノを生み出す
為のデザインプロセスや表現の技術は産業革命以降の長い実践の中で進化した．現代は情報革命
の発展の途上にある．デザインの課題は，モノ（製品）やモノと人の対話（UI）だけでなく生活
者の活動（社会システム）にまで拡大してきた．
20 世紀のデザインの考え方や手法では，現代的な課題に対処する事が難しい．現代デザインの
考え方，他分野と恊働するデザインアプローチ，多様なデザイン実践を紹介し，情報化社会での
デザインのあり方を概観する．
キーワード： デザイン史, デザインプロセス， ヒューマンインタフェース， 情報デザイン， イ
ンタラクションデザイン，認知心理学,情報科学

scgedule: 2．講義計画
1. 講義の概要，デザインとは何か
2. 編集のデザイン
3. インダストリアルデザイン
4. プログラムとデザイン
5. 視覚伝達デザイン
6. 感性とデザイン
7. メディアデザイン
8. デザインの歴史（バウハウスから現代）
9. 学習環境のデザイン
10.音のデザイン
11.認知とデザイン
12.GUI のデザイン
13.技芸とデザイン
14.非言語情報のデザイン
15.情報デザインの現場，まとめ

grade: 3．成績の評価方法
レポートおよび期末試験の総合評価による

textbook: 4．教科書・参考書
なし

note: 5．履修にあたっての注意事項
パソコンの使用不可．

remark: ６．備考
なし．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
[テーマ]現代は，情報化や国際化が進展する時代である．この講義では，社会や技術等が大きく
変化する中に於ける，デザインの現代的意味を理解する．
[内容]
デザインの意義，デザインの方法論，現場で行われている活動，近代化の中で変化するデザイン
の思想などを学び，情報化社会の中でのデザインの在り方を展望する．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 岡本 誠
木村 健一
迎山 和司
安井 重哉
原田 泰
姜 南圭
柳 英克
美馬 のゆり
伊藤 精英
南部 美砂子
美馬 義亮
角 薫
竹川 佳成

None
name: 起業家としての自立（Entrepreneur Activities）

thema: 【テーマ・目標】
起業について学ぶことを通じ，働くこととは何か，真の精神的自立とは何かを考えると共に
周囲の人と関わりの中で必要となるコミュニケーションについてもその重要性を学ぶ．

_lecture_content: 【講義内容】
起業には様々な人間力が求められる．本講義では起業というテーマを通じ，何のために働くのか
を考え，自ら考え行動する自立精神の重要性を知ることを軸とする．また，異質なことにチャレ
ンジするために必要とされる柔軟な発想力，失敗を恐れない強い意志，世の中に貢献することで
自分の居場所を得ることの幸福などについて考えを深める．そして，生き方，働き方には無限の
可能性と方法があって良いということを知る．尚，講義内では可能な限り多くの具体的事例を取
り上げたり，グループ演習形式を採用したりすることで理論と実践のバランスを取る．

scgedule: 2．講義計画
1～8 のテーマについて 1 ないし 2 回講義する．また，演習では小グループ単位で与えられたテ
ーマに対し自ら考え行動を起こすまでのプロセスをプレゼンテーションする．
1. 働くということ
2. 精神的自立と社会貢献
3. 起業に必要な人間力
4. 着眼点
5. 失敗の定義
6. ビジネスモデルについて考える
7. 収支計画・事業計画・資金調達
8. コミュニケーション能力～自分軸と他者への共感・理解～広い意味での顧客満足と営業
9. 起業演習

grade: 3．成績の評価方法
出席時の課題（レポート）提出（30％）
，プレゼンテーション（グループワーク）
（35％）
，期末
課題（レポート）
（35％）により評価する．

textbook: 4．教科書・参考書
教科書：特に指定しない
参考書：
①20 歳のときに知っておきたかったこと スタンフォード大学集中講義
ティナ・シーリング著 高遠裕子訳 阪急コミュニケーションズ
②キミが働く理由（わけ） 福島正伸著 中経出版
③成功する人たちの起業術 はじめの一歩を踏み出そう マイケル・E・ガーバー著
原田喜浩訳 世界文化社

note: 5．履修にあたっての注意事項
本講座履修に際しては議論への積極的参加，積極的傾聴を強く求める．
具体的には授業中の下記事項を禁ずる．
・１０分以上の遅刻
・携帯電話の使用
・講義中の私語
・睡眠および飲食
・許可無く長時間の退出をすること
・授業に関連のないＰＣ使用

remark: ６．備考
「地域と社会」は関連の深い科目である．併せて履修しておくことが望ましい．また，
前期集中「言語と社会」はグループワークの進め方において参考になるので履修を勧める．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
起業について学ぶことを通じ，働くこととは何か，真の精神的自立とは何かを考えると共に
周囲の人と関わりの中で必要となるコミュニケーションについてもその重要性を学ぶ．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 飯野 智子

None
name: 社会思想の歩み（History of social thought）

thema: 【テーマ・目標】
人間社会の発展における社会思想の役割について学び考える

_lecture_content: 【講義内容】
社会とは，それぞれの時代において，ある方向性をもった価値観にもとづき，地域や国家，集団
や組織といったまとまりをもって形づくられるものである．社会思想とは，より良い社会を形成
しようとする人間の精神であり，それはしばしば現実の社会をより良い社会へ，理想的な社会へ
と変革しようとする政治的な主張や運動というかたちを伴う．社会思想は，思想家といわれる偉
人たちによるものだけを指すのではない．例えば，あなたが情報技術を活用して新しい社会をデ
ザインすることに少しでも取り組もうとするなら，技術のみならず，そこで目指されるべき理想
の社会像，それを実際に形成していくための方策を含む社会思想を，大なり小なり提案する必要
がある．この講義では，日本や世界の歴史に登場してきた多様な社会思想を取り上げ，人間社会
を発展させていくうえでの社会思想の役割について学ぶとともに，受講者自身の問題意識のなか
で深く考える機会とする．

scgedule: 2．講義計画
以下のテーマに沿って，代表的な社会思想を取り上げながら講義を進める．
1）社会思想とは何か
2）ユートピア思想と理想主義
3）芸術・デザイン運動と社会思想
4）都市計画と社会思想
5）技術・産業と社会思想
6）郷土愛・愛国精神と社会思想
7）文学・ＳＦなどの作品世界に描かれた社会思想
8）ソーシャル・イノベーション―21 世紀の自己組織的な社会変革思想の潮流

grade: 3．成績の評価方法
めやすとして出席（30％）
，授業への参加態度・授業中の課題等（30％）
，レポート（40％）

textbook: 4．教科書・参考書
教科書はなし．必要な資料は配布予定．
参考書：トマス・モア『ユートピア』
（岩波文庫）
，ル・コルビュジエ『マルセイユのユニテ・ダ
ビタシオン』
（ちくま学芸文庫）
，岩田正美『社会的排除』他．

note: 5．履修にあたっての注意事項
受講者一人ひとりが，講義を通じて社会思想に対する自分なりの関心を掘り起こすことを期待す
る．あなたの関心事に応じて参考書を紹介しますので積極的に意思表示してください．

remark: ６．備考
毎回，原則的に手書きでノートを取ってもらいます．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
人間社会の発展における社会思想の役割について学び考える

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 田柳 恵美子

None
name: 心理学（Introduction to Psychology）

thema: 【テーマ・目標】
人間の認知に関することを中心とした心理学の紹介を行う．様々な心理学の領域について学び，
心理学とはどのような学問かを理解する．

_lecture_content: 【講義内容】
心理学では何について研究されているのか，どのように研究されているのかといったことについ
て講義を行う．ただし，心理学で扱う領域は非常に広範囲であり，一講義ですべてを網羅するの
は不可能なので，認知心理学とその周辺を中心に講義する．まず，心理学の学習に必要な生理学
的基礎（特に脳について）を解説する．次に，知覚について講義を行う．続けて，記憶・注意・
思考といった認知心理学の主要分野について解説する．さらに，動機づけ，感情，対人行動，パ
ーソナリティなどといった認知心理学の周辺分野を解説する．講義を通じて，心の働きについて
学び，人間に対する理解を深める．自分でさらに学習するための手助けとなるように，適宜，講
義に関連する本などを紹介する．
キーワード： 心理学，認知，知覚，記憶，注意，思考，感情，対人行動，パーソナリティ

scgedule: 2．講義計画
1. 心理学の諸領域と心理学の歴史
2. 生理学的基礎
3. ?知覚
4-6. 記憶・学習
7-8. 思考・意思決定
9-10. 動機づけ・感情
11-12. 対人行動
13-14. パーソナリティ，性格
15. まとめ

grade: 3．成績の評価方法
主に毎週または隔週の頻度で行う小テストと期末試験により評価する．

textbook: 4．教科書・参考書
教科書：無藤 隆・森 敏昭・遠藤由美，玉瀬耕治「心理学」有斐閣
参考書：D. マイヤーズ「カラー版マイヤーズ心理学」西村書店

note: 5．履修にあたっての注意事項
なし

remark: ６．備考
なし

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
人間の認知に関することを中心とした心理学の紹介を行う．様々な心理学の領域について学び，
心理学とはどのような学問かを理解する．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 中田 隆行
花田 光彦

None
name: 科学史・科学哲学（History and Philosophy of Science）

thema: 【テーマ・目標】
本授業では，
「科学的推論と批判的思考」
「文献の比較」
「科学と疑似科学の区別」
「論証・反論・
反駁」の 4 つのテーマを扱う．科学哲学者の戸田山（2005）によると，
「科学哲学の第一目標
は科学をまるごと理解すること」だという．しかしながら，科学は複雑かつ難解なものであり，
そう簡単に理解できるものではない．まずは，科学を理解するための基礎的スキルとして上記の
4 テーマを学習し，科学的思考の基本を習得することを目標とする．

_lecture_content: 【講義内容】
授業 3 回で 1 つのテーマを扱う．たとえば，テーマ 1「科学的推論と批判的思考」では，まず初
回授業の講義で演繹的推論などの科学的推論や批判的思考の方法を学ぶ．次の授業回では，科学
的推論のトレーニングとしてミニ課題に各自取り組む．テーマの最終授業回では，ミニ課題につ
いてピアレビューを行う．ピアレビューとは，学習者同士による検討活動である．ミニ課題に取
り組むことにより，講義で学んだ知識や技法を運用し，さらに．その成果をピアレビューするこ
とにより，着実に知識・技法を定着させるようにする．他のテーマも同様の流れである．

scgedule: 2．講義計画
1. オリエンテーション
2. テーマ 1「科学的推論と批判的思考」
・演繹的推論，帰納的推論，アブダクション
・批判的思考
・ミニ課題の作成，ピアレビュー
3. テーマ 2「複数文献の比較」
・比較の手法
・ミニ課題の作成，ピアレビュー
4. テーマ 3「科学と疑似科学の区別」
・検証可能性基準，確証可能性基準，反証可能性基準
・研究デザイン
・ミニ課題の作成，ピアレビュー
5. テーマ 4「論証・反論・反駁」
・トゥールミンの三角ロジック
・反論・反駁の方法
・ミニ課題の作成，ピアレビュー
6. まとめ

grade: 3．成績の評価方法
成績は，各テーマの小テスト（50%）とミニ課題（50％）によって評価する．ミニ課題はグル
ープ単位ではなく，個人単位である．課題の評価指標（ルーブリック）は，授業内で提示する．
なお，出席回数が，全授業回の 3 分の 2 未満の場合は不合格とする．

textbook: 4．教科書・参考書
教科書：特になし
参考書：戸田山和久（2005）
『科学哲学の冒険』NHK ブックス

note: 5．履修にあたっての注意事項
・毎回，自分の PC を持参すること．
・大幅な遅刻，居眠り，授業に関係ない Web 等の閲覧，Twitter 等 SNS への書きこみ，メール
のやりとり，飲食などを授業中に行った場合は退室を求める．

remark: ６．備考
・補講および再試験は行わない．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
本授業では，
「科学的推論と批判的思考」
「文献の比較」
「科学と疑似科学の区別」
「論証・反論・
反駁」の 4 つのテーマを扱う．科学哲学者の戸田山（2005）によると，
「科学哲学の第一目標
は科学をまるごと理解すること」だという．しかしながら，科学は複雑かつ難解なものであり，
そう簡単に理解できるものではない．まずは，科学を理解するための基礎的スキルとして上記の
4 テーマを学習し，科学的思考の基本を習得することを目標とする．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 冨永 敦子

None
name: 海の科学（Marine Science）

thema: 【テーマ・目標】
海洋をキーワードにして，海洋生物とその生活の場である海洋という環境に関する基礎を学び，
海洋生物のユニークな生態や形態から動物の行動を理解する．

_lecture_content: 【講義内容】
地球の表面積の 71%を占める「海」には，バクテリア，プランクトンから魚，クジラ，海鳥ま
で，私たちの想像も及ばない多種多様な生物が住んでいます．これらの生物は，海洋という環境
の中で，それぞれ独自のスタイルで誕生し，生活し，次世代を残する．それぞれの海洋生物の営
みと生活の場である海洋環境をトータルに見渡すと，みごとに調和した「海洋生態」をイメージ
することができます．この講義では，海洋生物のユニークな生態，形態や行動，それらと環境の
関わりだけでなく，さらに海洋生物を食料資源として持続的に利用してゆくための国際的な取組
についても学びます．

scgedule: 2．講義計画
1.イントロダクション
2.カレイの生活史
3.宇宙から見た海洋
4.プランクトンの世界
5.海鳥の世界
6.サケの生物学
7.イカの生態
8.ヤドカリの生態
9.海の食物連鎖・生態系と人間活動
10.魚の形の不思議
11.海藻学入門
12.海獣学入門
13.クジラの世界
14.海洋生物のモニタリング
15.海の化学－大気と海洋の物質循環－

grade: 3．成績の評価方法
出席状況と受講態度および担当各教員の課すレポートの内容を総合的に判断して評価する．

textbook: 4．教科書・参考書
なし．

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
講義計画の順序が変更される可能性があるので，掲示板など連絡されるお知らせに注意しておく
こと．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
海洋をキーワードにして，海洋生物とその生活の場である海洋という環境に関する基礎を学び，
海洋生物のユニークな生態や形態から動物の行動を理解する．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 今村央を代表と
する北海道大学
大学院水産科学
研究院教員

None
name: 発達と学習（Human Development and Learning）

thema: 【テーマ・目標】
ヒトは生涯にわたって発達と学習を続けている．本講義では，ヒトの発達および学習過程を，主
に教育心理学，認知心理学，発達心理学の見地から探求する．そのために，発達と学習に関する
主要な理論・実験・議論について理解し，日常生活における様々な自己の行動や他者との関わり
について，心理学的視点から観察・思考・議論できるようになることを目指す．

_lecture_content: 【講義内容】
本講義では，ヒトのさまざまな側面に関する発達過程や学習のメカニズムに関わる重要な理論や
実験について解説する．解説には主に教科書を利用するが，参考書から追加資料を提供する場合
もある．講義内では，教員による解説だけではなく，グループディスカッション，心理学実験，
文献の読解とディスカッション，理解度確認のための小テストなど，学習者自身が学習に主体的
に参加するための活動を設定する．
キーワード：発達，認知，学習，思考，記憶，教育測定，教育評価

scgedule: 2．講義計画
1. オリエンテーション，グループ分け
2-7. 発達
・発達とは
・身体運動発達と認知発達
・言語発達
・さまざまな発達理論
8-１４． 学習
・学習理論の潮流
・記憶と思考
・構成主義的学習
・教育測定と教育評価
15. まとめ

grade: 3．成績の評価方法
講義内容の理解度確認の小テストとミニレポートの累積点数で評価する．ただし，全ての課題が
合格点（60%）に達していることを単位取得条件とする．課題の評価指針（ルーブリック）は，
この授業の Web サイトに掲載する．
[課題 1] 小テスト（40 点）
[課題 2] 課題（ミニレポート）
（60 点）
なお，全授業回の 2/3 以上出席していることが，単位取得の前提条件となる．

textbook: 4．教科書・参考書
[教科書] 鎌原雅彦・竹綱誠一郎（2015）やさしい教育心理学 [第 4 班]. 有斐閣
（ISBN:978-4641220591）
[参考書]
市川伸一（2010）発達と学習．北大路書房
佐伯胖・渡部信一（2010）
「学び」の認知科学事典．大修館書店
波多野誼余夫・稲垣佳世子（2005）発達と教育の心理学的基盤．放送大学教育振興会
内田伸子・氏家達夫（2007）発達心理学特論．放送大学教育振興会
高橋道子・藤﨑眞知代・仲真紀子・野田幸江（1993）子どもの発達心理学．新曜社

note: 5．履修にあたっての注意事項
・教科書を必ず購入すること．教科書のコピーは配布しない．
・グループディスカッションや実験への積極的参加を求める．

remark: ６．備考
受講生の興味関心や理解度によって，授業内容の順序は前後することがある．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
ヒトは生涯にわたって発達と学習を続けている．本講義では，ヒトの発達および学習過程を，主
に教育心理学，認知心理学，発達心理学の見地から探求する．そのために，発達と学習に関する
主要な理論・実験・議論について理解し，日常生活における様々な自己の行動や他者との関わり
について，心理学的視点から観察・思考・議論できるようになることを目指す．

annual: 1-４年次

semesta:  後期

unitnum: 2 単位

teacher: 椿本 弥生
辻 義人

None
name: 物質の科学（Science of Material）

thema: 【テーマ・目標】
我々の生活は，実に多様な物質により支えられている．個人のあるいは世界の人々の衣食住の維持
•向上のためには，物質の科学が不可欠である．現代の物質科学の進歩は著しく，化学を中心に，物
理学や地球科学，環境学，エネルギー工学，材料学などと多面的に関連しながら発達している．そ
の範囲は極めて広く深いので，全貌を取り扱うには多くの時間が必要である．本講義では，学生諸
君が情報科学の専門家として社会に出た時に必要となるであろう物質科学の基本を理解すること
を目指す．これを習得しておけば，より個別的な問題に取り組む際に，大いに役立つであろう基本
事項である．基本事項の核心とは，
「原子•分子」の概念である．物質の性質や現象の驚くべき多様
さが，物質を構成する基本単位である「原子•分子」の比較的単純な性質に帰着できるのである．こ
のことをいくつかの身近な具体事例を通じてたどり，物質科学の考え方を身につける．

_lecture_content: 【講義内容】
講義の前半では，基本となる原子と分子の基本事項を説明する．原子と分子の概念とそれらの相互
作用について強調しながら，物質の成り立ちについて化学的な見方を提示する．この前半の理解を
怠ると，
後半の理解がおぼつかないので注意してほしい．
後半では，
これらの基本事項に基づいて，
日常的に重要な事例のいくつかを読み解いていく．特に物質の変化速度に注目して，時間軸と空間
軸上で発生する自己秩序形成について触れる．物質科学から，情報処理，自然知能，天然の形づく
り，社会的集団運動，デザインへと話を展開する．具体的な講義の項目は，講義の計画に詳述する．

scgedule: 2．講義計画
以下の１５の項目について，概ね一回ずつ講義する．各項目のあとに括弧付で示したのは，関連す
るキーワードである．各項目の順序は多少前後することもある．
原子と分子の基本事項
１，原子の成り立ち（原子論の歴史，原子模型，量子力学，電子配置）
２，元素の周期律（元素の種類，元素の性質，周期表）
３，化学結合と物質の構造（イオン結合，共有結合，水素結合，金属結合，分子間力）
４，物質の三態（気体，液体，固体，相平衡，束一的性質，コロイド）
化学反応と物質多様性の基本事項
５，酸と塩基，酸化還元と電池（水素イオン濃度と pH，アレニウス説，ブレンステッド•ロウリ
ーの説，酸化剤，還元剤，イオン化傾向，電極電位，一次電池，蓄電池）
６，生活の中の物質（プラスチック，ゴム，洗剤，食品添加物，薬，毒，金属，ガラス，セメン
ト，陶磁器，新素材）
７，環境と物質（発電，大気汚染，放射能，酸性雨，水質汚濁）
８，有機化合物，生命と物質（分類，炭化水素，異性体，官能基，合成，調理，栄養と代謝，炭
水化物，タンパク質，脂質，酵素，核酸，ビタミン）
物質の変化と動き – 反応速度論・運動方程式・自己秩序形成–
９，化学反応の速さと平衡（化学熱力学，反応速度論，質量作用の法則）
１０，化学反応のリズム（BZ 反応，細胞のリズム）
１１，リズム運動のひろがり -化学反応の速度方程式の幾何学的解析方法-
１２，化学反応の波とパターン形成
モノから生き物へ − 自然知能・自然界の形づくりとデザイン・集団運動—，
１３，粘菌の行動知とその仕組（迷路解き，径路探索アルゴリズム）
１４，粘菌の輸送ネットワークと人間社会の交通網，自然の形づくり
１５，モノの集団運動からみた社会のダイナミズム

grade: 3．成績の評価方法
レポート及び出席状況を総合的に評価する．

textbook: 4．教科書・参考書
教科書：
「教養の現代化学」 三共出版 多賀，片岡，早野著．参考書：

note: 5．履修にあたっての注意事項
化学の知識が必要なので，高校時代の化学の教科書や参考書を見ておくとよい．

remark: ６．備考
特になし．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
我々の生活は，実に多様な物質により支えられている．個人のあるいは世界の人々の衣食住の維持
•向上のためには，物質の科学が不可欠である．現代の物質科学の進歩は著しく，化学を中心に，物
理学や地球科学，環境学，エネルギー工学，材料学などと多面的に関連しながら発達している．そ
の範囲は極めて広く深いので，全貌を取り扱うには多くの時間が必要である．本講義では，学生諸
君が情報科学の専門家として社会に出た時に必要となるであろう物質科学の基本を理解すること
を目指す．これを習得しておけば，より個別的な問題に取り組む際に，大いに役立つであろう基本
事項である．基本事項の核心とは，
「原子•分子」の概念である．物質の性質や現象の驚くべき多様
さが，物質を構成する基本単位である「原子•分子」の比較的単純な性質に帰着できるのである．こ
のことをいくつかの身近な具体事例を通じてたどり，物質科学の考え方を身につける．

annual: 1-４年次

semesta:  後期集中

unitnum: 2 単位

teacher: 中垣 俊之

None
name: 現代の科学（Contemporary Sciences）

thema: 【テーマ・目標】
社会の中の科学技術の位置づけを確認し，自らがそこにどのように関わるべきかを考える．

_lecture_content: 【講義内容】
現代社会において，科学技術なしに生活を営むことはできない．しかし，科学技術の急速な発展
は，暮らしに大きな利便性をもたらす一方で，それを適切に利用するための社会システムや市民
のリテラシーが追いつかず，様々な不都合や問題も生んでいる． また，一見科学的でも実は根拠
の乏しい情報も氾濫し，専門知識を持たない多くの市民にとって，判断や選択は一層難しいもの
になっている．そういった中で，社会における科学技術の在り方に関する意思決定は，専門家に
任せるのではなく，誰もが主体的に参加すべきという考え方も広まりつつあり，理系人材には，
そのために必要な情報発信や議論などのコミュニケーション
（科学コミュニケーション）
を支援・
推進する役割も求められている．
本講義では，いくつかの身近な事例をもとに，各人が科学技術とどのように対峙するかを考えな
がら，科学技術と社会との関係性や，科学コミュニケーション活動の意義について議論するとと
もに，先端の科学技術を専門に学ぶ者としての心構えや社会的役割に対する考察を深める．

scgedule: 2．講義計画
以下のテーマについて，
通常の講義形式とワークショップ形式との組み合わせで行う．
（出席者数
その他に応じて変更の可能性有り）
・科学技術の営み（特徴や性質，社会との関わり，成果のデュアルユース）
・科学技術情報に対するメディアの役割，リスク情報の扱い方
・疑似科学や風評被害
・科学技術の発達と社会システム（政治・経済・法律・教育など）の変化
・社会に受容される科学技術のあり方（ユーザーイノベーションなど）
・科学技術に関する意思決定プロセスへの市民参加
・科学コミュニケーションの意義（専門家と非専門家のコミュニケーション）

grade: 3．成績の評価方法
各回の課題（レポート）提出による

textbook: 4．教科書・参考書
なし

note: 5．履修にあたっての注意事項
なし

remark: ６．備考
なし

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
社会の中の科学技術の位置づけを確認し，自らがそこにどのように関わるべきかを考える．

annual: 1-４年次

semesta:  後期集中

unitnum: 2 単位

teacher: 山科 直子

None
name: コミュニケーション論（Communication Theory）

thema: 【テーマ・目標】
・コミュニケーションによる学習手法，発見手法，問題解決手法，デザイン手法のひとつである
ワークショップについて，理論的かつ実践的に学ぶ．
・ワークショップデザインを通して，バーバルコミュニケーション，ノンバーバルコミュニケー
ション，ファシリテーションテーションなど，関連するコミュニケーション論の知識・技術を学
ぶ．

_lecture_content: 【講義内容】
ワークショップは参加型コミュニケーションツールあるいは参加型学習手法として，近年関心の
高い方法である．
この授業では，まずはじめにワークショップの参加やふりかえりを通して，ワークショップの企
画，設計，計画・準備，実施に関わるコミュニケーション論の知識と技術を学ぶ．また，受動的
な参加にとどまらず，受講生みずからがワークショップの企画，設計，計画・準備，実践を行う
ことで，座学によらず体験的にコミュニケーション論の知識と技術を学ぶ．
キーワード： ワークショップ，ワークショップデザイン，参加型デザイン，コミュニケーション
ツール，
ファシリテーション，
バーバル/ノンバーバルコミュニケーション，
体験とふりかえり
（リ
フレクション）

scgedule: 2．講義計画
下記のトピックについて１回あるいは複数回講義と演習を実施する，順番は前後する．
ワークショップ実践については受講生のグループが受講生に向けて企画・実践する．
1. ガイダンス：講義の進め方および履修上の注意
2. ワークショップデザイン
3. ファシリテーション
4. 傾聴とアサーション
5. ノンバーバルコミュニケーション
6. バーバルコミュニケーション
7. 市民参加論
8. ワークショップ実践

grade: 3．成績の評価方法
・グループワークを主とする授業であるため，やむを得ない理由がない限り，欠席は不合格の対
象となる．
・ワークショップの企画設計書および実施計画書を提出しないと不合格となる．
・成績評価は上記の内容と，グループワークへの参加態度により，総合的に判断する．
・参加態度についてはピア評価（学生同士の評価）も取り入れる．

textbook: 4．教科書・参考書
授業スライドを配信し，参考書は随時紹介する．

note: 5．履修にあたっての注意事項
・ディスカッションなどグループワークは，フィードバックのため録音録画する．
・授業の大半はグループワークである．グループワークに真剣に取り組める人だけ履修すること．

remark: ６．備考
・毎回ＰＣを必ず持参すること．

target: 対象コース 全コース
学部共通選択

thema: 【テーマ・目標】
・コミュニケーションによる学習手法，発見手法，問題解決手法，デザイン手法のひとつである
ワークショップについて，理論的かつ実践的に学ぶ．
・ワークショップデザインを通して，バーバルコミュニケーション，ノンバーバルコミュニケー
ション，ファシリテーションテーションなど，関連するコミュニケーション論の知識・技術を学
ぶ．

annual: 1-４年次

semesta:  後期集中

unitnum: 2 単位

teacher: 大塚 裕子

None
name: 情報機器概論（Introduction to Information System）

thema: 【テーマ・目標】
コンピュータ，情報処理技術，コンピュータリテラシ入門

_lecture_content: 【講義内容】
本講義は，本学における他の講義や演習に対する入門と位置づけられる．
本講義では，コンピュータ，ネットワーク，情報処理の体系や基礎知識を学び，これらを使用・
活用する上で守らなければならないルールやマナーについての理解も深める．実践的な知識を身
に付ける出発地点として，本学の情報ネットワークやサービスの利用法や Web ページの作成と
公開の方法を習得する．
学生自身が，本学における講義科目どうしの位置づけや重要性を認識し，本学で情報技術を学ぶ
意義や目的を確認する機会を提供する．
キーワード：情報技術の体系，情報システムと社会，情報技術の学習と活用

scgedule: 2．講義計画
1. ガイダンス
2. インターネットの利用，本学メールシステムの利用
3. 情報化社会
4. コンピュータの基礎と基本的な情報処理(1)
5. コンピュータの基礎と基本的な情報処理(2)
6. インターネットの基礎知識(1)
7. インターネットの基礎知識(2)
8. プログラミング概論と計算論的思考
9. マークアップ言語と HTML
10. メディアと表現の技術
11. ビッグデータと人工知能
12. 情報セキュリテイとプライバシ
13. 情報倫理と電子商取引
14. 知的財産

grade: 3．成績の評価方法
出席，講義ごとの小テストへの回答，演習課題の提出とその内容に基づいて総合的に評価する．

textbook: 4．教科書・参考書
教科書： 久野靖，佐藤義弘，辰己丈夫，中野由章 監修，
「キーワードで学ぶ最新情報トピック
ス 2017」
，日経 BP 社，2017 (ISBN:978-4-82229-221-8)
{http://ec.nikkeibp.co.jp/item/books/C92210.html}

note: 5．履修にあたっての注意事項
講義では HOPE システムを利用するので，
本学ネットワークへの接続が可能なノート PC を毎回
必ず持参すること．

remark: ６．備考
なし．

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
コンピュータ，情報処理技術，コンピュータリテラシ入門

annual: 1 年次

semesta:  前期

unitnum: 2 単位

teacher: 平田 圭二
白石 陽
高木 清二

None
name: 情報表現入門（Introduction to Information Expression）

thema: 【テーマ・目標】
情報表現を計画的かつ論理的な方法で行なうために必要な基礎力を身につけることを目標とす
る．これらの能力は，論理的思考力，初歩的プログラミング能力，分析力,表現力，成果物の作成
能力からなるものとし,次学期以降に開講される, 情報表現ならびにプログラミング関連教科への
接続を意図している.

_lecture_content: 【講義内容】
情報表現を行うための対象の観察・分析・様式化・再構築という手続きをアルゴリズミックな思
考に基づいて学ぶ．これと相関して，コンピュータを用いるために必要なプログラミング言語の
基礎を，情報表現を通して学ぶ．
表現に関連したテーマとしては，データが持つ情報属性を理解したうえで，それらを効果的に可
視化する方法などについて学ぶ．プログラミングに関連したテーマとしては，2 次元平面上に図
形を表示すること，繰り返しや関数呼び出しの概念を理解すること，アニメーション，ならびに
初歩的な対話処理を行なえるようになることを目指す．
キーワード: プログラミング, インフォグラフィックス， インタラクション

scgedule: 2．講義計画
以下の内容についての講義をおこなう(全 15 回).
1-2.ガイダンス， 描画, 変数, 条件分岐
3. 繰り返し，配列
4. ピンポンゲームの理解, ファイルの扱い
5. ゲームの拡張（設計）
6. ゲームの拡張（実装）
7. ゲーム設計のプレ発表
8. ゲームの発表と講評会
9. グラフの作成入門
10. グラフによる表現と実装
11. 生活時間の表現
１２. アプリケーションプログラムの設計
13. アプリケーションプログラムの実装
14. アプリケーションプログラムの発表と講評
15. センサやランプとの接続

grade: 3．成績の評価方法
試験: 小テストを行う. 全ての単元で合格点をとることを単位取得の資格とする. 成績上の配点は
10%. 2 度の講評をともなう課題（プログラム＋レポート＋口頭発表）で５０％の評価, その他
の課題(プログラム＋レポート)で４０％を基本とする. 課題の提出遅れ等については減点などの
調整を行う.

textbook: 4．教科書・参考書
教科書：Processing プログラミングで学ぶ 情報表現入門，美馬義亮 著（公立はこだて未来大
学出版会）
参考書：Processing をはじめよう，Casey Reas・Ben Fry 著，船田 巧 訳
Built with Processing デザイン/アートのためのプログラミング入門，前川峻志・田中孝太郎

note: 5．履修にあたっての注意事項
原則として, 欠席は認めない．

remark: ６．備考
授業時間には，課題作成のための作業時間が含まれている．

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
情報表現を計画的かつ論理的な方法で行なうために必要な基礎力を身につけることを目標とす
る．これらの能力は，論理的思考力，初歩的プログラミング能力，分析力,表現力，成果物の作成
能力からなるものとし,次学期以降に開講される, 情報表現ならびにプログラミング関連教科への
接続を意図している.

annual: 1 年次

semesta:  前期

unitnum: 2 単位

teacher: 佐藤 生馬
角 薫
角 康之
竹川 佳成
美馬 義亮
村井 源

None
name: 科学技術リテラシ（Science and Engineering Literacy）

thema: 【テーマ・目標】
大学では，論文等を読み解く能力や，論理的かつ明快な文章を書く能力が必要とされている．本
授業では，このような能力を習得するための第一歩として，以下を目標とする．
・情報ライブラリのサイトを使って，書籍や論文を検索できる
・科学技術に関する論文（数ページ程度）を読み，必要な情報を抽出できる
・文章作成プロセスにしたがい，序論・本論・結論からなるレポート（1500 字程度）を作成で
きる
・学生同士で互いの文章を推敲できる

_lecture_content: 【講義内容】
授業は，ｅラーニングと対面授業とを組み合わせた反転形式である．ｅラーニングによって文章
の書き方に関する知識を習得し，文章作成の演習に取り組む．対面授業では，作成した文章につ
いて学生同士で推敲し，改善していく．

scgedule: 2．講義計画
第 1 回 オリエンテーション ： 授業概要，プレテスト
第 2 回～第 5 回 ミニ課題の作成―文章作成のプロセスの実践
(1)マップ作成，ピアレビューのやり方
(2)詳細化アウトライン，論理関係
(3)パラグラフ化
(4)推敲
第 6 回～第 14 回 最終課題レポートの作成
(1)テーマ検討
(2)文献検索，引用の仕方
(3)マップ，アウトラインマップ，詳細化アウトラインの作成，パラグラフ化，推敲
(4)文章の評価の仕方（ルーブリックの使い方）
第 15 回 まとめ ： 期末試験
キーワード: 理系の文章技術 批判的思考 主張文・理由づけ・証拠 ピアレビュー

grade: 3．成績の評価方法
ミニ課題，最終課題レポート，小テスト，期末試験の累積得点が合格点(60%)に達していること
を単位取得条件とする．課題の評価指標（ルーブリック）は，授業内で提示する．
なお，出席回数が，全授業回の 3 分の 2 未満の場合は不合格とする．

textbook: 4．教科書・参考書
教科書１: オリジナルテキスト
教科書２：阿部圭一・冨永敦子 「伝わる日本語」練習帳，近代科学社，2016．

note: 5．履修にあたっての注意事項
・毎回，自分の PC を持参すること．
・大幅な遅刻，居眠り，授業に関係ない Web 等の閲覧，Twitter 等 SNS への書きこみ，メール
のやりとり，飲食などを授業中に行った場合は退室を求める．

remark: ６．備考
・授業内容の順序は前後することがある．
・授業に関する質問は教員だけでなく，授業中では TA，授業外ではメタ学習ラボでも受け付け
る．積極的に活用すること．

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
大学では，論文等を読み解く能力や，論理的かつ明快な文章を書く能力が必要とされている．本
授業では，このような能力を習得するための第一歩として，以下を目標とする．
・情報ライブラリのサイトを使って，書籍や論文を検索できる
・科学技術に関する論文（数ページ程度）を読み，必要な情報を抽出できる
・文章作成プロセスにしたがい，序論・本論・結論からなるレポート（1500 字程度）を作成で
きる
・学生同士で互いの文章を推敲できる

annual: 1 年次

semesta:  前期

unitnum: 2 単位

teacher: 冨永 敦子
椿本 弥生
辻 義人

None
name: 物理学入門（Introduction to Physics）

thema: 【テーマ・目標】
数理・情報系専門科目を履修するための力学の基礎を学ぶ．
物理学の中で最も基礎的な質点の力学を学ぶことにより，
物理学の考え方を理解，
修得すること．

_lecture_content: 【講義内容】
物理学は自然科学の中で最も基礎的な学問の一つであり，本学における様々な関連分野の講義を
学ぶにあたって物理学を理解することが必要である．高等学校で「物理」を履修していない学生，
もしくは十分に学んでいない学生のために力学の基本的な概念と物体の運動を記述する力学法則
を学ぶ．また，複雑な力学現象における多くの要素の中から重要な要素を取り出し単純化，抽象
化して運動を記述する方法を学ぶ．

scgedule: 2．講義計画
1． 物理量と単位
2． 質点の運動 位置と変位 速度 加速度
3． 基本的な一次元運動
4． 基本的な二次元運動
5． 運動の法則１
6． 運動の法則２ 等速円運動１
7． 等速円運動２
8． 単振動と正弦波１
9． 単振動と正弦波２
10． 仕事と運動エネルギー
11． 位置エネルギーと力学的エネルギー保存
12． 運動量と力積１
13． 運動量と力積２
14． 気体の分子運動論
15． 期末試験

grade: 3．成績の評価方法
期末試験および小テスト・課題の提出状況などを加味し総合的に評価する．

textbook: 4．教科書・参考書
毎回プリント（講義資料・演習問題）を配付する．

note: 5．履修にあたっての注意事項
事前に数学（ベクトル・三角比・微分積分）について復習しておくこと．
講義の最後に配布する演習問題の解説は，次回の講義で行うので事前に解いておくこと．

remark: ６．備考
力学基礎・力学応用への橋渡しの重要な講義なので，高校で物理を履修したが関心のあるもの，
また高校で物理を履修しなかったものは履修することが望ましい．

target: 対象コース 全コース
学部専門選択

thema: 【テーマ・目標】
数理・情報系専門科目を履修するための力学の基礎を学ぶ．
物理学の中で最も基礎的な質点の力学を学ぶことにより，
物理学の考え方を理解，
修得すること．

annual: 1 年次

semesta:  前期

unitnum: 2 単位

teacher: 及川 潔

None
name: 情報数学（Information Mathematics）

thema: 【テーマ・目標】
コンピュータ科学・情報科学の発展を支える基盤となっている「離散数学」の基本を理解する．

_lecture_content: 【講義内容】
情報科学や情報工学の分野で使用される「離散数学」の基本を（扱われているテーマや用いられ
ている専門用語を中心に）理解する共に，その分野における豊かな発想と論理的思考について学
び，将来，情報系の専門分野を理解するための基礎知識と技術を獲得する．
・集合，関数，論理などの記号の定義と使い方（集合の記法，関数に関する諸概念-定義域，値域，
全射，単射，命題論理記号，述語論理記号）
・関係，順序などの基本的な数学概念とその使い方（二項関係，同値関係，半順序関係，全順序
関係）
・帰納法を使った証明，再帰的な定義などの方法（帰納法の原理，帰納法の各種バリエーション，
再帰的な定義の例，構造に基づく帰納法，各種数え上げ問題）
・グラフ理論の基礎（木，全域木，木の探索，グラフの連結性，グラフの彩色）

scgedule: 2．講義計画
離散集合
論理と証明
写像・関数
帰納法
離散関係
離散グラフ
木グラフ

grade: 3．成績の評価方法
期末試験，
（場合によっては中間試験）
，小テスト，課題（演習及びレポート）によって総合的に
判断する．
期末試験の受験資格は原則として, 規定授業回数の 3 分の 2 以上出席していること.
再試験は,原則として（特別の事情がないかぎり）行わない.

textbook: 4．教科書・参考書
教科書：授業開講時に指示する．
参考書：
・
「はじめての離散数学」 小倉久和著 近代科学社 2011 年
・
「離散数学 コンピュータサイエンスの基礎数学」 マグロウヒル大学演習シリーズ
リピュッツ著 成嶋弘監訳 オーム者 1995 年

note: 5．履修にあたっての注意事項
高校ではなじみが少ない内容であるので，予習，復習を行なうこと．学習の範囲が広いので，冗
長のない講義を行なう．したがって，遅刻や欠席をしないこと．

remark: ６．備考
なし．

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
コンピュータ科学・情報科学の発展を支える基盤となっている「離散数学」の基本を理解する．

annual: 1 年次

semesta:  後期

unitnum: 2 単位

teacher: 佐藤 直行
髙木 清二
寺井 あすか

None
name: プログラミング基礎（Basic Programming）

thema: 【テーマ・目標】
情報表現入門で学んだことをもとに，C 言語について学び，プログラミング（概念，考え方）へ
の理解を深める．

_lecture_content: 【講義内容】
プログラミングの基礎概念である，変数，条件分岐，繰り返し，配列，関数，文字列，ポインタ，
ファイル入出力などについて学ぶ．
講義だけでなく，演習として課題（プログラム）に取り組むことで学習内容の理解を深める．
キーワード：プログラミング，C 言語，アルゴリズム

scgedule: 2．講義計画
以下の内容についての講義・演習を行う．
1.変数，データ型
2.演算子，条件分岐
3.繰り返し，配列
4.関数
5.文字列処理
6.ポインタ
7.ファイル入出力
8.まとめ

grade: 3．成績の評価方法
期末試験を実施．
期末試験の結果を重視し，各回の課題（プログラム）の提出状況を考慮する．
課題提出の遅れに対しては，減点を行う．

textbook: 4．教科書・参考書
教科書：実用マスターシリーズ 明快入門 C，林 晴比古，ソフトバンククリエイティブ
参考書：C 言語によるプログラミング 基礎編 第 2 版，内田 智史監修，オーム社

note: 5．履修にあたっての注意事項
原則として，欠席は認めない．予習と復習を前提として講義を進める．
理解度向上のために自習を行うことを強く推奨する．

remark: ６．備考
後期の前半に集中して行う．

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
情報表現入門で学んだことをもとに，C 言語について学び，プログラミング（概念，考え方）へ
の理解を深める．

annual: 1 年次

semesta:  後期

unitnum: 2 単位

teacher: 香取 勇一
白石 陽
高 博昭
寺沢 憲吾
中村 嘉隆
Ian Frank
和田 雅昭

None
name: 電子工学基礎（Basic of Electronics）

thema: 【テーマ・目標】
本科目では，高校または大学一年の前期で学んだ線形代数と解析学を通して，電気回路の基礎的
な性質に関して講義を行う．電源，抵抗，コンデンサとコイルを含む基礎的な回路の原理を理解
し，講義の最終回では，半導体の開発の歴史，基本的性質，ダイオード，トランジスタ，LSI へ
の進歩などを学び，電子工学の基礎知識取得を目的とする．

_lecture_content: 【講義内容】
本科目は学部一年の学生を対象とする回路理論への入門科目である．科目の前半では，電気回路
論の基礎として線形デバイスの特徴，直流回路理論から始まり，受動回路，直流回路の回路方程
式の理解，線形代数の基礎知識を用いてそれを解くことにより，様々な回路の振舞いを学ぶ．後
半では，正弦波交流と受動素子の交流特性，複素数と正弦波の複素表示を学び，複素数を用いた
交流回路の基礎的な動作に関して理解する．

scgedule: 2．講義計画
1. 回路の基本概要，Ohm の法則と Kirchoff の法則
-抵抗とオームの法則
-キャパシタとインダクタ
-直列接続，並列接続とコンダクタンス，双対性
-キルヒホッフの法則
-重ね合わせの理，テブナンの定理
-ブリッジ回路
-回路方程式
4. コンデンサとコイルの物理
5. 複素解析の基礎
-正弦波の複素表示
-極座標，直交座標表示
-オイラーの公式
6. 交流電圧，電流，電力
-平均値と実効値
-正弦波交流と受動素子の交流特性
7. 基礎的な交流回路
8. 半導体の物理とダイオード・トランジスタ

grade: 3．成績の評価方法
本科目の評価は，授業中の小テスト，課題レポート，中間試験，期末試験で決定する．基本的に
は中間試験，期末試験にて 8 割，小テスト，課題レポートにて 2 割の配分とする．

textbook: 4．教科書・参考書
教科書：電気学会大学講座 「回路理論基礎」 電気学会 オーム社
参考書：電気回路教本 秋月影雄監修，橋本洋司著 オーム社

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 全コース
学部専門選択

thema: 【テーマ・目標】
本科目では，高校または大学一年の前期で学んだ線形代数と解析学を通して，電気回路の基礎的
な性質に関して講義を行う．電源，抵抗，コンデンサとコイルを含む基礎的な回路の原理を理解
し，講義の最終回では，半導体の開発の歴史，基本的性質，ダイオード，トランジスタ，LSI へ
の進歩などを学び，電子工学の基礎知識取得を目的とする．

annual: 1 年次

semesta:  後期

unitnum: 2 単位

teacher: 藤野 雄一，
佐藤 生馬

None
name: 情報マネージメント論（Management of Information Industry）

thema: 【テーマ・目標】
本講義では，第 4 の経営資源としての"情報”と"情報”を利用した情報システムのマネージメン
トをテーマとする．"情報"の特質や企業経営等における情報の役割を明らかにし，情報と情報シ
ステムがいかに生まれ育ってきたか，そのマネージメントの必要性や有用性を理解することを目
標とする．

_lecture_content: 【講義内容】
講義では，企業における活動や戦略に対して情報システムとの関係や位置付けを明らかにし，そ
こでのマネージメントの役割を学ぶ．また，情報システムの構築に関する戦略や開発プロセス，
プロジェクトマネージメントについて学ぶ．また，顧客，商取引，組織との関係に注目した情報
システムを扱い，情報や情報システムの新たな活用方法やセキュリティやコンプライアンス，シ
ステム監査などの問題にも言及する．
※情報処理技術者試験や IT パスポートなどの資格試験におけるストラテジー系，
マネージメント
系の分野を対象とする．

scgedule: 2．講義計画
1. 情報マネージメントとは
2.情報マネージメントの基礎知識
3. ビジネスと経営に着目した情報マネージメント
4. 企業活動
5. 企業と法務
6. 企業戦略マネージメント
7. 技術戦略マネージメント
8. 情報システム戦略, システム計画
9. プロジェクトと情報マネージメント
10. 情報システム開発に関する情報の管理
11. 個人情報と組織の情報
12. クラウド時代の情報マネージメント
13. 目的による情報の特徴と管理
14. インターネットと情報倫理
キーワード：ビジネス 経営 戦略 情報システム プロジェクトマネージメント

grade: 3．成績の評価方法
期末テスト，小テスト，課題，出席状況などにより総合的に評価する．

textbook: 4．教科書・参考書
必要な場合は講義の中で指定する．

note: 5．履修にあたっての注意事項

remark: ６．備考
情報処理技術者などの資格試験や検定試験におけるマネジメント系，ストラテジー系に対応して
いる．

target: 対象コース外の学生は定員を超えた場合，受講不可とする場合がある．
対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
本講義では，第 4 の経営資源としての"情報”と"情報”を利用した情報システムのマネージメン
トをテーマとする．"情報"の特質や企業経営等における情報の役割を明らかにし，情報と情報シ
ステムがいかに生まれ育ってきたか，そのマネージメントの必要性や有用性を理解することを目
標とする．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 大場 みち子

None
name: ハードウェア基礎（Basic Hardware）

thema: 【テーマ・目標】
コンピュータは論理回路を基本として，それらを組み合わせた大規模なハードウェアである．こ
の講義では基本となるデータ表現および論理回路の基本的な性質をまなぶとともに，それらを組
み合わせてコンピュータを構成するまでの各段階を順を追って学んでゆく．

_lecture_content: 【講義内容】
コンピュータハードウェアは，0 と 1 の二つの状態を扱うことのできる電子回路をもとにつくら
れた，きわめて大規模なシステムである．この講義の前半では，コンピュータの内部でのデータ
表現法を理解するとともに，ブール代数などの数学的なモデルをもとに，それを処理する組合せ
論理回路，順序回路などの論理回路の動作原理や，機能的ビルディングブロックについて学ぶ．
後半ではプロセッサの基本構成，アセンブリ言語，命令セット，記憶装置，入力装置などコンピ
ュータアーキテクチャの基礎を学ぶ．

scgedule: 2．講義計画
1 コンピュータハードウェアとは(1 週)
・コンピュータのしくみ，ディジタルによる抽象化，ハードウェアとは，講義の構成
2 データ表現(2 週)
・数の体系，文字コードと符号化，論理ゲート，ディジタル化抽象化の裏側
3 論理回路(5 週)
・集合演算，ブール論理式，ブール代数，主加法標準形，マルチレベル論理回路
・カルノーマップ，加算器，マルチプレクサ，デコーダ，タイミング
・ラッチとフリップフロップ，同期式順序回路，レジスタ，メモリ，有限状態マシン
4 アーキテクチャ(3 週)
・プロセッサの基本構成，アセンブリ言語，機械語，番地指定モード
・コンパイル，アセンブル，ロード，プロセッサの実例
5 記憶装置(1 週)
・記憶装置の原理，主記憶装置，補助記憶装置
6 入出力装置(1 週)
・入出力装置，入出力インタフェース
7 コンピュータの性能と信頼性(2 週)
・性能の尺度，性能の推移，コンピュータの信頼性の評価

grade: 3．成績の評価方法
単位認定は以下の条件を前提とする．
・全講義回数の 2/3 以上の出席
・すべての課題(レポート)が提出されていること
・総合点で 60 点以上の獲得
なお総合点は，基本的に課題(レポート)の評価(20%)と期末試験の成績(80%)から求める．

textbook: 4．教科書・参考書
(教科書) D. ハリス，S. ハリス: ディジタル回路設計とコンピュータアーキテクチャ， 翔泳社．
この教科書は 2 年生後期に開講されるハードウェア設計でも使用する．
(参考書) 橋本，松永，小林，天野: 図解 コンピュータ概論 ハードウェア 改訂第 3 版， オーム
社

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
コース専門必修
情報デザイン
コース専門選択

thema: 【テーマ・目標】
コンピュータは論理回路を基本として，それらを組み合わせた大規模なハードウェアである．こ
の講義では基本となるデータ表現および論理回路の基本的な性質をまなぶとともに，それらを組
み合わせてコンピュータを構成するまでの各段階を順を追って学んでゆく．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 川嶋 稔夫
藤野 雄一
白勢 政明

None
name: 確率・統計学（Probability Theory and Statistics）

thema: 【テーマ・目標】
【テーマ】
確率論・統計学の基礎，および工学へ応用する方法を学び，確率論の利用法を理解する．
【目標】
・確率論の基礎を理解する．
・統計学の基礎を理解する．
・確率密度関数および確率分布関数を理解する．
・確率過程を表現するための様々な特徴量(平均，分散，共分散，自己相関関数，電力スペクトル
等)を理解する．
・確率論・統計学を工学に応用した例（主成分分析，予測，学習と認識等）を学び，確率論の利
用法を理解する．

_lecture_content: 【講義内容】
数理統計学の基礎を理解するために必要な基礎知識，および工学へ応用する方法を学ぶ．

scgedule: 2．講義計画
1. 確率と工学の結びつき
2. 確率論の基礎
3. 確率変数，確率密度関数，確率分布関数，
4. 確率変数のモーメント，平均，分散，共分散
5. 主成分分析
6. 確率過程の時間平均，自己相関関数，フーリエ変換，電力スペクトル
7. 学習と認識（条件付き確率密度関数による）
8. フーリエ級数展開と予測
※講義の進捗状況に応じて講義内容が多少異なる場合があります．

grade: 3．成績の評価方法
・期末試験．
・状況に応じてレポート．
・講義中の質疑応答及び受講態度．
・課題に対するレポート提出が要求された場合は，必ず提出すること．
・再試験はありません．

textbook: 4．教科書・参考書
教科書：別途指示する．
参考書：中川正雄，真壁利明著，確率過程，培風館
A.コルモゴロフ; I.ジュルベンコ; A.プロホロフ, コルモゴロフの確率論入門, 森北出版

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
情報デザインコースは，複雑系知能学科のシラバスを参照のこと．

target: 対象コース 情報システム
高度 ICT
コース専門必修
情報デザイン
コース専門選択

thema: 【テーマ・目標】
【テーマ】
確率論・統計学の基礎，および工学へ応用する方法を学び，確率論の利用法を理解する．
【目標】
・確率論の基礎を理解する．
・統計学の基礎を理解する．
・確率密度関数および確率分布関数を理解する．
・確率過程を表現するための様々な特徴量(平均，分散，共分散，自己相関関数，電力スペクトル
等)を理解する．
・確率論・統計学を工学に応用した例（主成分分析，予測，学習と認識等）を学び，確率論の利
用法を理解する．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 佐藤 仁樹
姜 暁鴻

None
name: 形式言語とオートマトン（Formal Languages and Automata）

thema: 【テーマ・目標】
コンピュータによる記号・計算・言語処理の基礎を学ぶ．

_lecture_content: 【講義内容】
コンピュータによる情報処理は，基本的には記号の集まりからなるデータの処理である．そこで
は，記号の並べ方によりどれくらいの記述能力があり，それを処理するにはどのような能力をも
った機械が必要であるか，またそのためにどのくらいの処理時間を要するのかを見極めておく必
要がある．記号の並べ方は，いわゆる文法規則であるが，この規則をクラス分けして，それぞれ
のクラスごとに表現能力や計算機械の能力を分析する．
このような学習を通じて，表現の基本的なモデルや考え方を学び，一方それに対応した計算機械
の基本的なモデルを学び，
表現することおよび計算することの基礎を習得することを目的とする．
これにより，コンピュータの処理の限界も明確になり，より上位の情報処理を考えるときにも，
基本的な枠組みは変わらないので，
ここで学ぶことは情報処理の基礎的な概念として重要である．

scgedule: 2．講義計画
1.形式文法と形式言語に関する基礎概念
2.オートマトンに関する基礎概念
3.正規文法と有限オートマトン
4.文脈自由言語とプッシュダウンオートマトン
5.句構造文法とチューリングマシン

grade: 3．成績の評価方法
期末テスト，小テスト，課題，出席状況などにより総合的に評価する．

textbook: 4．教科書・参考書
教科書：オートマトン・言語理論の基礎，米田政明他，近代科学社
参考書：オートマトン 言語理論 計算論 I，J.ホップクロフト/J.ウルマン共著，サイエンス社

note: 5．履修にあたっての注意事項
「情報表現入門」および「プログラミング基礎」を履修していることが望ましい．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
コンピュータによる記号・計算・言語処理の基礎を学ぶ．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 塚田 浩二

None
name: アルゴリズムとデータ構造（Algorithms and Data Structures）

thema: 【テーマ・目標】
“アルゴリズムとデータ構造”は，アルゴリズムを設計し，効率的なプログラムを作成するため
に，必ず学ばねばならない基礎知識の要である．優れたアルゴリズムの動作原理の理解とプログ
ラムとしての実現の技術を学ぶ．データ構造と探索のプログラムをＣ言語を用いて実現する方法
を習得する．

_lecture_content: 【講義内容】
アプリケーションやシステムを効率的に表現するために必要な計算手順とデータ構造について，
その特徴や存在意義，応用について学ぶ．効率の良いソフトウエアを実現するためには，扱うデ
ータをいかに目的に合ったアルゴリズムに適した構造で表現するかが大きな問題である．本講義
では，配列，スタック，キュー，リスト，木などの代表的なデータ構造と，それを取り扱うアル
ゴリズムを解説し，これらを通じて，ソフトウエアの設計や解析をするための基本的な考え方の
習得を目指す．本講義は，全てのソフト開発の基礎となる重要な基礎科目である．コンピュータ
の世界は，日進月歩である．しかし，物事の本質を理解しておけば，表面的な変化があっても，
正しい対処はできる．授業では，分かりやすく整理されたプログラムを書くこと，プログラムの
実行に要する計算手間を客観的に評価すること，などの重要な概念や実用上の重要なものについ
て述べる．
キーワード：アルゴリズム, データ構造, 計算量

scgedule: 2．講義計画
1. 序論（計算手順の概念，効率の良いアルゴリズム）とプログラム実行環境の確認
2. 基本的なデータ構造とその表現 1（配列，ポインター）
3. 基本的なデータ構造とその表現 2（構造体）
4. 文字列処理（C 言語の文字列と文字列検索）
5. データ構造 1（スタック）
6. 動的メモリ管理
7. データ構造 2（キュー）
8. データ構造 3（単連結リスト構造）
9. データ構造 4（重連結リスト構造）
10.アルゴリズムの再帰的，非再帰的な表現
11.整列（ソート）1
12.整列（ソート）2
13.木構造
14.整列（ソート）3
15.平衡木
本講義の manaba コース： {https://manaba.fun.ac.jp/ct/course_19107}

grade: 3．成績の評価方法
毎回行う演習(20%)，課題（プログラム:30%）
，期末試験(50%)により，講義で学習したデータ
構造とアルゴリズムの理解度を評価する．

textbook: 4．教科書・参考書
教科書：
「新・明解 C 言語によるアルゴリズムとデータ構造 」
，柴田望洋・辻亮介 著，ソフトバ
ンククリエイティブ(ISBN 9784797366242 , 2011/08/27 出版)
参考書：
「C によるアルゴリズムとデータ構造」
，茨木俊秀著，昭晃堂
「アルゴリズム C」第 1 巻・第 2 巻・第 3 巻，R.セジウィック著，近代科学社

note: 5．履修にあたっての注意事項
反転講義以外では，各時間の前半は講義中心であるが，授業の後半で C のプログラムを用いた練
習問題で演習を行い，さらに，課題として練習問題で用いたプログラムの改良を指示する．

remark: ６．備考
前半のＣ言語の復習では，反転(講義内容を宿題として行い，教室で演習を行う)講義形式で行う．
後半では，各講義が相互に関連するため，講義を休むと以後の内容が理解出来ない恐れがある．

target: 対象コース 情報システム
高度 ICT
情報デザイン
学科共通必修

thema: 【テーマ・目標】
“アルゴリズムとデータ構造”は，アルゴリズムを設計し，効率的なプログラムを作成するため
に，必ず学ばねばならない基礎知識の要である．優れたアルゴリズムの動作原理の理解とプログ
ラムとしての実現の技術を学ぶ．データ構造と探索のプログラムをＣ言語を用いて実現する方法
を習得する．

annual: ２年次

semesta:  前期

unitnum: 2 単位

teacher: 高橋 信行
加藤 浩仁

None
name: センサ工学（Sensor Engineering）

thema: 【テーマ・目標】
日常生活から社会基盤までを支えるセンサ技術，ならびに，センサ処理技術について基礎から応
用までを学ぶ．

_lecture_content: 【講義内容】
センサは家電機器やスマートフォンはもちろん，自動車や建築など，日常のいたるところに組み
込まれて利用されています．この講義では，実社会でどのようなセンサが用いられているかを概
観した上で，センサはどのように対象を計測し情報を取り出しているのか，また，計測した情報
はどのように処理されているのかを実習を交えて学習します．

scgedule: 2．講義計画
1. センサの概要と測定技術(2)
2. 基礎的なセンサ(3)
光センサ，温度センサ，圧力センサ，磁気センサ，加速度センサ，超音波センサ，他
3. インタフェース回路とアクチュエータ(3)
センサ信号の増幅，伝送，AD／DA 変換，
DC モーター，ステッピングモーター，サーボモーター，他
4. 高度なセンサと情報処理(4)
GPS，RFID，画像認識（画像理解，バーコード，2 次元コード）
，雑音やひずみ軽減，
時系列データ処理，パターン検出，他
5. 発展技術(3)
ユビキタスコンピューティング，センサネットワーク，ヘルスケア，ライフログ，他

grade: 3．成績の評価方法
出席，課題（レポート）
，期末試験で総合的に評価します．
単位認定は全講義回数の 3 分の 2 以上の出席と，
総合点で 60 点以上を獲得することを条件とし
ます．

textbook: 4．教科書・参考書
特になし

note: 5．履修にあたっての注意事項
「電子工学基礎」
，
「ハードウェア基礎」
，
「情報処理演習 II」の履修を推奨する．

remark: ６．備考
特になし

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
日常生活から社会基盤までを支えるセンサ技術，ならびに，センサ処理技術について基礎から応
用までを学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 塚田 浩二
和田 雅昭

None
name: ハードウェア設計（Hardware Design）

thema: 【テーマ・目標】
ハードウェアの設計に関する考え方を理解する．

_lecture_content: 【講義内容】
ハードウェア基礎から発展した内容を扱う．この講義では，現在のプロセッサが当然のように利
用している高性能化にかかわる技術や，ディジタル論理回路の具体的な設計法，身近に存在する
コンピュータシステムである組込システムに関する技術について学ぶ．
キーワード：プロセッサアーキテクチャ，メモリアーキテクチャ，記述言語，論理設計理論

scgedule: 2．講義計画
1 パイプラインプロセッサ(3)
・パイプラインデータパス，パイプライン制御，ハザード
2 メモリシステム(3)
・キャッシュメモリ
3 同期式順序回路の設計(4)
・同期式順序回路の設計，有限状態マシンの設計，順序回路のタイミング
4 ハードウェア記述言語(5)
・ハードウェア記述言語とは，組合せ論理回路の表現，構造化，順序回路
・論理回路シミュレーション

grade: 3．成績の評価方法
単位認定は以下の条件を前提とする．
・全講義回数の 2/3 以上の出席
・すべての課題の提出
・期末試験で 60 点以上の獲得

textbook: 4．教科書・参考書
(教科書) D. ハリス，S. ハリス: ディジタル回路設計とコンピュータアーキテクチャ， 翔泳社．
この教科書は 2 年生前期に開講されるハードウェア基礎でも使用する．

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 高度 ICT
コース専門必修
情報システム
情報デザイン
コース専門選択

thema: 【テーマ・目標】
ハードウェアの設計に関する考え方を理解する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 長崎 健
白勢 政明

None
name: 人工知能基礎（Basic Artificial Intelligence）

thema: 【テーマ・目標】
人間のように知的に思考し問題解決を行う人工的システム(ロボットやプログラム)の基本概念と
問題解決手法について学ぶ．

_lecture_content: 【講義内容】
本講義では，人工知能の目標とその意義を明らかにし，基本的な問題解決手法を理解し，応用に
関して学ぶ．問題解決手法に関しては，状態空間探索，制約充足の技法について学ぶ．
さらに，知識表現の手法に関し学び，最後に，知識を用いた問題解決システムの具体例として知
識ベースシステムとプロダクションシステムについて学ぶ．
本講義を履修することで，主に離散的で静的（もしくは準動的）な環境において，効率の良い個
別アルゴリズムが知られていない悪構造問題に対し，その問題を定式化し，適切な問題解決手法
を適用することで，解を効率よく得るための方法論の基礎について学ぶことができる．

scgedule: 2．講義計画
1. 人工知能研究の概要，背景，歴史
2. 問題解決 I －状態空間探索－
（ヒューリスティック探索とゲームプレイング/問題分割）
3. 問題解決 II －制約充足－
（後戻り法，ノード制約，アーク制約，経路制約アルゴリズム）
4. 知識表現と推論
（意味ネットワーク，フレームシステム，知識表現言語，プロダクションシステム）

grade: 3．成績の評価方法
課題，中間試験および期末試験の総合的な評価による．
それぞれの配分は以下の通り．
課題: 10%
中間試験: 45%
期末試験: 45%

textbook: 4．教科書・参考書
西田豊明著:「人工知能の基礎」
，丸善

note: 5．履修にあたっての注意事項
「アルゴリズムとデータ構造」を履修していること．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
人間のように知的に思考し問題解決を行う人工的システム(ロボットやプログラム)の基本概念と
問題解決手法について学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 大澤 英一
Ian Frank

None
name: 認知心理学（Introduction to Cognitive Psychology）

thema: 【テーマ・目標】
認知心理学の基本的な問題について学ぶとともに，その研究方法の基礎を習得する．

_lecture_content: 【講義内容】
認知心理学で扱う諸問題について解説するとともに，基礎的な研究方法についての講義を行う．
認知心理学は，人間の認知過程を，目に見える行動の系統だった観察から出発して，科学的に解
明しようとする学問であり，人工知能，ロボティクス，脳科学などとも隣接している．また，人
間の行為の基礎にある暗黙知を認知心理学的に明らかにすることは，ヒューマンインターフェイ
スへの応用にもつながる． 本講義では，認知心理学の基本的な問題について学ぶとともに，実験
で得られたデータを分析するために統計法の基礎についても学習する．
キーワード: 知覚，行為，視覚，言語，学習，認知過程，ヒューマンインターフェイス，ロボテ
ィクス，統計的手法
keywords: perception, behavior, vision, language, learning, cognitive process, human
interface, robotics, statistical method

scgedule: 2．講義計画
実験で得られたデータを分析するために統計法の基礎についても学習する．
1. 認知心理学と研究計画法と統計法の関係
2. 認知心理学の歴史と未来大で学ぶ意味
3. 平均値と標準偏差
4. 正規分布と標準化
5. 相関
6. 統計的仮説検定
7. t 検定(1)
8. t 検定(2)
9. 視覚認知
10. 聴覚による認知（音の性質）
11. 聴覚による認知（外界の認知）
12. カテゴリー化・知識の表象と構造
13. 言語とコミュニケーション
14. 認知心理学講義のまとめ

grade: 3．成績の評価方法
授業時間中の小課題，レポートおよび期末試験により評価する．

textbook: 4．教科書・参考書
教科書 箱田裕司ほか 認知心理学 有斐閣
教科書 山内光哉 心理・教育のための統計法 第 3 版 サイエンス社

note: 5．履修にあたっての注意事項
「認知心理学演習」と同時に履修すること．
「確率・統計学」の知識に基礎をおくが，未履修でも受講可能とする．
教科書は，卒業研究の際に役立つ場合も多いので，必ず購入すること．

remark: ６．備考
なし．

target: 対象コース 情報システム
高度 ICT
情報デザイン
学科共通必修

thema: 【テーマ・目標】
認知心理学の基本的な問題について学ぶとともに，その研究方法の基礎を習得する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 美馬 のゆり
中田 隆行
伊藤 精英
花田 光彦
南部 美砂子

None
name: 認知心理学演習（Seminars in Cognitive Psychology）

thema: 【テーマ・目標】
認知過程の記述方法・推定方法の実際を，実験中心に体験的に学ぶ．

_lecture_content: 【講義内容】
認知心理学で扱ういくつかの基本的なトピックスを体験しながら，実験的手法の考え方および観
察法などの技法を学ぶ．
「認知心理学」
の講義と対応しながら統計的手法についても学び，
ここで
は実際のデータ分析に適用し，科学的に根拠のある結論を導く方法の習得をめざす．同時に，実
験レポートの書き方も習得する．
キーワード: 実験手法，観察，測定，データ分析，統計的手法，相互行為分析
keywords: experiment technique, observation, measurement, data analysis, statistical
method, interaction analysis

scgedule: 2．講義計画
下記のテーマについて 2 ないし 3 週ずつの演習をおこない，
解説を加え，
テーマごとにレポート
を提出する．必要に応じ，統計法を実際に使ってのデータ分析が求められる．
1. 解説：実験の行い方・心得
2. 解説：実験レポートの書き方
3. テーマ 1：両眼立体視 解説と実験
4. テーマ 1：両眼立体視 解説と実験
5. テーマ 2：重量弁別 解説と実験
6. テーマ 2：重量弁別 解説と実験
7. テーマ 2：重量弁別 解説と実験
8. テーマ 3：音楽の知覚・認知 解説と実験
9. テーマ 3：音楽の知覚・認知 解説と実験
10. テーマ 4：相互行為分析 解説と実験
11. テーマ 4：相互行為分析 解説と実験
12. テーマ 4：相互行為分析 解説と実験
13 レポートの.ピアレビュー
14. 解説：レポートの講評・ディスカッション

grade: 3．成績の評価方法
レポートにより評価する．すべてのテーマにおいて，データ収集に参加しかつレポートを提出す
ることが，単位認定の要件となる．

textbook: 4．教科書・参考書
教科書：なし
参考書：心理学実験指導会編 実験とテスト 心理学の基礎 実習編・解説編 培風館

note: 5．履修にあたっての注意事項
「認知心理学」と同時に履修すること．

remark: ６．備考
実験は割り当てられたグループで実施する．場合によっては，実験が演習時間内に終わらないこ
ともあるので，演習時間の後の予定には注意が必要．

target: 対象コース 情報システム
高度 ICT
情報デザイン
学科共通必修

thema: 【テーマ・目標】
認知過程の記述方法・推定方法の実際を，実験中心に体験的に学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 美馬 のゆり
中田 隆行
伊藤 精英
花田 光彦
南部 美砂子

None
name: オペレーションズリサーチ（Operations Research）

thema: 【テーマ・目標】
様々な問題の数学モデルを構築し，最適な解や戦略を見つける方法を学ぶ．

_lecture_content: 【講義内容】
オペレーションズリサーチ（OR）とは，決定や問題解決を数理的に行う方法である．実際に世
の中で起こっている複雑な問題も基本的な問題の組み合わせであると考え，まず，人間が出会う
数々の問題（分析，意思決定，作戦立案，計画設定など）を数理的なモデルを用いてモデル化す
る．次に，構築した数理モデルを基に，最良な解や戦略を導く．本講義を通して，科学的・合理
的な考え方により様々な問題を解決できる能力を養っていく．

scgedule: 2．講義計画
様々な種類の問題に対処する能力を養うため，OR の基本となる以下の項目を学ぶ．
０. 確率・統計学の復習試験（予定）
1. システムモデル
2. 回帰分析
3. 線形計画法
4. 非線形計画法
5. ネットワーク計画法
6. 待ち行列理論
※講義の進捗状況に応じて講義内容が多少異なる場合があります．
システムモデルは，生物，人間関係，政治，経済，工学，自然現象など，我々を取り巻く事象に
関する決定や問題解決を行うために必要となる数理モデルである．回帰分析は現象を解析する一
手法であり，データ間の因果関係を分析する方法として広く用いられている．線形計画法および
非線形計画法は，線形および非線形方程式で記述された問題の最適解（最小値または最大値）を
等式または不等式で表された制約条件の下で解く方法であり，様々な問題に適用される．ネット
ワーク計画法はネットワークの設計などに用いられる理論であり，インターネットなどの通信網
の設計には不可欠である．待ち行列理論は，待ち行列システムの確率的な特性を解析する手法で
あり，近年ではインターネットの設計や特性解析に広く用いられている．

grade: 3．成績の評価方法
・期末試験．
・状況に応じてレポート．
・講義中の質疑応答及び受講態度．
・課題に対するレポート提出が要求された場合は，必ず提出すること．
・再試験はありません．

textbook: 4．教科書・参考書
別途指示する．

note: 5．履修にあたっての注意事項
・第１回目の講義で，必要な数学（線形代数，確率・統計学等）の復習試験を実施する予定です．
・Web 掲示板の「休講・補講・試験情報」を確認しておくこと．

remark: ６．備考
なし．

target: 対象コース 情報システム
高度 ICT
コース専門必修
情報デザイン
コース専門選択

thema: 【テーマ・目標】
様々な問題の数学モデルを構築し，最適な解や戦略を見つける方法を学ぶ．

annual: ２年次

semesta:  後期

unitnum: 2 単位

teacher: 佐藤 仁樹

None
name: システム工学（Systems Engineering）

thema: 【テーマ・目標】
微分方程式の考え方を学び，
システムへの応用という観点で重要となる基本的な解法を習得する．

_lecture_content: 【講義内容】
システムにおける現象解析，システムの挙動解析など時間変化する現象をモデル化し理解する上
で，
微分方程式は強力な手段となり得る．
本講義では，
常微分方程式を対象として，
「微分方程式」
の考え方について学び，システムへの応用という観点で重要となる基本的な解法を習得すること
を目的とする．いくつかの基本的な解法を身に付け，工学的に応用するための能力を養う．
キーワード：微分方程式，モデル化，現象解析，挙動解析

scgedule: 2．講義計画
1. 微分方程式とは？
2. 1 階微分方程式
2-1 変数分離形
2-2 1 階線形微分方程式
3. 2 階微分方程式
3-1 2 階線形同次微分方程式
3-2 2 階線形非同次微分方程式
3-3 定数変化法
3-4 未定係数法
4 微分演算子法
4-1 微分演算子
4-2 逆演算子
4-3 高階微分方程式
4-4 連立微分方程式
5. 工学的応用のための解法
5-1 ラプラス変換
5-2 ラプラス変換による解法
6. 微分方程式の応用事例
7. まとめ

grade: 3．成績の評価方法
中間試験，期末試験，小テスト，課題（レポート）により総合的に評価する．

textbook: 4．教科書・参考書
教科書：石村園子著，
「やさしく学べる微分方程式」
，共立出版

note: 5．履修にあたっての注意事項
原則として「解析学Ｉ」
「解析学 II」を履修していること．

remark: ６．備考
予習と復習が十分に行われることを前提とした講義を行う．授業は板書しながら進めることにな
るが，ノートを必ず取ること．また，授業中の PC の利用は禁止する．

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
微分方程式の考え方を学び，
システムへの応用という観点で重要となる基本的な解法を習得する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 白石 陽

None
name: データベース工学（Database Engineering）

thema: 【テーマ・目標】
データベースは，実世界をデータモデルによって抽象化することから始まる．そこで開発された
理論や技術は，各種の情報処理システムの基盤として，重要な役割を果たしている．また，デー
タベースは高度情報化社会の中核技術のひとつとなっている．データベースの設計と構築ができ
る基礎的能力を習得する．
【学習目標】
データベース管理システムを用いて，小規模な関係データベースを設計，構築し，卒業研究等の
関連分野での研究に取り組めるレベルの理解を求める．

_lecture_content: 【講義内容】
目的：情報の論理構造と物理構造の違いを認識し，その違いを支える仕掛けの原理を理解すると
ともに，大量の情報を蓄積・検索・管理するシステムの設計・利用法を習得する．
内容：授業は，データモデル，概念モデリング，関係代数，データベース設計理論，データベー
ス管理システムなどにおけるデータベースの原理や思考方法など，その基礎への理解力を培う．
キーワード：データベース，データモデル，関係データモデル，SQL，トランザクション処理

scgedule: 2．講義計画
1. データベースシステムの基本概念
2. データモデリング
3. 関係データモデル
4. データベース設計
5. SQL
6. 物理データ格納方式
7. 問合せ処理
8. トランザクション処理，障害回復
9. データベース管理
10. データベース応用，最近のデータベース
11. データベースからの知識発見
詳細はカリキュラムによって異なるので，各コースの講義ページを参照すること．

grade: 3．成績の評価方法
カリキュラムによって異なる．
知能システム，情報デザインコースは授業参加状況，課題（レポート）
，期末試験の総合評価によ
る．
それ以外のコースは，小テストを 2 割，課題（レポート）を 3 割，期末試験を 5 割を目安に総
合評価する．
小テストは講義後に毎回行い，課題（レポート）は 2～3 回行う予定である．
ただし，1)小テストの提出回数が講義回数の 3 分の 2 に満たない場合，または，2)課題(レポー
ト)に未提出のものがある場合は，不合格とする場合がある．

textbook: 4．教科書・参考書
教科書: 速水治夫・宮崎収兄・山崎晴明：データベース， オーム社 IT TEXT
参考書: 北川博之: データベースシステム， 情報系教科書シリーズ第 14 巻， 昭晃堂
西尾章治郎，上林弥彦，植村俊亮: データベース， オーム社
ほか，必要に応じて講義中に紹介する．

note: 5．履修にあたっての注意事項
離散数学，代数・集合論，論理・述語論理，アルゴリズムとデータ構造など，コンピュータサイ
エンスの基礎をしっかり習得していることが望む．OS，ネットワークなどの知識も重要である．

remark: ６．備考
データベース研究は，コンピュータサイエンス・情報科学の一翼を担う重要な分野であり，対象
世界をモデル化する考え方も論理的思考の手段として重要である．将来 SE を目指す人は必修で
ある．

target: 対象コース 情報システム
高度 ICT
コース専門必修
情報デザイン
コース専門選択

thema: 【テーマ・目標】
データベースは，実世界をデータモデルによって抽象化することから始まる．そこで開発された
理論や技術は，各種の情報処理システムの基盤として，重要な役割を果たしている．また，デー
タベースは高度情報化社会の中核技術のひとつとなっている．データベースの設計と構築ができ
る基礎的能力を習得する．
【学習目標】
データベース管理システムを用いて，小規模な関係データベースを設計，構築し，卒業研究等の
関連分野での研究に取り組めるレベルの理解を求める．

annual: ２年次

semesta:  後期

unitnum: 2 単位

teacher: 新美 礼彦
角 康之

None
name: 電気回路（Electric Circuit）

thema: 【テーマ・目標】
電気，電子回路を理解する上で前提となる交流回路理論の基礎を学ぶとともに，回路の解析方法
を習得する.また周波数特性の概念を学び，周波数応答，交流回路の解析方法，微分方程式による
解法，フーリエ変換，ラプラス変換などの回路理論的意味などを理解する．

_lecture_content: 【講義内容】
本講義では電気回路の基礎として，電流・電圧，グラフ理論などを学ぶ．次に受動素子である抵
抗，キャパシタ（コンデンサ）
，インダクタ（コイル）の電気的性質を学び，回路方程式を理解す
る．
具体的にはキルヒホッフの法則を用いた回路方程式とその解法を理解し，
，
波形伝送やディジ
タル回路内での現象の理解のために，回路の時間応答を理解すると共に，複素関数としてのイン
ピーダンス，アドミタンスの理解と周波数特性との関係の理解へと進む．最後に，回路の過渡現
象解析として，微分方程式の解法，時定数とそれを用いた微分・積分回路の構成，さらに，時間
領域の解法であるフーリエ変換，ラプラス変換を学ぶ．回路理論は通信理論，信号処理（音声処
理や画像処理）およびシステム理論などの基礎理論として使われる重要な理論である．また，機
械系などの物理現象で微分方程式で表現可能なものは，等価な回路として回路理論により代数的
に解析可能であることからロボティクスなどの解析にも有用である．

scgedule: 2．講義計画
１.電気回路基礎
-電気回路と回路図
-グラフ理論
-電圧，電流
-交流回路解析
-交流電流・電圧の実効値
２.抵抗，キャパシタ，インダクタ
３.回路の定常状態と過渡状態
-回路方程式の微分方程式
-一般解，定常解，過渡解
4.回路解析のための基本法則
-オームの法則，キルヒホッフの法則
-接点解析，ループ解析
-重ね合わせの理
５．正弦波交流回路
-RLC 直列，並列回路
-共振周波数
６．正弦波交流回路の複素表示
-複素数
-複素インピーダンス
７．テブナンの定理
８．回路応答の過渡現象
-RL,RC 回路の過渡現象解析
-時定数，微分・積分回路
-フーリエ変換
-ラプラス変換

grade: 3．成績の評価方法
本科目の評価は，授業中の小テスト，課題レポート，中間試験，期末試験で決定する．基本的に
は中間試験，期末試験にて 8 割，小テスト，課題レポートにて 2 割の配分とする．

textbook: 4．教科書・参考書
教科書：基本から学ぶ電気回路 藤居信生著 電気学会 オーム社
参考書：電気回路教本 秋月影雄監修，橋本洋司著 オーム社

note: 5．履修にあたっての注意事項
数学（線形代数，解析学，微分方程式）および物理の基礎科目（電子工学基礎など）を履修して
いることが望ましい．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
電気，電子回路を理解する上で前提となる交流回路理論の基礎を学ぶとともに，回路の解析方法
を習得する.また周波数特性の概念を学び，周波数応答，交流回路の解析方法，微分方程式による
解法，フーリエ変換，ラプラス変換などの回路理論的意味などを理解する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 藤野 雄一

None
name: 形式言語とオートマトン（Formal Languages and Automata）

thema: 【テーマ・目標】
コンピュータによる記号・計算・言語処理の基礎理論であるオートマトンと形式言語の基本を学
ぶ．

_lecture_content: 【講義内容】
オートマトンはコンピュータの動作原理のモデルである．コンピュータが何かを計算するとはど
ういうことか，機械のレベルによって計算できることにどのような違いがあるのか，そもそもコ
ンピュータに計算できるのはどういうことなのかなど情報処理の根本にオートマトンは深く関わ
っている．具体的なコンピュータは日進月歩の進歩をとげておりその仕様もさまざまに細分化さ
れているが，(デジタル）コンピュータの動作原理は共通である．ここではそのオートマトンの有
限オートマトン，プッシュダウンオートマトン，チューリング機械について基本を学ぶ．
オートマトンは言語を受理するシステムであるが，言語を生成するシステムが形式文法である．
形式文法によって生成される言語のモデルが形式言語であり，日本語などの自然言語，Ｃなどの
プログラミング言語を対象とする．情報処理の立場から言語とは何か，文法のレベルによって生
成される言語にどのような違いがあるか，そもそもコンピュータで扱える言語はどういうものか
などを学ぶ．

scgedule: 2．講義計画
1.オートマトンとは
２．有限オートマトン入門
３．非決定性有限オートマトン
４．有限オートマトンの最簡形
５．プッシュダウンオートマトン
６．非決定性プッシュダウンオートマトン
７．チューリング機械
８．形式文法と形式言語
９．オートマトンと形式文法の関係

grade: 3．成績の評価方法
期末テスト，小テスト，課題，出席状況などにより総合的に評価する．

textbook: 4．教科書・参考書
教科書：オートマトン・言語理論の基礎，米田政明他，近代科学社
参考書：オートマトン 言語理論 計算論 I，J.ホップクロフト/J.ウルマン共著，サイエンス社

note: 5．履修にあたっての注意事項
「情報表現入門」および「プログラミング基礎」を履修していることが望ましい．

remark: ６．備考
特になし．

target: 対象コース 情報デザイン
コース専門選択
知能システム
コース専門必修

thema: 【テーマ・目標】
コンピュータによる記号・計算・言語処理の基礎理論であるオートマトンと形式言語の基本を学
ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 加藤 浩仁

None
name: システム管理方法論（System Administration）

thema: 【テーマ・目標】
【テーマ・目標】
計算機システムの管理についての知識を学習し，技能を修得する．
【学習目標】
・システム管理者に必要な情報収集能力，報告書作成能力，日常的なコンピュータ操作技術の習得
・スタンドアロン UNIX システムの管理・運用に関する知識および技能の獲得
・ネットワークの管理・運用に関する知識および技能の獲得
・クライアントにおけるネットワークサービスの運用に関する知識と技能の獲得
・サーバの管理・運用に関する知識および技能の獲得

_lecture_content: 【講義内容】
ファイルサーバ，メールサーバ，HTTP サーバなどネットワークで接続されることにより利用され
る各種のサーバの管理，運営法を実験的なシステムの構築を通し学ぶ．UNIX サーバに重点を置き，
LAN，
インターネットを前提としたシステムの管理方法を学習する．
（企業の部門サーバや SOHO
システムの構築と管理を想定する．
）全体をスタンドアロンシステムの管理，ネットワークの管理，
サーバの管理，連続運用のための管理，セキュリティ管理に分割し，基礎的な方法を学習する．
キーワード：システム管理，OS，ネットワーク，サーバ（Web サーバ，メールサーバ，ファイル
共有サーバ）
，セキュリティ，Linux

scgedule: 2．講義計画
講義と演習を交互に行う．講義で得た知識を元に，演習で実践することにより実際にサーバを構築
しながら，システム管理について学ぶ．
・ガイダンス．システム管理者の役割の説明
・スタンドアロンの管理
・ネットワークの設定とクライアントの設定
・サーバーの設定
・連続運用時の管理
・セキュリティ管理
・まとめ

grade: 3．成績の評価方法
単位認定は以下の項目を全て満たしていることが前提となる．
・すべての小テストを受験していること
・すべての課題（レポート）を提出していること
成績は，課題（レポート）の評価結果と小テストの結果をあわせて評価する．
（課題（レポート）
を 6 割，小テストを 4 割を目安に総合評価する．
）

textbook: 4．教科書・参考書
参考書:Linux 標準教科書(LPI-JAPAN, {http://www.lpi.or.jp/linuxtext/} )
参考書:Linux サーバー構築標準教科書(LPI-JAPAN, {http://www.lpi.or.jp/linuxservertext/} )
参考書:UNIX システム管理 第 3 版 VOLUME1,2 (オライリージャパン)
参考書:UNIX の絵本 (翔泳社)
参考書:TCP/IP の絵本 (翔泳社)
参考書:ネットワークはなぜつながるのか 第 2 版 (日経 BP 社)
参考書: [24 時間 365 日]サーバ/インフラを支える技術(技術評論社)

note: 5．履修にあたっての注意事項
「情報機器概論」を履修していること．また，同時期開講の「情報ネットワーク」も履修すること．
UNIX の基本的なコマンドとエディタが使えることを前提とする．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
【テーマ・目標】
計算機システムの管理についての知識を学習し，技能を修得する．
【学習目標】
・システム管理者に必要な情報収集能力，報告書作成能力，日常的なコンピュータ操作技術の習得
・スタンドアロン UNIX システムの管理・運用に関する知識および技能の獲得
・ネットワークの管理・運用に関する知識および技能の獲得
・クライアントにおけるネットワークサービスの運用に関する知識と技能の獲得
・サーバの管理・運用に関する知識および技能の獲得

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 新美 礼彦

None
name: ヒューマンインタフェース（Human Interface）

thema: 【テーマ・目標】
人間と機器システムとの自然な対話を実現するための設計手法を理解する．

_lecture_content: 【講義内容】
ヒューマンインタフェース（HI）は，認知科学，情報工学，デザインの領域からなる学際的な研
究領域である．ヒューマンインタフェースの具体的な探究課題は各領域にまたがり，コンピュー
タの画面表示や入力方式だけでなく，家電製品や駅の券売機などの公共機器の設計も含まれる．
この講義では，
人間と機器システムとの自然な対話を実現するために，
人間の認知特性を理解し，
人間のためのシステム設計とその評価手法などを学ぶ．具体的には，現状の問題認識から改善案
の展開，およびその評価検証まで，製品開発プロセスに沿って一連の講義を行う．
キーワード：インタフェース設計，インタフェースデザイン，認知，評価

scgedule: 2．講義計画
1. ヒューマンインタフェースの全体概念（1）
2. ヒューマンインタフェースの全体概念（2）
3. ユーザの認知特性（1）
4. ユーザの認知特性（2）
5. ユーザの認知特性（3）
6. ヒューマンインタフェースの設計方法（1）
7. ヒューマンインタフェースの設計方法（2）
8. ヒューマンインタフェースの評価方法（1）
9. ヒューマンインタフェースの評価方法（2）
10.ヒューマンインタフェースの評価方法（3）
11.ヒューマンインタフェース設計の現況
12.インタラクティブシステムの実現（1）
13.インタラクティブシステムの実現（2）
14.インタラクティブシステムの実現（3）
15.まとめ

grade: 3．成績の評価方法
単位認定は,期末試験の点数と出席状況を等しく重んじ,総合的に判断する.

textbook: 4．教科書・参考書
教科書はなし．
参考書は講義時に適宜推薦する．

note: 5．履修にあたっての注意事項
「認知心理学」を履修していることが望ましい．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
情報デザイン
学科専門必修

thema: 【テーマ・目標】
人間と機器システムとの自然な対話を実現するための設計手法を理解する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 安井 重哉
竹川 佳成
角 康之
南部 美砂子

None
name: 画像工学（Image Processing Technology）

thema: 【テーマ・目標】
画像情報処理システムについて，その概要と特徴を理解する．

_lecture_content: 【講義内容】
空間に分布した情報の視覚的表現が画像である．
本講義では，人間の視覚処理系をコンピュータで実現するための画像処理システムについて，そ
の原理と手法（画像を取り扱うための基礎技術）を解説する．
外界の環境をコンピュータに取り込むための画像センシング手法からはじまり，画像補正や画質
改善，さらに画像認識・理解を目的とした画像解析手法に至るまでを説明する．また，画像処理
技術を用いた応用事例に関しても随時紹介する．必要に応じて画像や映像を認識および理解する
ための認識アルゴリズムについて演習を交えながら講義を進める．

scgedule: 2．講義計画
第 1 部 画像処理技術の基礎(2 回)
画像処理技術の導入として，画像入出力装置，人間の視覚特性などについて説明する．
第 2 部 画像処理の基本手法
画像処理技術の基本的な手法を紹介する．大きくは以下の 2 つに分類される．
2 - 1. 画像の前処理（4 回）
解析，認識処理を容易にする，あるいは画像を見やすくするための前処理技術として，ノイズ除
去，幾何や濃度の補正などを理解する．
2 - 2. 特徴抽出（5 回）
ラベリングやハフ変換等，画像中に含まれる特徴を抽出するための処理について説明する．
第 3 部 画像認識技術（4 回）
テンプレートマッチング等，パターンに基づいて画像を判別・分類する処理について説明する．

grade: 3．成績の評価方法
単位認定は
・全ての課題（レポート（プログラム及びその説明，実行結果の考察）＋オンラインテスト）が
提出されていること
・期末試験で 60 点以上獲得すること
を前提とする．成績は定期試験により行う．

textbook: 4．教科書・参考書
教科書：後日指定する．

note: 5．履修にあたっての注意事項
原則として「プログラミング基礎」
，
「線形代数学」を履修していること．

remark: ６．備考
なし．

target: 対象コース 情報システム
高度ＩＣＴ
情報デザイン
コース専門選択

thema: 【テーマ・目標】
画像情報処理システムについて，その概要と特徴を理解する．

annual: ３年次

semesta:  前期

unitnum: 2 単位

teacher: 長崎 健

None
name: 情報ネットワーク（Network of Information）

thema: 【テーマ・目標】
インターネットを支える各種ネットワーク技術について，その概要を理解する．

_lecture_content: 【講義内容】
現代のネットワーク社会を支えるインターネットは，現在社会インフラとしての地位を確固たる
ものとしつつある．本講義では，通信技術の基本的な原理からインターネットを初めとする各種
情報ネットワークの現状に至るまでを網羅的に学ぶ．インターネット上で提供されている種々の
サービスとその背景にある通信ネットワーク，各種プロトコルなどについての紹介を通じて，イ
ンターネット上で利用可能な各種の技術とネットワークに関する理解を深める．

scgedule: 2．講義計画
第 1 回 イントロダクション
第 2 回 ネットワークアーキテクチャとインターネット
第 3 回 インターネット構成要素
第 4 回 名前とアドレス，標準化
第 5 回 OSI 参照モデル
第 6 回 TCP/IP プロトコル群
第 7 回 各種通信プロトコル
第 8 回 www サービス
第 9 回 電子メールサービス
第 10 回 その他のネットワークサービス
第 11 回 広域ネットワーク
第 12 回 無線ネットワーク
第 13 回 モバイル/ユビキタスネットワーク
第 14 回 応用事例
第 15 回 まとめ

grade: 3．成績の評価方法
成績は期末試験と課題レポートの総合評価により行う．

textbook: 4．教科書・参考書
教科書：コンピュータネットワーク概論
（未来へつなぐデジタルシリーズ 27）
，
水野忠則等
（著）
，
共立出版

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
授業で使用する補足説明資料は，事前に公開する．

target: 対象コース 情報システム
高度 ICT
情報デザイン
学科専門必修

thema: 【テーマ・目標】
インターネットを支える各種ネットワーク技術について，その概要を理解する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 稲村 浩

None
name: オペレーティングシステム（Operating Systems）

thema: 【テーマ・目標】
オペレーティングシステムを構成する主要技術を理解する．

_lecture_content: 【講義内容】
オペレーティングシステムの存在意義を理解し，計算機資源の管理方法について学ぶ．プロセス
管理，入出力機器の管理，メモリ管理，セキュリティ管理について具体的に説明する．また，自
分が必要とするシステムを構築するのに適したオペレーティングシステムを選択できる素養を身
に付ける．
キーワード：ファイルシステム，I/O 管理，プロセス管理，スケジューリング，記憶管理

scgedule: 2．講義計画
1. オペレーティングシステムの概要，役割，位置づけ，必要性 (2 回)
2. プロセス (2 回)
3. メモリ管理 (2 回)
4. ファイルシステム (2 回)
5. 入出力 (2 回)
6. デッドロック(1 回)
7. セキュリティ (1 回)
8. Linux 等の OS について(2 回)
9. 演習(2 回)
※括弧内は授業回数の目安

grade: 3．成績の評価方法
評価方法はクラスにより異なる．
ABCD クラス: 期末試験の成績(100%)により行う．
EFJKL クラス: 課題（各回の授業内容を確認する設問）および期末試験を総合して評価する．

textbook: 4．教科書・参考書
教科書：
・未来へつなぐデジタルシリーズ 25 オペレーティングシステム，菱田隆彰，寺西裕一，峰野
博史，水野忠則著，共立出版
参考書：
・情報処理入門コース 2 オペレーティングシステム，清水謙多郎著 岩波書店
・OS の基礎と応用 設計から実装，DOS から分散 OS Amoeba まで，.S.Tanenbaum 著引地
信之，引地美恵子訳，株式会社ピアソンエデュケーション

note: 5．履修にあたっての注意事項
1 回目の講義で履修についての注意を行うので必ず出席すること

remark: ６．備考
なし．

target: 対象コース 情報システム
高度 ICT
コース専門必修
情報デザイン
コース専門選択

thema: 【テーマ・目標】
オペレーティングシステムを構成する主要技術を理解する．

annual: ３年次

semesta:  前期

unitnum: 2 単位

teacher: 長崎 健
松原 克弥

None
name: ネットワーク通信理論（Theory of Network Communication）

thema: 【テーマ・目標】
現代の情報通信とネットワーク技術の総合的な理解を目標として，情報通信の基礎及び，インタ
ーネットや無線通信について学ぶ．

_lecture_content: 【講義内容】
現代のネットワークシステムでは，インターネットや携帯電話に代表される通信網と端末である
コンピュータが非常に複雑に繋ぎ合わされている．そのため，現在の情報通信を理解するには，
その根幹をなす原理を数理論的な枠組みの中でしっかりと学ぶ必要がある．本講義では，情報通
信の基礎理論から現在の通信網（インターネットや無線通信網）の幅広い範囲の中で，重要なト
ピックスを項目別に学んでいく．また，これらの知識を基に，将来の情報通信のあり方を考えて
いく．情報通信に関する技術は IT 産業の根幹であり，現在では様々な産業の基盤技術の一つとな
っ
ている．この分野に興味のある場合は，この講義を受けることを強く勧める．

scgedule: 2．講義計画
１. 網構成と交換方式
２. 情報理論と符号理論
３. 待ち行列理論
４. トラフィック理論
５. 無線通信理論
※講義の進捗状況に応じて講義内容が多少異なる場合があります．

grade: 3．成績の評価方法
・期末試験．
・状況に応じてレポート．
・講義中の質疑応答及び受講態度．
・課題に対するレポート提出が要求された場合は，必ず提出すること．
・再試験はありません．

textbook: 4．教科書・参考書
別途指示する．

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
現代の情報通信とネットワーク技術の総合的な理解を目標として，情報通信の基礎及び，インタ
ーネットや無線通信について学ぶ．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 佐藤 仁樹

None
name: パターン認識（Pattern Recognition）

thema: 【テーマ・目標】
パターンをコンピュータを用いて理解する手法の理解

_lecture_content: 【講義内容】
人間が画像や音声を認識することをパターン認識と呼ぶ．この授業ではコンピュータがパターン
認識をするために基礎となる事項について学ぶ．また最近パターン認識以外でも広く使われるよ
うになってきたベイズ推定の基礎についても学ぶ．

scgedule: 2．講義計画
1.パターン認識とは何か
2. 識別関数
3. パーセプトロン
3. 誤差評価に基づく学習
4. SVM (サポートベクトルマシン）
5. ニューラルネットワークと深層学習
6.ベイズ推定

grade: 3．成績の評価方法
期末試験，及び出席状況とレポートの提出により総合的に評価する

textbook: 4．教科書・参考書
教科書：開始時に指定する
参考書：石井他：わかりやすいパターン認識（オーム社） 続わかりやすいパターン認識（オー
ム社）

note: 5．履修にあたっての注意事項
特になし．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
パターンをコンピュータを用いて理解する手法の理解

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 松原 仁

None
name: ヒューマンインタフェース演習（Human Interface Practice）

thema: 【テーマ・目標】
人間にとってわかりやすい，使いやすい機器システムの改良設計を体験習得する．

_lecture_content: 【講義内容】
ヒューマンインタフェース(HI)の講義をふまえ，また，既に 1，2 年次に修得したコンピュータ
の情報処理技術，人間の認知のメカニズム，情報表現技術なども総合的に活用して，人間と機器
システムとの自然な対話を実現するヒューマンインタフェースの実際的な設計を体験し，習得す
る．全員共通する 1 つのテーマで演習を行ない，個々の学生は独自の改良提案を行う．
キーワード：インタフェース設計，インタフェースデザイン，認知，評価

scgedule: 2．講義計画
1.演習テーマの説明，HI の現状問題点調査
2.テーマとするシステムの問題点調査，分析
3.人間の認知特性から見た問題点の整理
4.人間の認知行動に合わせた改良案の展開
5.改良案設計計画の作成 →レポート提出
6.改良案のユーザ調査，確認
7.改良案の具体的展開
8.プロトタイプ作成
9.プロトタイプ作成
10.プロトタイプ作成
11.ユーザ評価実施
12.評価結果の分析 →レポート提出
13.プロトタイプの修正
14.最終報告書の作成と提出
15.最終評価会とフィードバック
（後日ポートフォリオを提出）

grade: 3．成績の評価方法
単位認定は，中間レポート，最終報告書，最終評価会の総点が 100 点満点で 60 点以上．

textbook: 4．教科書・参考書
「GUI 設計の指針と実例 見せるユーザ・インタフェース・デザイン」
，
「認知的インターフェー
ス」
，
「ユーザ工学入門」
，
「ユーザビリティーエンジニアリング」など．

note: 5．履修にあたっての注意事項
「ヒューマンインタフェース」
（講義）と同時に履修することが望ましい．
Photoshop，Illustrator，Dreamweaver が使えること．

remark: ６．備考

target: 対象コース 情報デザイン
コース専門必修

thema: 【テーマ・目標】
人間にとってわかりやすい，使いやすい機器システムの改良設計を体験習得する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 竹川 佳成
安井 重哉

None
name: 実験・調査データ解析（Experimental and Survey Data Analysis）

thema: 【テーマ・目標】
実験，質問紙などのデータを解析するための基本的な統計解析法を学ぶ．統計処理ソフト R を使
って実験データや質問紙データを実際に分析することを通して，データから有益な情報を引き出
すことができるようになることを目標とする．

_lecture_content: 【講義内容】
情報技術の発展に伴い，大量のデータが日々蓄積され続けるようになってきた．しかし，大量の
データをすべて人間がチェックすることは時間的に困難である．また，データを持っていても，
そのままでは解釈が難しいことも多い．よって，データを分析するための技術は重要である．し
かし，確率や統計法などの知識を習得しても，現実のデータの分析にその知識を適用することは
難しい．この講義では，確率・統計などの知識をもとに，実際にデータを分析する手法を解説す
る．授業では，データを収集し，そのデータをフリーの統計ソフト R などを用いて実際に分析す
ることにより，効率的なデータ整理法，実用的なデータ解析の手法を学ぶ．統計的検定やよく使
われる多変量解析の分析手法（回帰分析，因子分析など）を主に講義するが，データマイニング・
機械学習などで使われる最近の手法などについても一部紹介する．
キーワード： データ解析，統計的検定，多変量解析，回帰分析，因子分析

scgedule: 2．講義計画
1-2. R の使い方（R のインストール, R の基本的文法の解説，R プログラミング）
3-4. R によるデータの集計方法，記述統計量の計算（データの読み込み，書き込み，
平均・分散の計算，クロステーブルの作り方など）
5. 確率の基礎(期待値，分散，独立性，累積分布関数，確率密度関数など)
6. t 検定
7-8. カイ二乗検定
9-10. 回帰分析と相関係数
11-12. 因子分析
13. R によるデータマイニング・機械学習
14-15. 分散分析

grade: 3．成績の評価方法
毎回の講義での課題によって評価する．

textbook: 4．教科書・参考書
参考書 : 南風原朝和 「心理統計学の基礎―統合的理解のために」 有斐閣
参考書 : 山内光哉 「心理・教育のための統計法 第 3 版」 サイエンス社

note: 5．履修にあたっての注意事項
なし

remark: ６．備考
なし

target: 対象コース 情報デザイン
コース専門選択

thema: 【テーマ・目標】
実験，質問紙などのデータを解析するための基本的な統計解析法を学ぶ．統計処理ソフト R を使
って実験データや質問紙データを実際に分析することを通して，データから有益な情報を引き出
すことができるようになることを目標とする．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 花田 光彦

None
name: 知覚システム論（Perceptual Systems）

thema: 【テーマ・目標】
認知科学の一領域である生態心理学の概論

_lecture_content: 【講義内容】
情報をデザインする上で，
情報とは何か，
人を含めた動物の知覚－行為は環境の中でどのように
機能しているのかについて知識を習得することは，インタフェースなど情報と人を繋ぐデザイン
を行うためには重要である．
特にアフォーダンスの概念は難解であり，
誤解されることも多い．本
講義では，情報デザインと関連の深い生態心理学について，アフォーダンスなどその基本的概念
や，生態心理学の背景となる世界観について概観する．
キーワード： 生態心理学・感性心理学・光学・音響学
Key words: Ecological psychology, Sensory psychology, Optics, Acoustics

scgedule: 2．講義計画
次の事項を含んだ授業を計画している．
1. 生態心理学とはなにか
2. ゲシュタルト心理学と生態心理学の成立
3. アフォーダンスとは何か
4. アフォーダンス知覚に関する実験演習
5. 生態光学
6. 光学的トンネル製作
7. 光学的流動
8. 生態音響学
9. 生態音響学に関する実験演習
10. 触ること
11. ダイナミック・タッチ実験演習
12. 知覚－行為カップリング
13. 予期的情報タウ
14. 生態学的実在論
15. 意識と無意識

grade: 3．成績の評価方法
課題（実験演習レポート）(80%)，課題（実験についての口頭発表）(10%)，課題（心理実験実
習）(10%)．
詳細は初回の講義時に説明する．

textbook: 4．教科書・参考書
参考書：生態学的知覚システム（東京大学出版会）

note: 5．履修にあたっての注意事項

remark: ６．備考
学際的内容を含んだ講義になるため，他コース所属の学生も歓迎する．

target: 対象コース 情報デザイン
コース専門選択

thema: 【テーマ・目標】
認知科学の一領域である生態心理学の概論

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 伊藤 精英

None
name: システム情報科学実習（System Information Science Practice）

thema: 【テーマ・目標】
・プロジェクト遂行に必要となるルールを学習する．
・プロジェクト遂行に必要となる技術を学習する．
・プロジェクトを自主的に管理・運営する方法を学習する．
・通常の講義とは異なる多様な教育機会を，履修者に提供する．
・成果を内外に公表し，大学および地域社会に貢献する．

_lecture_content: 【講義内容】
履修者は，プロジェクト遂行のために必要な以下の技術を学習する．
(1) 問題発見
・解決すべき問題を発見する．
(2) 共同作業
・複数のメンバーで 1 つの問題を解決する．
(3) 問題解決
・問題解決に必要となる専門知識を身に付ける．
・実践として新たな理論，システム，作品などを制作する．
(4) 報告（発表，文書）
・第三者に伝えるために，報告書を作成し，発表を行う．

scgedule: 2．講義計画
4 月：プロジェクトの説明会
希望調査
プロジェクトへの配属
プロジェクト学習開始
7 月：中間発表会
中間報告書提出
12 月：成果発表会
1 月：最終報告書提出

grade: 3．成績の評価方法
・ 学習フィードバックシートに基づき，学生が相互に活動内容を評価することにより，成績を自
己申告する．
・ 自己申告された成績に基づき，学生と担当教員の協議の上で成績を決定する．

textbook: 4．教科書・参考書
プロジェクトに配属後，担当教員から連絡がある．

note: 5．履修にあたっての注意事項
原則として欠席を認めない．また，提出物に不備があった場合には単位を取得できないので，注
意すること．

remark: ６．備考
なし

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
・プロジェクト遂行に必要となるルールを学習する．
・プロジェクト遂行に必要となる技術を学習する．
・プロジェクトを自主的に管理・運営する方法を学習する．
・通常の講義とは異なる多様な教育機会を，履修者に提供する．
・成果を内外に公表し，大学および地域社会に貢献する．

annual: 3 年次

semesta:  通年

unitnum: 4 単位

teacher: プロジェクト学
習担当

None
name: 企業実習（Enterprise Intership）

thema: 【テーマ・目標】
企業での実習を通じて，社会における自身の知識や能力の活かし方に関する意識を高め，大学に
おける学習や研究の意義を再確認する．そして，自身の将来目標と道すじをより具体的に描く．

_lecture_content: 【講義内容】
目的：就業体験を通じて以下のようなことを考え学ぶ.
・企業のビジネス現場で必要とされる技術，知識，能力は何なのか.
そのような技術，知識，能力を身に付けるには，本学においてどのような学習態度をとり，学習
内容を志向し，研究活動を送るべきかを考える.
・業務体験を通して，自分の長所，短所を自己分析し， 将来どのような社会貢献ができるか，自
分のどこを伸ばしどこを補強すべきかどのような職種，職業に就くべきかを具体的に考える.
・実習先の指導者からの指示を受け，他のチームメンバと共同作業を行い，厳しいビジネス現場
でのチームワークに参加する.
社会人としてのコミュニケーション作法やプロフェッショナル意識を学ぶ.
内容：原則として，本学で学ぶシステム情報科学と強く関連するものに限る.
大学が提示する受入企業の業種や実習内容を学生各自が判断し，希望する企業や実習内容を選ぶ.
大学が提示するリストに含まれない企業での実習を希望する場合は，実習実施前に本科目担当教
員が承認した場合のみ，本科目の実習として認める.

scgedule: 2．講義計画
実習時期として 3 年次夏季休暇期間中の 2 週間から 4 週間を充て，原則として，実働 10 日間
以上とする.
もし実働が 10 日未満の場合には必ず実習実施前に本科目担当教員に相談すること.
実習に赴く前に学生自身が作成した「実習計画書」を事務局経由で本科目担当教員に提出する.
実習計画書には，上述の目的・テーマ，講義内容に照らして，学生が受入企業と実習内容の調整
を行い，初日～最終日までにどのような実習が予定されているかを述べる.
「報告書提出」
：実習終了後，2 週間以内に事務局経由で本科目担当教員に提出する.
実習報告書には，実習を通じて得られた学業，職業，人生に対する新たな気付き，反省，指針，
将来計画などを，上述の目的・テーマ，講義内容に照らして述べる.

grade: 3．成績の評価方法
実習実施前に実習計画書が提出されていること，実習終了後の期限内（2 週間以内）に実習報告
書が提出されていることが単位認定の必要条件である．
本科目担当教員が，実習計画書，実習報告書，受入企業から提出される当該学生の実習評価結果
を審査し，実習の効果の程度を総合的に評価し A，B，C の成績評定を下す．もし実習評価結果
の入手が難しい場合は，本科目担当教員が学生本人と面談を行い成績評定を下す.

textbook: 4．教科書・参考書
特になし．

note: 5．履修にあたっての注意事項
実習を希望する受入企業の選定プロセス，実習前マナー講習会の受講等に関して，事務局や本科
目担当教員の指示に従うこと.
本科目は，受入企業の都合により実習が中止になったり中断する場合があり，そのような時は履
修は完了していないので成績評定を下さない.

remark: ６．備考
不明な点などがあれば，すみやかに事務局や本科目担当教員とよく相談すること．

target: 対象コース 全コース
学部専門選択

thema: 【テーマ・目標】
企業での実習を通じて，社会における自身の知識や能力の活かし方に関する意識を高め，大学に
おける学習や研究の意義を再確認する．そして，自身の将来目標と道すじをより具体的に描く．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 就職委員長他

None
name: サービスデザイン（Service Design）

thema: 【テーマ・目標】
新しいサービスやビジネスシステムをデザインする上での上位概念の基礎やビジネスモデルの考
え方とその手法を短期集中の講義及び演習により学ぶ．

_lecture_content: 【講義内容】
本科目は第二期 enPiT 修了認定のための必修科目である．
新しいサービスやビジネスのしくみをデザインするためにはビジネスモデルのフレームワークに
より，ビジネスを分析・企画することを学ぶ．ビジネスモデルのバリエーションを具体的な事例
を通して学び，アイデアを広げる．講義にて学び，演習にて実践的にビジネスモデルをデザイン
して，理解を深める．授業では講義とグループワーク，ディスカッション，発表会でのプレゼン
テーションで構成する．

scgedule: 2．講義計画
・講義概要およびテーマの説明
・ビジネスモデルをデザインする意義
・ビジネスモデルのパターン
・ビジネスモデルの事例
・ビジネスモデルのデザイン手法
・ビジネス対象の分析
・パターンの検討と検証
・ビジネスモデルの企画・フィードバック
・発表会

grade: 3．成績の評価方法
基本的に全出席とする．演習課題やレポート，発表会などの総合評価による．

textbook: 4．教科書・参考書
参考書：必要に応じて適時紹介する．

note: 5．履修にあたっての注意事項
夏休みの集中講義である．
ソフトウェア設計論Ⅰを履修済みのこと．

remark: ６．備考
特になし．

target: 対象コース 全コース
学部専門選択

thema: 【テーマ・目標】
新しいサービスやビジネスシステムをデザインする上での上位概念の基礎やビジネスモデルの考
え方とその手法を短期集中の講義及び演習により学ぶ．

annual: 3 年次

semesta:  前期集中

unitnum: 2 単位

teacher: 大場 みち子

None
name: ワークプレイス論（Theory of Work Place）

thema: 【テーマ・目標】
ワークプレイス研究の歴史や方法，理論を学び，フィールドワークを実践し，
「現場のリアル」を
とらえる視点と技術を習得する．

_lecture_content: 【講義内容】
人の高度かつ複雑な知的活動を理解するためには，
「個人（の頭のなか）
」をこえて，社会的な実
践の場，すなわち「ワークプレイス」を分析の対象とする必要がある．社会学の分野で発展して
きたワークプレイス研究の様々な方法論を学び，人と社会・文化・環境・他者・道具・コンテキ
ストなどの相互的な構成を記述することを通じて，人とその実践を理解し，いかにして支えるか
を考える．
キーワード：フィールドワーク，インタビュー，エスノグラフィー，エスノメソドロジー，状況
論，活動理論，社会文化的アプローチ，考現学，グラウンデッドセオリー，質的研究

scgedule: 2．講義計画
(1) ワークプレイス研究の歴史と背景
なぜ社会的実践の場を分析対象とするのか
(2) ウォーミングアップ
まち・ひと・ものをみつめる
(3) ワークプレイス研究の考え方と方法
質的研究，活動理論，状況論，分散認知，状況的認知，グラウンデッドセオリー，会話分析
など
(4) 研究事例紹介
外来診察室のフィールド調査，暴走族のエスノグラフィーなど
(5) 現場のリアルをとらえる
フィールドワーク，インタビューなど
(6) 現場のリアルを表現する

grade: 3．成績の評価方法
出席状況，フィールドワークやインタビューなどの課題，プレゼンテーション，学期末試験など
を総合して評価する．

textbook: 4．教科書・参考書
毎回資料を配付し，テーマごとに参考文献を紹介する．
基本的な参考文献は以下の通り．
佐藤郁哉 (2002). フィールドワークの技法：問いを育てる，仮説をきたえる. 新曜社
佐藤郁哉 (1984). 暴走族のエスノグラフィー：モードの叛乱と文化の呪縛. 新曜社
串田秀也・好井裕明(編集) (2010). エスノメソドロジーを学ぶ人のために. 世界思想社
鈴木聡志 (2007). ワードマップ 会話分析・ディスコース分析：ことばの織りなす世界を読み解
く. 新曜社

note: 5．履修にあたっての注意事項
まちあるき，フィールドワーク，インタビュー，活動分析など，さまざまな実践的課題を設定し
ている．
授業時間内で完結しないことも多い．座っているだけで単位がとれる科目ではない．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
ワークプレイス研究の歴史や方法，理論を学び，フィールドワークを実践し，
「現場のリアル」を
とらえる視点と技術を習得する．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 南部 美砂子

None
name: インタラクティブシステム（Interactive System）

thema: 【テーマ・目標】
・インタラクティブシステムを学び
・インタラクティブシステムを開発する
人間と人工物が情報を相互的にやりとりするシステムをインタラクティブシステムと呼ぶ．イン
タラクティブシステムの構成原理・構成方法・ソフトウエア技術の基礎について，講義およびプ
ログラミング（Unity など）をともなった演習を通して学ぶ．

_lecture_content: 【講義内容】
人間を中心としたインタフェース技術としてのインタラクティブシステムの構成原理・構成方
法・ソフトウエア技術について講義する．また，インタラクティブシステムを構築するためのプ
ログラミング演習を行う．

scgedule: 2．講義計画
1.インタラクティブシステムの概要
・インタラクティブシステムとは何か
・インタラクティブシステムの事例
2.インタラクティブシステムの構成原理と構成方法
・インタラクティブシステムのデザイン
・インタラクティブシステムソフトウエア技術
・インタラクティブシステムにおける認知
3.インタラクティブシステムの研究事例
例）エージェントインタフェース，ロボットインタフェース，実世界指向インタフェースなど
4.演習課題
・インタラクティブシステムの設計・開発・相互評価
例）シリアスゲームの提案など
・レポートの作成
・課題発表

grade: 3．成績の評価方法
提出課題，演習成果物,発表内容の成績を総合的に判断して評価を行う.

textbook: 4．教科書・参考書
教科書：Unity5 3D/2D ゲーム開発実践入門（ソシム）
，Unity5 入門（ソフトバンククリエイテ
ィブ）
その他，参考書について開講時に紹介する．

note: 5．履修にあたっての注意事項
実習においては，必ず前回の実習でのやり残しを消化してから授業に参加すること．

remark: ６．備考
演習課題にはプログラミングの作業が含まれる.

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
・インタラクティブシステムを学び
・インタラクティブシステムを開発する
人間と人工物が情報を相互的にやりとりするシステムをインタラクティブシステムと呼ぶ．イン
タラクティブシステムの構成原理・構成方法・ソフトウエア技術の基礎について，講義およびプ
ログラミング（Unity など）をともなった演習を通して学ぶ．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 角 薫

None
name: コンピュータグラフィックス（Computer Graphics）

thema: 【テーマ・目標】
コンピュータグラフィックスの基礎理論を中心に映像生成手法を理解する

_lecture_content: 【講義内容】
コンピュータグラフィックス技術は映像制作，エンターテイメント，デザイン，科学データの可
視化などに不可欠の技術で，物理的な世界と光の性質を数学的にモデル化し，それを計算に置き
換えることでリアルな情景を生成している．この授業では，コンピュータグラフィックスの数学
的基礎に始まり，シーン記述の技法，映像生成のアルゴリズム，リアルな映像生成の技法，動画
の生成等について学習する．本授業では，数回のミニプロジェクト（課題実習）を通じてグラフ
ィックス技術と映像表現方法の実際を習得する．

scgedule: 2．講義計画
1 コンピュータグラフィックス技術の全体像
2 画像を扱うためのデータ構造と座標変換
3 2 次元のグラフィックス
4 3 次元座標系と幾何学的変換
5 形状のモデリング
6 照明と表面の光学的特性
7 複雑な曲面の表現
8 模様や質感をつける
9 レイトレーシング，Z バッファ法
10 3 次元アニメーション
11 コンピュータグラフィックスの応用
12～14 ミニプロジェクト
15 まとめ
○ プログラミング課題を随時提示する．
○ 上記の他 Java などをつかったミニプロジェクトに 2，3 週間をあてる．
なお，コースによって取り扱う内容が変わる場合がある．

grade: 3．成績の評価方法
すべての課題の提出を前提とする．成績は課題・ミニプロジェクトの評価 30％と期末試験の成
績 70％の総合でおこなう．

textbook: 4．教科書・参考書
CGARTS 協会「コンピュータグラフィックス」

note: 5．履修にあたっての注意事項
「線形代数学」
，
「プログラミング基礎」
，
「アルゴリズムとデータ構造」を履修していること．

remark: ６．備考

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
コンピュータグラフィックスの基礎理論を中心に映像生成手法を理解する

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 川嶋 稔夫，
美馬 義亮

None
name: ネットワークセキュリティ（Network Security）

thema: 【テーマ・目標】
情報セキュリティの基礎となる基本的な知識や技術について学ぶ

_lecture_content: 【講義内容】
IT 社会において，重要な基盤分野の一つであるネットワークセキュリティについて，暗号の基礎
理論と技術，および暗号を使ったネットワークシステムにおける応用技術を身につける．また，
インターネットで使用されているセキュリティ基盤，およびアプリケーションについて，それら
の基本概念と応用例を習得する．さらに，不正アクセス，不正利用の事例と，それらから防御す
るための方策についても習得する．

scgedule: 2．講義計画
1.セキュリティの重要性と基本コンセプト
2.暗号基本原理
3.暗号と暗号プロトコル
4.公開鍵暗号
5.ディジタル署名
6.鍵管理
7.IP セキュリティ
8.ファイアウォール
9.仮想プライベートネットワーク
10.無線セキュリティ
11.認証プロトコル
12.電子メールセキュリティ
13.Web セキュリティ
14.情報セキュリティ戦略・標準化動向
15.情報セキュリティ関連の法律・情報倫理

grade: 3．成績の評価方法
課題レポート(20%)，期末試験(80%)により総合的に評価する．

textbook: 4．教科書・参考書
参考書：
「情報セキュリティの基礎」 織笠（著）
，日本理工出版会
参考書：
「情報セキュリティの基礎」
， 佐々木良一（監修）
，手塚悟（編著）
， 未来へつなぐデ
ジタルシリーズ，共立出版
参考書：
「暗号とネットワークセキュリティ」W.Stallings 著，石橋啓一郎他訳，ピアソンエデュ
ケーション

note: 5．履修にあたっての注意事項
「情報ネットワーク」
，
「ネットワーク通信理論」
，
「オペレーティングシステム」を履修している
ことが望ましい．

remark: ６．備考
授業で使用する補足説明資料は，事前に配布する．

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
情報セキュリティの基礎となる基本的な知識や技術について学ぶ

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 稲村 浩

None
name: 音声音楽処理（Speech and music processing）

thema: 【テーマ・目標】
・ 音の物理的な特徴，音響信号の処理方法，音声の分析や合成の方法を理解する．
・実践重視：ｃ言語によるプログラミング及びディジタル信号処理（数学）
．

_lecture_content: 【講義内容】
音声音楽信号をパソコン上で周波数分析し，スペクトルの特徴を理解する．また，アナログ信号
の標本化（離散信号化）と標本化定理について学ぶ．さらに，離散信号のフーリエ変換，Ｚ変換
の理論を学び，信号処理の基礎を理解する．最後に，これらの知識を基に，Ｚ変換の理論から実
際にディジタル・フィルタをプログラムし，音声音楽信号の処理方法を体得する．

scgedule: 2．講義計画
・ 音の伝搬と聴覚特性
・ パソコン上でのスペクトル分析法
・ 信号処理のプログラミング
・ 信号のフーリエ変換とラプラス変換
・ 離散信号のスペクトル
・ 標本化定理
・ Ｚ変換
・ ディジタル・フィルタ
・ ディジタル・フィルタによる音声音楽信号の処理プログラム
※講義の進捗状況に応じて講義内容が多少異なる場合があります．

grade: 3．成績の評価方法
・期末試験．
・状況に応じてレポート．
・講義中の質疑応答及び受講態度．
・課題に対するレポート提出が要求された場合は，必ず提出すること．
・再試験はありません．

textbook: 4．教科書・参考書
教科書（予定）
： ｃ言語ではじめる音のプログラミング 青木直史著 オーム社
注）変更の可能性があります．

note: 5．履修にあたっての注意事項
各自のパソコンでｃ言語のプログラムを作成・実行できること．
講義中に指示されたソフトウェアを各自のパソコンにダウンロードし，自己責任で実行できるこ
と．

remark: ６．備考
なし．

target: 対象コース 情報システム
高度 ICT
情報デザイン
コース専門選択

thema: 【テーマ・目標】
・ 音の物理的な特徴，音響信号の処理方法，音声の分析や合成の方法を理解する．
・実践重視：ｃ言語によるプログラミング及びディジタル信号処理（数学）
．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 佐藤 仁樹
(Hideki Satoh)

None
name: システムプログラミング（System Programming）

thema: 【テーマ・目標】
オペレーティングシステムの基本機能とその利用方法について理解することで，システム設計や
実装技術を習得する．

_lecture_content: 【講義内容】
UNIX や Linux のシステムコールを利用し，プロセス生成，プロセス間の同期など低レベルの
プログラミング技術についてとりあげ，基本的なプログラミング技術を理解する．
キーワード: プロセス, ファイルシステム, ネットワークプロトコル, コンパイラ

scgedule: 2．講義計画
1. ソフトウェアの構成とシステムコール
2. システムプログラムの開発と実行
3. プロセス，メモリ管理
4. 標準入出力，リダイレクションとパイプライン
5. ファイル I/O
6. シグナル
7. ソケット（ネットワーク）

grade: 3．成績の評価方法
課題（プログラム）および課題（１コマ程度の演習．1 回を予定）により評価する．

textbook: 4．教科書・参考書
参考書：W. Richard Stevens, Stephen A. Rago 著, 大木敦雄訳, 詳解 UNIX プログラミング
第 3 版, 翔泳社 ．
参考書：Robert Love 著, 千住治郎訳, Linux システムプログラミング, オライリー

note: 5．履修にあたっての注意事項
C 言語プログラミングによる演習および課題を課すため，
「アルゴリズムとデータ構造」
を履修し
ているか，あるいは相当する知識と技術を取得していることを前提とする．また，
「オペレーティ
ングシステム」を履修していることが望ましい．

remark: ６．備考
なし．

target: 対象コース 高度 ICT
コース専門必修
情報システム
コース専門選択

thema: 【テーマ・目標】
オペレーティングシステムの基本機能とその利用方法について理解することで，システム設計や
実装技術を習得する．

annual: 3 年次

semesta:  後期

unitnum: 1 単位

teacher: 松原 克弥

None
name: 人工知能とメディア（Artificial Intelligence and Media）

thema: 【テーマ・目標】
メディア(情報伝達媒体)の特性と，それを支える人工知能技術に関する教養を身に付ける．

_lecture_content: 【講義内容】
現代の情報メディアは，従来のメディアとは異なり，時空を超えた情報伝達を容易にした．近年
では，様々な情報伝達が多様な情報メディアを介して行われるようになり，流通する情報の量と
多様性は急速に増している．本講義では，そのような大規模かつ多様な情報を活用するために編
み出されてきた各種技術について俯瞰し，情報メディアの特性および現代の情報基盤・情報処理
技術に関する教養の習得を目指す．

scgedule: 2．講義計画
1 情報検索
・人類とメディアの歴史
・ウェブによる情報の集積と検索
・情報検索の手法
2 映像と言語
・言語
・映像
・映像と言語／ヒューマンコンピュータインタラクション
3 自然言語処理
4 表現と意味
・音楽情報学，音楽の意味論
・人工知能は音楽の意味を扱えるか
・記号，コミュニケーション，自然言語
5. 行動のモデル化・知的活動支援
・博物館や街を知識，文化，生活のメディアと捉え，その歴史，情報技術の導入，知能と認知な
どに関連するトピックを取り上げ，紹介する

grade: 3．成績の評価方法
各章ごとに指定される課題（レポート）によって評価を行う．

textbook: 4．教科書・参考書
とくに指定しない．必要に応じて電子資料を配布する．

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
メディア(情報伝達媒体)の特性と，それを支える人工知能技術に関する教養を身に付ける．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 川嶋 稔夫
角 康之
角 薫
平田 圭二
村井 源

None
name: 並列分散処理（Parallel and Distributed processing）

thema: 【テーマ・目標】
並列分散処理の有効性を理解し，原理と応用の理解および実現手法を習得する．

_lecture_content: 【講義内容】
現在の技術トレンドでは，計算性能の向上は CPU のクロックの向上ではなくコア数の増大によ
ってもたらされる．また，長時間の計算時間を必要とする難問やシミュレーション計算は多数あ
り，これらの計算を実現するために多数の CPU を結び付け，処理を分散させる並列分散処理技
術が重要性を増している．
本講義では，並列処理ならびに分散処理の理論について学ぶとともに，プログラミング演習を通
して実践的な技術の習得を目指す．
キーワード: 分散システム, 並列アーキテクチャ, 並列・分散アルゴリズム

scgedule: 2．講義計画
・スレッド
・平行アルゴリズム設計モデル
・平行アルゴリズムの検証
・平行アルゴリズムの性能指標
・マルチスレッドアプリケーション設計ルール
・OpenMP
・MPI
・MapReduce

grade: 3．成績の評価方法
課題（プログラム）および課題（１コマ程度の演習．1 回を予定）により評価する．

textbook: 4．教科書・参考書
参考書：C. ブレッシャーズ著, 並行コンピューティング技法, オライリージャパン．
参考書：A. S. タネンバウム, M. V. スティーン著, 水野忠則, 佐藤文明, 鈴木健二, 竹中友哉, 西
山智, 峰野博史, 宮西洋太郎訳, 分散システム 第 2 版, ピアソン桐原

note: 5．履修にあたっての注意事項
C 言語プログラミングによる演習および課題を課すため，
「アルゴリズムとデータ構造」
を履修し
ているか，あるいは相当する知識と技術を取得していることを前提とする．

remark: ６．備考
履修期間（後期 1 回目）の講義で「システムプログラミング」とあわせて履修についての注意を
行うので必ず出席すること．

target: 対象コース 情報システム
高度 ICT
コース専門選択

thema: 【テーマ・目標】
並列分散処理の有効性を理解し，原理と応用の理解および実現手法を習得する．

annual: 3 年次

semesta:  後期

unitnum: 1 単位

teacher: 松原 克弥

None
name: プロジェクトマネージメント（Project Management）

thema: 【テーマ・目標】
PMBOK に基づいて主にソフトウェア開発を対象としたプロジェクトマネジメントの知識基盤
を修得する．

_lecture_content: 【講義内容】
PMBOK に基づいて主にソフトウェア開発を対象としたプロジェクトマネジメントの知識基盤
を修得する．
ソフトウェア開発未経験者にも理解しやすい教科書を使用して， プロジェクトマネジメントの
基本的な考え方や手法， ツールなどについて， プロジェクトマネジメントの知識体系である
PMBOK に基づいて学ぶ．
また，
企業のプロジェクトマネージャを講師として招聘し，
プロジェクトマネジメント事例紹介，
大規模ソフトウェア開発を対象としたケーススタディ演習， WBS 演習を実施することにより，
実践的にプロジェクトマネジメントの手法を学ぶ．
キーワード: プロジェクトマネジメント, ソフトウェア開発, PMBOK, WBS, リスクマネジメ
ント

scgedule: 2．講義計画
・ ガイダンス， 第 1 章 プロジェクトマネジメント入門, 第 2 章 ソフトウェア開発プロセス
・ プロジェクト事例紹介 (企業講師)
・ 第 3 章 ソフトウェア開発におけるプロジェクトマネジメン卜, 第 4 章 プロジェクトのライ
フサイクルと組織
・ 第 5 章 PMBOK, 第 6 章 プロジェクトの立上げとスコープ定義
・ 第 7 章 WBS と資源計画, 第 8 章 スケジュール作成
・ 第 9 章 コスト見積り, 第 10 章 リスク管理
・ 第 11 章 プロジェクト・チーム,
・ ケーススタディ演習(1), (2), (3) (企業講師)
・ WBS 演習(1), (2) (企業講師)
・ 第 12 章 実績管理とコントロール, 第 13 章 コミュニケーション管理
・ 第 14 章 成果の品質管理, 第 15 章 調達とプロジェクトの終結
※以上は 2016 年度の内容に基づく計画であり，改善のための変更があり得る．

grade: 3．成績の評価方法
毎回の講義の開始時に実施する小テスト 70%程度 (ただし，
原則として 2/3 以上受験している
ことを必須とする).
演習の課題 (レポート) 30%程度．

textbook: 4．教科書・参考書
教科書: 「演習と実例で学ぶ プロジェクトマネジメント入門 第 2 版」, ソフトバンククリエイ
ティブ
参考書: 「プロジェクトマネジメント知識体系ガイド（PMBOK ガイド）第 5 版」, Project
Management Institute, Inc.

note: 5．履修にあたっての注意事項
ソフトウェア開発 （ソフトウェア工学） に関する基礎的な知識があること （例えば， 「ソフ
トウェア設計論 I」を履修済みであることなど） を前提に講義を行う．

remark: ６．備考

target: 対象コース 高度 ICT
コース専門必修
情報システム
情報デザイン
コース専門選択

thema: 【テーマ・目標】
PMBOK に基づいて主にソフトウェア開発を対象としたプロジェクトマネジメントの知識基盤
を修得する．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 奥野 拓

None
name: モデル化と要求開発（Modeling and Requirement Development）

thema: 【テーマ・目標】
より良いソフトウェア開発のためのモデル化技法と要求定義技法について学ぶ．

_lecture_content: 【講義内容】
より良いソフトウェア開発のためのモデル化技法や要求開発方法論(Openthology)等の各種技
法について，具体的な例題を用いた実習を通じて学ぶ．
特に要求開発について外部から講師を招いて,要求開発の事例紹介,ケーススタディ演習を実施す
ることで実践的な演習を行う.
キーワード: 要求分析, 要件定義, モデル化, 要求開発, システム開発

scgedule: 2．講義計画
・ガイダンスと導入
・要求開発概論
・演習準備，チーム分け
・要求開発演習
・演習発表
・RFP と提案書，システム化
・モデリング
・設計と実装
・まとめ

grade: 3．成績の評価方法
小テスト，課題（レポート）や課題（演習成果物＋口頭発表）等により総合的に評価する．

textbook: 4．教科書・参考書
参考書:「要求開発-価値ある要求を導き出すプロセスとモデリング」日経 BP 社
参考書:「現場の UML」ソーテック社
随時，追加資料を配布

note: 5．履修にあたっての注意事項
グループ演習の質確保のため，受講人数を制限する場合がある．

remark: ６．備考

target: 対象コース以外からの受講を希望する場合は，事前に必ず個人単位で担当教員に確認すること
対象コース 高度 ICT
コース専門必修
情報システム
コース専門選択

thema: 【テーマ・目標】
より良いソフトウェア開発のためのモデル化技法と要求定義技法について学ぶ．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 伊藤 恵

None
name: ユーザ・センタード・デザイン（User Centered Design）

thema: 【テーマ・目標】
[テーマ]
人間中心設計（Human Centerd Design/ User Centered Design）の理論と実践方法を理解す
る
[内容]
人間中心のデザインの考え方，歴史や設計手法を理解する．更に，演習課題で地域の活動を対象に
デザインワークを行い，人間中心のデザインの意義を実践的に学ぶ．この授業は，
「ユーザ・セン
タード・デザイン演習」と同時に受講すること．

_lecture_content: 【講義内容】
ヒューマンインタフェースで修得した内容を拡大し，単に人間とシステムとの接点だけでなく，そ
れを利用するユーザとして本当に利用する価値があり，使って満足できるシステムとはどういうも
のかを理解する．つまり，使う人間（ユーザ）を中心にしてシステムを開発することの必要性と重
要性を理解する．またそのための実践的な設計のプロセスを理解する．
セットになっている演習とは一体で授業を行い，演習のプロセスに合わせてその演習に必要な講義
をその都度行う．
・ ユーザ・センタード・デザイン(UCD)の必要性，重要性を具体事例で説明できる．
・ UCD の観点から必要なニーズを見つけ出し，具体化する方法を知っている．
・ UCD を実現するための設計プロセスを知っている．
・ UCD のプロトタイプを構築し，UCD 効果を評価確認する方法を知っている．
キーワード： 人間中心設計， 観察法， プロトタイプ

scgedule: 2．講義計画
1.授業内容およびテーマの説明
2.テーマ決定
3.基本コンセプト作成
4.コンセプトの展開とユーザ調査計画
5.ユーザ調査と分析
6.コンセプトの修正，中間審査会資料作成
7.中間審査会
8.プロトタイプの作成 1
9.プロトタイプの作成 2
10.プロトタイプの作成 3
11.プロトタイプの作成 4，ユーザ評価計画の作成
12.ユーザ評価と分析
13.プロトタイプの修正
14.最終発表会用資料作成
15.最終発表会

grade: 3．成績の評価方法
単位認定は，課題（中間発表）
，課題（成果発表会）及び課題（最終提出物）の総合評価．
講義と演習は一体のものとして評価するため，どちらも同一点が与えられる

textbook: 4．教科書・参考書
教科書：なし．
参考書：
「ドナルド・A. ノーマン： 誰のためのデザイン?―認知科学者のデザイン原論」
， 「黒
須正明他： 人間中心設計の基礎」

note: 5．履修にあたっての注意事項
「ユーザ・センタード・デザイン演習」と同時に履修すること．

remark: ６．備考
なし

target: 対象コース 情報デザイン
コース専門必修

thema: 【テーマ・目標】
[テーマ]
人間中心設計（Human Centerd Design/ User Centered Design）の理論と実践方法を理解す
る
[内容]
人間中心のデザインの考え方，歴史や設計手法を理解する．更に，演習課題で地域の活動を対象に
デザインワークを行い，人間中心のデザインの意義を実践的に学ぶ．この授業は，
「ユーザ・セン
タード・デザイン演習」と同時に受講すること．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 岡本 誠
安井 重哉

None
name: ユーザ・センタード・デザイン演習（User Centered Design Practice）

thema: 【テーマ・目標】
[テーマ]
人間中心設計（Human Centerd Design/ User Centered Design）の設計方法を習得する
[内容]
人間中心のデザインの設計方法を習得する．
「ユーザ・センタード・デザイン」で学んだ設計手法
を用い，演習課題で地域の活動を対象にデザインワークを行い，人間中心のデザインの設計手法を
実践的に習得する．この授業は，
「ユーザ・センタード・デザイン」と同時に受講すること．

_lecture_content: 【講義内容】
ヒューマンインタフェースで修得した内容を拡大し，単に人間とシステムとの接点だけでなく，そ
れを利用するユーザとして本当に利用する価値があり，使って満足できるシステムとはどういうも
のかを具体的に提案する．つまり，使う人間（ユーザ）を中心にしてシステムを開発することの必
要性と重要性を理解した提案を行う．またそのための実践的な設計のプロセスを実践する．セット
になっている講義とは一体で行い，講義内容を演習で実践する．
・ ユーザーが中心という考え方が身に付く．
・ UCD の観点から必要なニーズを見つけ出し具体的な提案が出来る．
・ UCD を実現するための設計プロセスを身につける．
・ UCD のプロトタイプを構築し，UCD 効果を評価確認することが出来る．
キーワード： 人間中心設計， 観察法, プロトタイピング

scgedule: 2．講義計画
1.授業内容およびテーマの説明
2.テーマ決定
3.基本コンセプト作成
4.コンセプトの展開とユーザ調査計画
5.ユーザ調査と分析
6.コンセプトの修正，中間審査会資料作成
7.中間審査会
8.プロトタイプの作成 1
9.プロトタイプの作成 2
10.プロトタイプの作成 3
11.プロトタイプの作成 4 ユーザー評価計画の作成
12.ユーザ評価と分析
13.プロトタイプの修正
14.最終発表会用資料作成
15.最終発表会

grade: 3．成績の評価方法
単位認定は，課題（中間発表）
，課題（成果発表会）及び課題（最終提出物）の総合評価．
講義と演習は一体のものとして評価するため，どちらも同一点が与えられる

textbook: 4．教科書・参考書
教科書：なし
参考書：
「ドナルド・A. ノーマン： 誰のためのデザイン?―認知科学者のデザイン原論」
， 「黒
須正明他： 人間中心設計の基礎」

note: 5．履修にあたっての注意事項
「ユーザ・センタード・デザイン（講義）
」と同時に履修すること．

remark: ６．備考
なし

target: 対象コース 情報デザイン
コース専門必修

thema: 【テーマ・目標】
[テーマ]
人間中心設計（Human Centerd Design/ User Centered Design）の設計方法を習得する
[内容]
人間中心のデザインの設計方法を習得する．
「ユーザ・センタード・デザイン」で学んだ設計手法
を用い，演習課題で地域の活動を対象にデザインワークを行い，人間中心のデザインの設計手法を
実践的に習得する．この授業は，
「ユーザ・センタード・デザイン」と同時に受講すること．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 岡本 誠
安井 重哉

None
name: ソフトウェアプロセスと品質（Software Process and Quality）

thema: 【テーマ・目標】
各種情報システムにおけるソフトウェアの開発プロセスと品質をテーマとする．さまざまな情報
システムを開発するためのプロセスや品質管理の考え方，品質管理手法や品質保証の考え方を修
得すると事を目標とする．

_lecture_content: 【講義内容】
ソフトウェアライフサイクルの中で，品質を作り込むための管理手法や品質保証を取り上げる．
そのためにソフトウェアの「品質」を定義し，開発プロセスの中で，品質を確保するために役立
つ，ツール，手法，指標などについて学ぶ．

scgedule: 2．講義計画
・ソフトウェアプロセスと品質とは
・ソフトウェア品質の概念，品質特性
・ソフトウェア品質の国際規格
・ソフトウェアの品質管理
・ドキュメントのレビュー手法
・ソフトウェアテスト
・ソフトウェアの品質保証
・ソフトウェアの生産性と品質
・ソフトウェアの品質と顧客満足度
・ソフトウェア品質管理と品質保証の実際
キーワード：ソフトウェアプロセス，品質管理，ソフトウェアテスト，品質保証，顧客満足度

grade: 3．成績の評価方法
出席，小テスト，レポート課題，定期試験によって総合的に評価する．

textbook: 4．教科書・参考書
必要な場合は講義の中で指定する．

note: 5．履修にあたっての注意事項
「プロジェクトマネージメント」を受講していること．

remark: ６．備考

target: 対象コース 高度 ICT
コース専門必修
情報システム
コース専門選択

thema: 【テーマ・目標】
各種情報システムにおけるソフトウェアの開発プロセスと品質をテーマとする．さまざまな情報
システムを開発するためのプロセスや品質管理の考え方，品質管理手法や品質保証の考え方を修
得すると事を目標とする．

annual: 4 年次

semesta:  前期

unitnum: 2 単位

teacher: 大場 みち子

None
name: IT アーキテクチャ概論（Introduction to IT Architecture）

thema: 【テーマ・目標】
IT システム開発において，システムの構造や仕様を定める適切なアーキテクチャを設計すること
は，システム開発の効率や完成後のシステムの性能，可用性，拡張性や運用コストなどに大きな
影響を与える重要な作業である．本講義では，世界中で最も利用されているソフトウェアのひと
つである Linux カーネルを題材にして，
優れたソフトウェア・アーキテクチャのデザインや思想，
その実現手法を学習することで，アーキテクチャ設計の素養を身につけることを目指す．

_lecture_content: 【講義内容】
Linux カーネルの機能と内部構造について，その仕様や実現手法について，理論と実装技術の両
面から学習する．
講義では，
ソースコードやオープンソース・コミュニティのメーリングリスト・
アーカイブなどを適宜参照しながら，各機能が実現された経緯やその設計思想，実装コードの変
化などから，適切なアーキテクチャがどうあるべきかについて理解する．また，Linux カーネル
のビルドや動作検証，カーネル機能の拡張などの演習も行う．
キーワード: ソフトウェアアーキテクチャ，Linux カーネル，デバイスドライバ

scgedule: 2．講義計画
・タスク管理とスケジューラ
・メモリ管理
・ストレージ管理
・デバイス管理
・タイマーと時刻管理
・同期と排他制御
・CPU アーキテクチャ管理
・トレース・デバッグ機能

grade: 3．成績の評価方法
課題（レポート）
，課題（プログラム）および演習（１コマ程度．１回を予定）を総合して評価す
る

textbook: 4．教科書・参考書
参考書：高橋浩和, 小田逸郎, 山幡為佐久著, Linux カーネル 2.6 解読室, ソフトバンククリエイ
ティブ
参考書：J. コルベット, A. ルンビニ, G. K-ハートマン著, 山崎康宏, 山崎邦子, 長原宏治, 長原陽
子訳, Linux デバイスドライバ 第 3 版, オライリージャパン

note: 5．履修にあたっての注意事項
「情報処理演習 I」
，
「システムプログラミング」
，
「オペレーティングシステム」
を履修しているこ
とを前提とする．1 回目の講義で履修についての注意を行うので必ず出席すること．

remark: ６．備考
なし．

target: 対象コース 高度 ICT
コース専門必修

thema: 【テーマ・目標】
IT システム開発において，システムの構造や仕様を定める適切なアーキテクチャを設計すること
は，システム開発の効率や完成後のシステムの性能，可用性，拡張性や運用コストなどに大きな
影響を与える重要な作業である．本講義では，世界中で最も利用されているソフトウェアのひと
つである Linux カーネルを題材にして，
優れたソフトウェア・アーキテクチャのデザインや思想，
その実現手法を学習することで，アーキテクチャ設計の素養を身につけることを目指す．

annual: 4 年次

semesta:  前期

unitnum: 2 単位

teacher: 松原 克弥

None
name: 情報デザイン特論（Theory of Information Design）

thema: 【テーマ・目標】
テーマ：人間中心設計やデザイン思考に関して学習する．
目標：テーマに関する概念を理解し，主要な方法を使う経験をする．

_lecture_content: 【講義内容】
人間中心設計やデザイン思考について，概要を学ぶ．
・人間中心設計やデザイン思考の社会的意義や活動内容を学ぶ．
・人間中心設計やデザイン思考の手法を学ぶ．
・学んだことを表す．
キーワード：人間中心設計，デザイン思考

scgedule: 2．講義計画
１：授業のイントロ： 人間中心設計(HCD)やデザイン思考の意義，社会背景
２：HCD
３．ユーザビリティ
４．ユーザエクスペリエンス
５．デザイン思考
6.HCD プロセス
7.利用状況の把握１（フィールドワーク）
8.利用状況の把握 2（エスノグラフィ）
9.要求の明確化 1（ペルソナ，シナリオ）
10.新しいデザインアプローチ（参加型デザイン）
11.評価分析（量的，質的）
12～15.学びのまとめ

grade: 3．成績の評価方法
課題（成果，発表）の総合評価による．

textbook: 4．教科書・参考書
教科書：人間中心設計入門，人間中心設計の基礎
参考書：デザイン思考が世界を変える： ティム ブラウン著

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 情報デザイン
コース専門選択

thema: 【テーマ・目標】
テーマ：人間中心設計やデザイン思考に関して学習する．
目標：テーマに関する概念を理解し，主要な方法を使う経験をする．

annual: 4 年次

semesta:  前期

unitnum: 2 単位

teacher: 岡本 誠

None
name: 卒業研究（Graduation Study）

thema: 【テーマ・目標】
卒業研究を通じて研究の進め方について学ぶ．

_lecture_content: 【講義内容】
研究室に配属され指導教員の指導のもとで卒業研究を行い卒業論文を作成し発表する．

scgedule: 2．講義計画
通年で指導教員の指導のもとで研究を自主的に進める．

grade: 3．成績の評価方法
研究態度，卒業論文などから総合的に判断する．

textbook: 4．教科書・参考書

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 全コース
学部専門必修

thema: 【テーマ・目標】
卒業研究を通じて研究の進め方について学ぶ．

annual: 4 年次

semesta:  通年

unitnum: 8 単位

teacher: 卒研担当

None
name: ハードウェア基礎（Basic Hardware）

thema: 【テーマ・目標】
コンピュータは論理回路を基本として，それらを組み合わせた大規模なハードウェアである．この
講義では基本となるデータ表現および論理回路の基本的な性質をまなぶとともに，それらを組み合
わせてコンピュータを構成するまでの各段階を順を追って学んでゆく．

_lecture_content: 【講義内容】
コンピュータハードウェアは，
0 と 1 の二つの状態を扱うことのできる電子回路をもとにつくられ
た，きわめて大規模なシステムである．この講義の前半では，コンピュータの内部でのデータ表現
法を理解するとともに，ブール代数などの数学的なモデルをもとに，それを処理する組合せ論理回
路，順序回路などの論理回路の動作原理や，機能的ビルディングブロックについて学ぶ．後半では
プロセッサの基本構成，アセンブリ言語，命令セット，記憶装置，入力装置などコンピュータアー
キテクチャの基礎を学ぶ．

scgedule: 2．講義計画
1 コンピュータハードウェアとは(1 週)
・コンピュータのしくみ，ディジタルによる抽象化，ハードウェアとは，講義の構成
2 データ表現(2 週)
・数の体系，文字コードと符号化，論理ゲート，ディジタル化抽象化の裏側
3 論理回路(5 週)
・集合演算，ブール論理式，ブール代数，主加法標準形，マルチレベル論理回路
・カルノーマップ，加算器，マルチプレクサ，デコーダ，タイミング
・ラッチとフリップフロップ，同期式順序回路，レジスタ，メモリ，有限状態マシン
4 アーキテクチャ(3 週)
・プロセッサの基本構成，アセンブリ言語，機械語，番地指定モード
・コンパイル，アセンブル，ロード，プロセッサの実例
5 記憶装置(1 週)
・記憶装置の原理，主記憶装置，補助記憶装置
6 入出力装置(1 週)
・入出力装置，入出力インタフェース
7 コンピュータの性能と信頼性(2 週)
・性能の尺度，性能の推移，コンピュータの信頼性の評価

grade: 3．成績の評価方法
単位認定は以下の条件を前提とする．
・全講義回数の 2/3 以上の出席
・すべての課題(レポート)が提出されていること
・総合点で 60 点以上の獲得
なお総合点は，基本的に課題(レポート)の評価(20%)と期末試験の成績(80%)から求める．

textbook: 4．教科書・参考書
(教科書) D. ハリス，S. ハリス: ディジタル回路設計とコンピュータアーキテクチャ， 翔泳社．
この教科書は 2 年生後期に開講されるハードウェア設計でも使用する．
(参考書) 橋本，松永，小林，天野: 図解 コンピュータ概論 ハードウェア 改訂第 3 版， オーム社

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
知能システム
コース専門必修

thema: 【テーマ・目標】
コンピュータは論理回路を基本として，それらを組み合わせた大規模なハードウェアである．この
講義では基本となるデータ表現および論理回路の基本的な性質をまなぶとともに，それらを組み合
わせてコンピュータを構成するまでの各段階を順を追って学んでゆく．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 藤野 雄一
白勢 政明

None
name: 形式言語とオートマトン（Formal Languages and Automata）

thema: 【テーマ・目標】
コンピュータによる記号・計算・言語処理の基礎を学ぶ．

_lecture_content: 【講義内容】
コンピュータによる情報処理は，基本的には記号の集まりからなるデータの処理である．そこで
は，記号の並べ方によりどれくらいの記述能力があり，それを処理するにはどのような能力をも
った機械が必要であるか，またそのためにどのくらいの処理時間を要するのかを見極めておく必
要がある．記号の並べ方は，いわゆる文法規則であるが，この規則をクラス分けして，それぞれ
のクラスごとに表現能力や計算機械の能力を分析する．
このような学習を通じて，表現の基本的なモデルや考え方を学び，一方それに対応した計算機械
の基本的なモデルを学び，
表現することおよび計算することの基礎を習得することを目的とする．
これにより，コンピュータの処理の限界も明確になり，より上位の情報処理を考えるときにも，
基本的な枠組みは変わらないので，
ここで学ぶことは情報処理の基礎的な概念として重要である．

scgedule: 2．講義計画
1.形式文法と形式言語に関する基礎概念
2.オートマトンに関する基礎概念
3.正規文法と有限オートマトン
4.文脈自由言語とプッシュダウンオートマトン
5.句構造文法とチューリングマシン

grade: 3．成績の評価方法
期末テスト，小テスト，課題，出席状況などにより総合的に評価する．

textbook: 4．教科書・参考書
教科書：オートマトン・言語理論の基礎，米田政明他，近代科学社
参考書：オートマトン 言語理論 計算論 I，J.ホップクロフト/J.ウルマン共著，サイエンス社

note: 5．履修にあたっての注意事項
「情報表現入門」および「プログラミング基礎」を履修していることが望ましい．

remark: ６．備考

target: 対象コース 複雑系
コース専門必修

thema: 【テーマ・目標】
コンピュータによる記号・計算・言語処理の基礎を学ぶ．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 由良 文孝

None
name: システム数学基礎（Basic System Mathematics）

thema: 【テーマ・目標】
2 変数関数の微分学から複素関数論の入門までを学ぶ．論理的な厳密性を追求するよりは，正確
な計算技術を身に付けることを目標とする．

_lecture_content: 【講義内容】
数学自身はもとより物理や工学など様々な領域で，この科目で習得する内容を使う場面が多数出
てくる．少なくとも参考文献を片手にそのような場面を乗り越えることができるように，講義で
は具体的な問題を通して教科書の読み方をガイドする．

scgedule: 2．講義計画
1.序論
2.2 変数関数とその連続性
3.偏導関数
4.合成関数の偏微分法
5.高階偏微分
6.極値
7.極値問題の解法
8.まとめ
9.複素数と複素平面
10.複素関数
11.複素数列の極限
12.複素関数の連続性
13.複素関数の微分可能性と Cauchy-Riemann の方程式
14.正則関数
15.まとめ

grade: 3．成績の評価方法
定期試験と出席状況やレポート課題の状況など，総合的に判定する．

textbook: 4．教科書・参考書
1) 1 年次の『解析学Ⅰ・Ⅱ』で使用した以下のものを使う．
上見，勝股，加藤，久保田，神保，山口『微分』共立出版
2) 殿塚，河村 ”理工系の複素関数論”
（東京大学出版会）

note: 5．履修にあたっての注意事項
1 変数関数の微分学が基礎になっているので，高校の数Ⅱや数Ⅲも込めた今までの解析学を，す
べて良く復習してから受講することが望ましい．

remark: ６．備考
平成 17～21 年入学者用科目『複素関数論』は，この科目で読み替える．

target: 対象コース 複雑系
コース専門必修

thema: 【テーマ・目標】
2 変数関数の微分学から複素関数論の入門までを学ぶ．論理的な厳密性を追求するよりは，正確
な計算技術を身に付けることを目標とする．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 川口 聡

None
name: 確率論（Probability Theory）

thema: 【テーマ・目標】
確率論の基礎を理解するとともに，情報理論の基礎で必要となる推定論・統計論の基礎的概念を
学ぶ．

_lecture_content: 【講義内容】
確率論においては，非確定な現象を確率モデルにより記述することに重点をおき，確率論の基礎
概念を重点的に学ぶ．推定論・統計学においては，数理統計学の基礎を理解するために必要な知
識，仮説検定，推定などの手法を学ぶ．
本講義を履修することにより，非確定な現象の数学的表現と確率論の基礎知識が取得でき，統計
学における仮説検定と推定の概念が理解できる．
キーワード：偶然事象，集合論，測度論，ルベーグ積分，統計学

scgedule: 2．講義計画
1. 序論（高等学校数学における関連項目）
2. 確率とは（現代確率論と基礎用語の定義）
3. 確率変数と確率分布
4. 平均操作
5. 確率分布の性質を表す指標
6. 積率(モーメント)と積率(モーメント)母関数
7. 離散型確率分布の例
8. 連続型確率分布の例
9. 多次元確率分布の例
10.独立な確率変数の和の確率分布
11. 大数の法則と中心極限定理
12. 統計的推定
13. 統計的推定の例
14. 仮説検定
15. 仮説検定の例
本講義の manaba コース：{https://manaba.fun.ac.jp/ct/course_19293}

grade: 3．成績の評価方法
毎時間行う演習，課題（レポート）および期末試験の総合評価（演習 20%+課題 40%+期末試験
40%）で行う．

textbook: 4．教科書・参考書
教科書： 機械学習のための確率と統計，杉山 将 著，講談社，ISBN:9784061529014，
2015/4/7．
参考書
1) 確率と統計 ―情報学への架橋―，渡辺澄夫・田村昇 共著，コロナ社，
ISBN:9784339060775，2008/3/10．
2) 確率統計要論―確率モデルを中心にして―，尾畑伸明 著，牧野書店，ISBN:
9784434101496，2007/1/25．
3) 参考書：高等学校の数学の教科書
講義の情報：{manaba 確率論 2-GHI,https://manaba.fun.ac.jp/ct/course_19293}

note: 5．履修にあたっての注意事項
毎時間，講義の後半でプリントなどによる演習を行い，講義終了時に提出してもらう．このプリ
ントの提出を出席に替える．但し，名前のみの白紙は欠席とみなす．

remark: ６．備考
後期に開講する選択科目の「確率論と情報理論」を受講する場合は，本講義を履修していること
が前提となっている．

target: 対象コース 複雑系
コース専門必修

thema: 【テーマ・目標】
確率論の基礎を理解するとともに，情報理論の基礎で必要となる推定論・統計論の基礎的概念を
学ぶ．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 高橋 信行

None
name: 生物物理の基礎（Fundamental Biophysics）

thema: 【テーマ・目標】
生物を情報科学で取り扱うための生物物理の基礎知識を身につける．

_lecture_content: 【講義内容】
生物を情報科学で取り扱う際，生物のみならず物理学や化学，あるいは物理化学など複数の領域
にわたっての統合された知識が必要となる．その中で，生物を観測し記述するために必要不可欠
な基礎知識を，生物物理学に沿って習得することを目指す．
生命現象の理解に必要不可欠な高校レベルの化学や物理の復習から始まり，特にタンパク質を中
心に細胞分子生物学や生化学の基礎知識を学び，更に電気生理を理解するための電子回路や電気
化学や基礎知識について学ぶ．

scgedule: 2．講義計画
次のテーマに沿い，理解の度合いを確認しつつ講義を進める．
1. 生物を観るときの問題点
2. 物質の構造原子，分子
3. 物質の状態と溶液
4. 酸・塩基，酸化・還元
5. 化学結合（強い結合）と物理結合（弱い結合）
6. 生命を構成する分子
7. 緩衝液
8. 生化学実験法
9. タンパク質の結晶構造解析法
10. タンパク質の機能・酵素
11. 分子動力学によるシミュレーション法
12. 科学計測における電子回路基礎
13. 物理化学計測の基礎
14. 生体信号計測の基礎
15. まとめと期末試験

grade: 3．成績の評価方法
期末試験 50%，課題（レポート）50%により評価する．

textbook: 4．教科書・参考書
参考書：Molecular Biology of THE CELL,Bruce Alberts et. al., Garland Publishing

note: 5．履修にあたっての注意事項
人体生理学を受講していることが望ましい．

remark: ６．備考
なし．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
生物を情報科学で取り扱うための生物物理の基礎知識を身につける．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 櫻沢 繁

None
name: 複雑系科学トピックス（Topics on Complex Systems Science）

thema: 【テーマ・目標】
複雑系科学のさまざまな分野の研究にふれながら，複雑系科学で扱う諸概念を学ぶ．

_lecture_content: 【講義内容】
複雑系科学の諸分野の先端的研究にふれながら，
複雑系科学の概念的な道具の基礎を学ぶ．
自然，
生命，経済，社会などを複雑系として解明する基礎理論，及び実システムを複雑系として解析す
る手法を概観することで，コース配当科目の相互関連への理解を深める．

scgedule: 2．講義計画
1. はじめに
2. 複雑系科学とは
3. ゲーム理論，実験経済学
4. マルチエージェント・シミュレーション
5. 最適化理論，離散アルゴリズム
6. 偏微分方程式論
7. カオス理論
8. 統計力学，非線型物理学
9. 統計的信号処理，確率過程論
10. 機械学習，パターン認識
11. 脳科学，脳理論
12. 生物物理学数値解析，金融工学
13. 非線形科学
14. 可積分系，セルオートマトン
15. まとめ

grade: 3．成績の評価方法
出席状況，課題（レポート）
，期末試験などにより総合的に評価する．

textbook: 4．教科書・参考書
開講時にテーマに応じて担当教員が指定する．

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
複雑系科学のさまざまな分野の研究にふれながら，複雑系科学で扱う諸概念を学ぶ．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 複雑系コース教員

None
name: 力学基礎（Elementary Dynamics）

thema: 【テーマ・目標】
力学の考え方および基礎的知識を身につける．

_lecture_content: 【講義内容】
力学は，物理学全体の基礎であるばかりでなく，他の自然科学や工学の諸分野，特に複雑系を学
ぶ上で必要となるカオスなどの基礎ともなっている．この講義では，力学の考え方を紹介し，そ
こに出てくる諸概念，たとえば，力，運動量，エネルギーなどを解説する．さらに，これら力学
の考え方が，他の分野とどのように関係しているかについても概説する．

scgedule: 2．講義計画
1 はじめに
2 質点の運動とその法則（1）
：質点の位置ベクトル，速度，加速度
3 質点の運動とその法則（2）
：3 次元空間のベクトルとその演算
4 質点の運動とその法則（3）
：運動の 3 法則
5 運動方程式の解法（1）
：運動の合成と分解
6 運動方程式の解法（2）
：いろいろな運動の運動方程式
7 運動方程式の解法（3）
：流体中の落体の運動
8 中間試験
9 仕事とエネルギー（1）
：質点の運動エネルギーと力のする仕事（1）
10 仕事とエネルギー（2）
：質点の運動エネルギーと力のする仕事（2）
11 仕事とエネルギー（3）
：保存力の場のポテンシャル（1）
12 仕事とエネルギー（4）
：保存力の場のポテンシャル（2）
13 振り子について（1）
：極座標による運動の記述（1）
14 振り子について（2）
：極座標による運動の記述（2）
15 まとめ

grade: 3．成績の評価方法
中間試験と期末試験で評価する（4:6 の比率で評価する）
．

textbook: 4．教科書・参考書
教科書：藤原邦男「物理学序論としての力学」東京大学出版会

note: 5．履修にあたっての注意事項
「物理学入門」
，
「線形代数学 I, II」
，
「解析学 I, II」を履修していることが望ましい．

remark: ６．備考

target: 対象コース 複雑系
コース専門必修

thema: 【テーマ・目標】
力学の考え方および基礎的知識を身につける．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 斉藤 朝輝

None
name: 確率・統計学（Probability Theory and Statistics）

thema: 【テーマ・目標】
【テーマ・目標】
確率論・統計学の基礎，および工学へ応用する方法を学び，確率論の利用法を理解する．
【学習目標】
・ 確率論の基礎を理解する．
・ 統計学の基礎を理解する．
・ 確率密度関数および確率分布関数を理解する．
・ 確率過程を表現するための様々な特徴量(平均，分散，共分散，自己相関関数，など)を理解
する．

_lecture_content: 【講義内容】
数理統計学の基礎を理解するために必要な基礎知識，および工学へ応用する方法を学ぶ．
キーワード: 確率変数, 確率分布関数, 平均,共分散, 確率分布

scgedule: 2．講義計画
コースによっては授業内容が多少異なることがある．
講義 1ー講義 3：事象と確率
講義 4ー講義 5：確率変数と離散確率関数
講義 6ー講義 7：確率分布関数と確率密度関数
講義 8ー講義 9：確率変数の平均
講義 10ー講義 11：確率変数の共分散
講義 12ー講義 13：条件付確率
講義 14ー講義 14：確率分布

grade: 3．成績の評価方法
出席，レポートおよび，定期試験の総合評価による．

textbook: 4．教科書・参考書
教科書：中川正雄，真壁利明著，確率過程，培風館
参考書：A.コルモゴロフ; I.ジュルベンコ; A.プロホロフ, コルモゴロフの確率論入門, 森北出版

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
【テーマ・目標】
確率論・統計学の基礎，および工学へ応用する方法を学び，確率論の利用法を理解する．
【学習目標】
・ 確率論の基礎を理解する．
・ 統計学の基礎を理解する．
・ 確率密度関数および確率分布関数を理解する．
・ 確率過程を表現するための様々な特徴量(平均，分散，共分散，自己相関関数，など)を理解
する．

annual: 2 年次

semesta:  前期

unitnum: 2 単位

teacher: 姜 暁鴻
(Jiang, Xiaohong)

None
name: アルゴリズムとデータ構造（Algorithms and Data Structures）

thema: 【テーマ・目標】
“アルゴリズムとデータ構造”は，アルゴリズムを設計し，効率的なプログラムを作成するために，
必ず学ばねばならない基礎知識の要である．優れたアルゴリズムの動作原理の理解とプログラムと
しての実現の技術を学ぶ．データ構造と探索のプログラムをＣ言語を用いて実現する方法を習得す
る．

_lecture_content: 【講義内容】
アプリケーションやシステムを効率的に表現するために必要な計算手順とデータ構造について，そ
の特徴や存在意義，応用について学ぶ．効率の良いソフトウエアを実現するためには，扱うデータ
をいかに目的に合ったアルゴリズムに適した構造で表現するかが大きな問題である．本講義では，
配列，スタック，キュー，リスト，木などの代表的なデータ構造と，それを取り扱うアルゴリズム
を解説し，これらを通じて，ソフトウエアの設計や解析をするための基本的な考え方の習得を目指
す．本講義は，全てのソフト開発の基礎となる重要な基礎科目である．コンピュータの世界は，日
進月歩である．しかし，物事の本質を理解しておけば，表面的な変化があっても，正しい対処はで
きる．授業では，分かりやすく整理されたプログラムを書くこと，プログラムの実行に要する計算
手間を客観的に評価すること，などの重要な概念や実用上の重要なものについて述べる．
キーワード：アルゴリズム, データ構造, 計算量

scgedule: 2．講義計画
1. 序論（計算手順の概念，効率の良いアルゴリズム）とプログラム実行環境の確認
2. 基本的なデータ構造とその表現 1（配列，ポインター）
3. 基本的なデータ構造とその表現 2（構造体）
4. 文字列処理（C 言語の文字列と文字列検索）
5. データ構造 1（スタック）
6. 動的メモリ管理
7. データ構造 2（キュー）
8. データ構造 3（単連結リスト構造）
9. データ構造 4（重連結リスト構造）
10.アルゴリズムの再帰的，非再帰的な表現
11.整列（ソート）1
12.整列（ソート）2
13.木構造
14.整列（ソート）3
15.平衡木
本講義の manaba コース： {https://manaba.fun.ac.jp/ct/course_19326}

grade: 3．成績の評価方法
毎回行う演習(20%)，課題（プログラム:30%）
，期末試験(50%)により，講義で学習したデータ
構造とアルゴリズムの理解度を評価する．

textbook: 4．教科書・参考書
教科書：
「新・明解 C 言語によるアルゴリズムとデータ構造 」
，柴田望洋・辻亮介 著，ソフトバン
ククリエイティブ(ISBN 9784797366242 , 2011/08/27 出版)
参考書：
「C によるアルゴリズムとデータ構造」
，茨木俊秀著，昭晃堂
「アルゴリズム C」第 1 巻・第 2 巻・第 3 巻，R.セジウィック著，近代科学社

note: 5．履修にあたっての注意事項
反転講義以外では，各時間の前半は講義中心であるが，授業の後半で C のプログラムを用いた練習
問題で演習を行い，さらに，課題として練習問題で用いたプログラムの改良を指示する

remark: ６．備考
前半のＣ言語の復習では，反転(講義内容を宿題として行い，教室で演習を行う)講義形式で行う．
後半では，各講義が相互に関連するため，講義を休むと以後の内容が理解出来ない恐れがある．

target: 対象コース 複雑系
知能システム
学科共通必修

thema: 【テーマ・目標】
“アルゴリズムとデータ構造”は，アルゴリズムを設計し，効率的なプログラムを作成するために，
必ず学ばねばならない基礎知識の要である．優れたアルゴリズムの動作原理の理解とプログラムと
しての実現の技術を学ぶ．データ構造と探索のプログラムをＣ言語を用いて実現する方法を習得す
る．

annual: ２年次

semesta:  前期

unitnum: 2 単位

teacher: 高橋信行
加藤浩仁

None
name: システムと微分方程式（System and Differential Equation）

thema: 【テーマ・目標】
常微分方程式とその系の解析を学ぶ．具体的な問題を通してこの分野を概観できるようになるこ
とを目標とする．

_lecture_content: 【講義内容】
解の公式集などに一切頼ることなく，手ぶらで 2 階の非斉次線形微分方程式や 2×2 の連立線形
微分方程式を解けるようにする．カオス・フラクタルや数理生物学におけるモデルの解析などを
含む，本学のより高度な授業や卒業研究を支える基礎を作る．

scgedule: 2．講義計画
1.序論および解の存在と一意性に関する注意
2.斉次 1 階線形方程式
3.非斉次 1 階線形方程式
4.斉次 2 階線形方程式
5.非斉次 2 階線形方程式
6.非線形方程式
7.まとめ
8.定数係数 1 階連立線形方程式
9.方程式と解の構造の関係
10.相平面解析の導入
11.陰関数定理の復習と相平面解析への応用
12.相平面解析
13.線形代数学を用いた解法の紹介
14.ラプラス変換による解法の紹介
15.まとめ

grade: 3．成績の評価方法
中間試験，期末試験により総合的に評価する．課題（レポートや小テスト）を課した場合には，
それらも成績評価の対象とする．ただし，これらの比率は受講状況によって決定され，授業内で
受講生に通知される．

textbook: 4．教科書・参考書
村上温夫『微分方程式入門』基礎数学叢書 10，新曜社（1997）
，ISBN : 4-7885-0617-3，
定価 2,000 円

note: 5．履修にあたっての注意事項
1 変数関数の微積分学，特に部分積分は必須である．また後半の相平面解析では，前期開講『シ
ステム数学基礎』で学んだ 2 変数関数が出てくるので，良く復習してから受講することが望まし
い．

remark: ６．備考
平成 17～21 年入学者用科目『微分方程式Ａ』は，この科目で読み替える．

target: 対象コース 複雑系
コース専門必修

thema: 【テーマ・目標】
常微分方程式とその系の解析を学ぶ．具体的な問題を通してこの分野を概観できるようになるこ
とを目標とする．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 高村 博之

None
name: 複雑系科学実験（Experiments on Complex Systems）

thema: 【テーマ・目標】
実験を通じて確率，平均，誤差，標準偏差，検定，最小 2 乗法などの基礎的な統計の概念と，レ
ポートの書き方を学ぶと共に，複雑系科学で取り扱われる複雑な現象を題材に，測定，解析，シ
ミュレーションなど実験科学の基本的な方法論を学ぶ．

_lecture_content: 【講義内容】
科学の方法論とは一般に，現象の客観的観察とその抽象化，およびその客観的記述である．本講
義は 4 つのステップでそれらの基礎を学んでいく．ステップ 1 では，まず確率・統計・検定の概
念を確認し，現象の客観的記述としてレポートの書き方を学ぶ．次に，以降の実験に必要なオペ
アンプ，オシレータ，オシロスコープ，A/D 変換器の使い方を学ぶ．ステップ 2 では，測定の
基礎として誤差や最小 2 乗法について学ぶ．更に各種のセンサを用いて，力学計測，電気計測，
生体計測を行う．ステップ 3 では，ステップ 2 で測定した時系列データを用いて，様々な時系列
解析を学ぶ．最後にステップ 4 では，まず簡単な微分方程式を学び，ステップ 2 で測定した現象
についての微分方程式によるモデル化を学び，数値計算によるシミュレーションを体験する．

scgedule: 2．講義計画
ステップ 1（基礎）
1.イントロダクション～レポートの書き方～
2.確率・統計と検定
3.電気回路とオペアンプ（反転増幅器・非反転増幅器）
，A/D 変換
ステップ 2（測定）
4.各種センサと較正
5.振り子の運動
6.過渡現象
7.生体計測
8.電気回路とカオス 1
9.電気回路とカオス 2
ステップ 3（解析）
10.時系列解析 1
11.時系列解析 2
12.アトラクタ
ステップ 4（シミュレーション）
13.微分方程式
14.数値計算法によるシミュレーション 1
15.数値計算法によるシミュレーション 2

grade: 3．成績の評価方法
各実験の後に課される課題（レポート）で評価する．

textbook: 4．教科書・参考書
なし．

note: 5．履修にあたっての注意事項

remark: ６．備考
情報処理演習 I と複雑系科学実験は，複雑系コース専門選択必修科目である．
講義室及びエレクトロニクス工房で実施する．

target: 対象コース 複雑系
コース専門
選択必修※

thema: 【テーマ・目標】
実験を通じて確率，平均，誤差，標準偏差，検定，最小 2 乗法などの基礎的な統計の概念と，レ
ポートの書き方を学ぶと共に，複雑系科学で取り扱われる複雑な現象を題材に，測定，解析，シ
ミュレーションなど実験科学の基本的な方法論を学ぶ．

annual: ２年次

semesta:  後期

unitnum: 2 単位

teacher: 櫻沢 繁

None
name: 確率論と情報理論（Probability and Information Theory）

thema: 【テーマ・目標】
確率論および統計的推測法の基礎概念を理解し，情報理論との関係を学ぶ．

_lecture_content: 【講義内容】
確率論においては，確率論の基本概念を重点的に学び，非確定な現象を確率モデルにより記述す
ることに重点をおく．これに基づき，確率モデルの同定に必要な推定論・ベイズ推定論など情報
学で必要となる基礎知識を学ぶ．
情報理論においては，情報量，エントロピーなどの情報理論の基礎を学び，統計的推定との関係
を理解する．
本講義を履修することにより，確率論の基礎，確率的な現象の数学的表現方法及び同定法などの
情報学で必要となる基礎知識が理解できる．
キーワード：確率論，情報理論，予測・推定

scgedule: 2．講義計画
1.: 序論とガイダンス
2.: 確率論の基礎
3.: 期待値，分散
4.: 離散型確率変数とその分布
5.: 連続型確率変数とその分布
6.: 高次モーメント
7.: 多次元分布
8.: 大数の法則・中心極限定理
9.: 相関と共分散行列
10.: 推定論の基礎
11.: クラメール・ラオ不等式，最尤推定
12.: 最尤推定法の応用
13.: 情報量と平均情報量, 推定論との関係
14.: ベイズ推定論の基礎

grade: 3．成績の評価方法
期末試験で行う．

textbook: 4．教科書・参考書
教科書:確率と統計情報学への架橋，渡辺澄夫，村田昇 共著，コロナ社，ISBN:
9784339060775
参考書: 機械学習のための確率と統計 (機械学習プロフェッショナルシリーズ), 杉山 将, 講談社,
ISBN-13: 978-4061529014
参考書:確率統計要論―確率モデルを中心にして―，尾畑伸明 著，牧野書店，ISBN:
9784434101496

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
確率論および統計的推測法の基礎概念を理解し，情報理論との関係を学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 竹之内 高志

None
name: 経済システム入門（Introduction to Economic System）

thema: 【テーマ・目標】
ミクロ・マクロ経済学の基礎を理解する

_lecture_content: 【講義内容】
現代資本主義社会で生きるわたしたちにとって，経済学の基礎知識は必要不可欠な教養の一つで
ある．経済社会における基本問題は希少な資源の効率的な配分であると言われますが，ではなぜ
この効率的配分にとって市場がもっとも優れているのか，
これに応えるのがミクロ経済学である．
また，なぜ失業やインフレーションが発生するのか，経済を成長させる要因は何か，為替相場は
どのように決まるのか，こうした問題に応えるのはマクロ経済学である．この講義では，経済学
の歴史から始めて，ミクロ経済学とマクロ経済学の基礎を学びます．講義では，基本的な内容理
解を目指する．また，公務員試験の問題を適宜例題に使います．

scgedule: 2．講義計画
1. 経済学とは何か
2. 経済学の歴史
3. 消費者行動
4. 企業行動
5. 市場理論 1
6. 市場理論 2
7. 産業連関分析
8. ミクロ経済学のまとめ
9. マクロ経済分析 1
10. マクロ経済分析 2
11. 経済成長 1
12. 経済成長 2
13. 国際貿易 1
14. 国際貿易 2
15. マクロ経済学のまとめ

grade: 3．成績の評価方法
中間レポート課題 1 回と期末試験による．成績は，レポート課題を約 4 割，期末試験を約 6 割
の比率で評価して決定する．

textbook: 4．教科書・参考書
教科書：
川越敏司『現代経済学のエッセンス』河出ブックス
参考書：
小川一仁・川越敏司・佐々木俊一郎著，
『実験ミクロ経済学』
，東洋経済新報社
小川一仁・川越敏司・佐々木俊一郎著，
『実験マクロ経済学』
，東洋経済新報社

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
ミクロ・マクロ経済学の基礎を理解する

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 川越 敏司

None
name: 情報代数と符号理論（Information Algebra and Code Theory）

thema: 【テーマ・目標】
情報理論・符号理論における符号化の概念は，情報通信や情報記録をはじめ，暗号や情報セキュ
リティなど情報を扱う多くの分野に関係する重要な内容を含んでいる． 情報理論・符号理論の発
展を支える基盤となっている「情報代数」の基本を理解すると共に，符号理論や暗号理論の分野
を理解するための基礎知識と技術を獲得する．

_lecture_content: 【講義内容】
広義の情報理論の主要な分野が符号化である．符号化とは，簡単に言えば，目的に応じて情報の
形態を変換することであり，主要な符号化としては，
「効率向上のための符号化」
（情報源符号
化）
，及び「信頼性向上のための符号化」
（通信路符号化）がある． 本講義では，情報理論・符号
理論の基礎となる情報代数を学び，その代数系の応用として，情報源符号化としてハフマン符号
を，情報源符号化として線形符号，巡回符号，BCH 符号について学ぶ．
キーワード: 符号理論，情報理論．

scgedule: 2．講義計画
1.剰余系と合同関係
2.ハフマン符号
3.単一パリティ検査符号，線形符号
4.パリティ検査行列
5.ハミング距離，誤り検出と誤り訂正
6.ハミング符号
7.情報量とエントロピー
8.巡回符号と BCH 符号の計算法
9.群
10.環と体
11.剰余系の正則元と有限体
12.多項式環，巡回群
13.拡大体，ラグランジュの定理
14.最小多項式，連続根
15.BCH 符号と RS 符号の誤り訂正能力

grade: 3．成績の評価方法
期末試験 70％，課題（レポート）30％．

textbook: 4．教科書・参考書
事前に資料を配布する．
参考書： 「符号理論入門」 先名健一著 森北出版

note: 5．履修にあたっての注意事項
線形代数，情報数学，及び確率論の知識を前提にしているので，本講義では，これらの講義で用
いられた教科書を持参することが望ましい．

remark: ６．備考
なし．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
情報理論・符号理論における符号化の概念は，情報通信や情報記録をはじめ，暗号や情報セキュ
リティなど情報を扱う多くの分野に関係する重要な内容を含んでいる． 情報理論・符号理論の発
展を支える基盤となっている「情報代数」の基本を理解すると共に，符号理論や暗号理論の分野
を理解するための基礎知識と技術を獲得する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 白勢 政明

None
name: 人工知能基礎（Basic Artificial Intelligence）

thema: 【テーマ・目標】
人間のように知的に思考し問題解決を行う人工的システム(ロボットやプログラム)の
基本概念と問題解決手法について学ぶ．

_lecture_content: 【講義内容】
本講義では，人工知能の目標とその意義を明らかにし，基本的な問題解決手法を理解し，
応用に関して学ぶ．
問題解決手法に関しては，状態空間探索，制約充足の技法について学ぶ．
さらに，知識表現の手法に関し学び，最後に，知識を用いた問題解決システムの具体例
として知識ベースシステムとプロダクションシステムについて学ぶ．
本講義を履修することで，主に離散的で静的（もしくは準動的）な環境において，効率の
良い個別アルゴリズムが知られていない悪構造問題に対し，その問題を定式化し，適切
な問題解決手法を適用することで，解を効率よく得るための方法論の基礎について学ぶ
ことができる．

scgedule: 2．講義計画
1. 人工知能研究の概要，背景，歴史
2. 問題解決 I －状態空間探索－
（ヒューリスティック探索とゲームプレイング/問題分割）
3. 問題解決 II －制約充足－
（後戻り法，ノード制約，アーク制約，経路制約アルゴリズム）
4. 知識表現と推論
（意味ネットワーク，フレームシステム，知識表現言語，プロダクションシステム）

grade: 3．成績の評価方法
出欠，課題，中間試験および期末試験の総合的な評価による．

textbook: 4．教科書・参考書
西田豊明著:「人工知能の基礎」
，丸善

note: 5．履修にあたっての注意事項
「アルゴリズムとデータ構造」を履修していること．

remark: ６．備考

target: 対象コース 知能システム
コース専門必修
複雑系
コース専門選択

thema: 【テーマ・目標】
人間のように知的に思考し問題解決を行う人工的システム(ロボットやプログラム)の
基本概念と問題解決手法について学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 大澤 英一
松原 仁
Ian Frank

None
name: 生命情報学（Bioinformatics）

thema: 【テーマ・目標】
バイオインフォマティクスにおける生物学的知識と情報解析技術の基礎を学ぶ．

_lecture_content: 【講義内容】
生命情報学（バイオインフォマティクス）は生物学と情報学にまたがる学問領域で，DNA 配列
やタンパク質構造などのデータを解析し，新たな生物学的な知識を得ることが目的である．本講
義ではまず基礎的な生物学的な知識を学び，次に生理学的なデータを解析するためのアルゴリズ
ム及びデータベースの知識を学ぶ．本講義では，生物学的知識と情報学的アプローチを結びつけ
ることを主眼におく．

scgedule: 2．講義計画
1. はじめに
2. バイオ基礎１（DNA, RNA）
3. バイオ基礎２（タンパク質）
4. バイオ基礎３（転写，翻訳）
5. 分子生物学データベース１（DNA, RNA）
6. 分子生物学データベース２（タンパク質）
7. 数理・知識表現の基礎１
8. 数理・知識表現の基礎２
9. ゲノム解析１（配列の比較１）
10. ゲノム解析２（配列の比較２）
11. ゲノム解析３（系統樹推定１）
12. ゲノム解析４（系統樹推定２）
13. タンパク質立体構造予測
14. 細胞内ネットワーク
15. まとめ

grade: 3．成績の評価方法
講義中に行なう小テスト，課題（レポート）および定期試験の総合評価で行う．

textbook: 4．教科書・参考書
参考書：David W. Mount ，
「バイオインフォマティクス ：ゲノム配列から機能解析へ，第二
版」, MedSi(2005)
参考書：阿久津達也，
「バイオインフォマティクスの数理とアルゴリズム」
，共立出版 (2007)
参考書：.金久實，
「ポストゲノム情報への招待」
，共立出版（2001）

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
バイオインフォマティクスにおける生物学的知識と情報解析技術の基礎を学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 佐藤 直行

None
name: 力学応用（Advanced Dynamics）

thema: 【テーマ・目標】
「力学基礎」に引き続き，ニュートン力学の考え方および基礎的知識を身につける．

_lecture_content: 【講義内容】
この講義では，
「力学基礎」で学んだ内容をもとに，ニュートン力学のより発展的な内容を学ぶ．

scgedule: 2．講義計画
1 はじめに：力学基礎で学んだ内容の復習
2 万有引力（1）
：角運動量と力の能率
3 万有引力（2）
：万有引力
4 万有引力（3）
：惑星の軌道
5 相対運動（1）
：互いに並進運動をしている 2 つの座標系
6 相対運動（2）
：慣性系に対し回転している座標系から見た運動（1）
7 相対運動（3）
：慣性系に対し回転している座標系から見た運動（2）
8 中間的なまとめ
9 質点系の力学（1）
：ニュートンの運動の第 3 法則
10 質点系の力学（2）
：質点系の力学の一般論
11 質点系の力学（3）
：質点系の力学の一般論および 2 体問題
12 剛体の力学（1）
：剛体とその自由度
13 剛体の力学（2）
：剛体の静力学
14 剛体の力学（3）
：剛体の回転運動についての一般論
15 最終的なまとめ

grade: 3．成績の評価方法
期末試験を中心に，小テストと出席状況を加味して総合的に評価する．

textbook: 4．教科書・参考書
教科書：藤原邦男「物理学序論としての力学」東京大学出版会

note: 5．履修にあたっての注意事項
「力学基礎」を履修していること．

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
「力学基礎」に引き続き，ニュートン力学の考え方および基礎的知識を身につける．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 斉藤 朝輝

None
name: ＡＩプログラミング I （AI Programming I）

thema: 【テーマ・目標】
人工知能の基本的問題解決手法である状態空間探索，ゲーム木探索，問題分割，制約充足，知識
表現と推論などについてそのプログラミング技法を習得する．

_lecture_content: 【講義内容】
本講義では，
「人工知能基礎」で学ぶ状態空間探索，ゲーム木探索，問題分割探索，制約充足，知
識表現および推論などの基本問題解決手法のプログラミング技法について学び，演習を通して実
装を行う．
本講義を履修することで，主に離散的で静的な環境において，効率の良い個別アルゴリズムが知
られていない悪構造問題に対し，その問題を定式化し，適切な問題解決手法を適用することで，
効率よく解を得るための人工知能プログラミング技法の基礎について学ぶことができる．
この講義は演習が主体となる．

scgedule: 2．講義計画
第 1 回 導入
第 2 回 Window を使った application 構築の基礎
第 3 回 探索プログラム I
第 4 回 探索プログラム II
第 5 回 nQueen 探索プログラム作成
第 6 回 nQueen Window Application 作成
第 7 回 nQueen Window Application に探索プログラムを組み込む
第 8 回 ヒューリスティック探索 I
第 9 回 ヒューリスティック探索 II
第 10 回 Othello プログラムの開発 I
第 11 回 Othello プログラムの開発 II
第 12 回 Othello プログラムの開発 III
第 13 回 Othello プログラムの開発 IV
第 14 回 レポート課題
第 15 回 レポート課題

grade: 3．成績の評価方法
授業中の課題（プログラム）および期末提出の課題（プログラム＋レポート）の総合的な評価に
よる．

textbook: 4．教科書・参考書
授業資料は Web に掲載する．

note: 5．履修にあたっての注意事項
「プログラミング基礎」
，
「情報処理演習 I」および「アルゴリズムとデータ構造」を履修している
こと．また，
「人工知能基礎」と同時に履修すること．

remark: ６．備考

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
人工知能の基本的問題解決手法である状態空間探索，ゲーム木探索，問題分割，制約充足，知識
表現と推論などについてそのプログラミング技法を習得する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 村井 源

None
name: センサ工学（Sensor Engineering）

thema: 【テーマ・目標】
日常生活から社会基盤までを支えるセンサ技術について，基礎から応用までを学ぶ．

_lecture_content: 【講義内容】
センサは家電機器やスマートフォンはもちろん，自動車や建築など，日常のいたるところに
組み込まれて利用されている．この講義では，実社会でどのようなセンサが用いられているか
を概観した上で，センサはどのように対象を計測し情報を取り出しているのか，また，計測
した情報はどのように処理されているのかを実習を交えて学習する．

scgedule: 2．講義計画
1 センサの概要と測定技術 (2)
2 基礎的なセンサ(3)
光センサ，温度センサ，圧力センサ，磁気センサ，加速度センサ，超音波センサ，他
3 インタフェース回路とアクチュエータ(3)
センサ信号の増幅，伝送，AD／DA 変換，DC モーター，ステッピングモーター，
サーボモーター，他
4 高度なセンサと情報処理(4)
GPS，RFID，画像認識（画像理解，バーコード，2 次元コード）
，雑音やひずみ軽減，
時系列データ処理，パターン検出，他
5 発展技術(3)
ユビキタスコンピューティング，センサネットワーク，ヘルスケア，ライフログ，他

grade: 3．成績の評価方法
期末試験，課題（小テスト／レポート）
，出席．
単位認定は全講義回数の 3 分の 2 以上の出席と，総合点で 60 点以上を
獲得することを条件とする．

textbook: 4．教科書・参考書
特になし．講義中に適宜参考書を指示する．

note: 5．履修にあたっての注意事項
「電子工学基礎」
，
「ハードウェア基礎」
，
「情報処理演習 II」の履修を推奨する．

remark: ６．備考
特になし

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
日常生活から社会基盤までを支えるセンサ技術について，基礎から応用までを学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 和田 雅昭
塚田 浩二

None
name: データベース工学（Database Engineering）

thema: 【テーマ・目標】
データベースは，実世界をデータモデルによって抽象化することから始まる．そこで開発された理
論や技術は，各種の情報処理システムの基盤として，重要な役割を果たしている．また，データベ
ースは高度情報化社会の中核技術のひとつとなっている．データベースの設計と構築ができる基礎
的能力を習得する．
【学習目標】
データベース管理システムを用いて，小規模な関係データベースを設計，構築し，卒業研究等の
関連分野での研究に取り組めるレベルの理解を求める．

_lecture_content: 【講義内容】
目的：情報の論理構造と物理構造の違いを認識し，その違いを支える仕掛けの原理を理解するとと
もに，大量の情報を蓄積・検索・管理するシステムの設計・利用法を習得する．
内容：授業は，データモデル，概念モデリング，関係代数，データベース設計理論，データベース
管理システムなどにおけるデータベースの原理や思考方法など，その基礎への理解力を培う．
キーワード：データベース，データモデル，関係データモデル，SQL，トランザクション処理

scgedule: 2．講義計画
1. データベースシステムの基本概念
2. データモデリング
3. 関係データモデル
4. データベース設計
5. SQL
6. 物理データ格納方式
7. 問合せ処理
8. トランザクション処理，障害回復
9. データベース管理
10. データベース応用，最近のデータベース
11. データベースからの知識発見
詳細はカリキュラムによって異なるので，各コースの講義ページを参照すること．

grade: 3．成績の評価方法
カリキュラムによって異なる．
知能システム，情報デザインコースは授業参加状況，課題（レポート）
，期末試験の総合評価によ
る．それ以外のコースは，小テストを 2 割，課題（レポート）を 3 割，期末試験を 5 割を目安に
総合評価する．
小テストは講義後に毎回行い，課題（レポート）は 2～3 回行う予定である．
ただし，1)小テストの提出回数が講義回数の 3 分の 2 に満たない場合，または，2)課題(レポート)
に未提出のものがある場合は，不合格とする場合がある．

textbook: 4．教科書・参考書
教科書: 速水治夫・宮崎収兄・山崎晴明：データベース， オーム社 IT TEXT
参考書: 北川博之: データベースシステム， 情報系教科書シリーズ第 14 巻， 昭晃堂
西尾章治郎，上林弥彦，植村俊亮: データベース， オーム社
ほか，必要に応じて講義中に紹介する．

note: 5．履修にあたっての注意事項
離散数学，代数・集合論，論理・述語論理，アルゴリズムとデータ構造など，コンピュータサイエ
ンスの基礎をしっかり習得していることが望む．OS，ネットワークなどの知識も重要である．

remark: ６．備考
データベース研究は，コンピュータサイエンス・情報科学の一翼を担う重要な分野であり，対象世
界をモデル化する考え方も論理的思考の手段として重要である．
将来 SE を目指す人は必修である．

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
データベースは，実世界をデータモデルによって抽象化することから始まる．そこで開発された理
論や技術は，各種の情報処理システムの基盤として，重要な役割を果たしている．また，データベ
ースは高度情報化社会の中核技術のひとつとなっている．データベースの設計と構築ができる基礎
的能力を習得する．
【学習目標】
データベース管理システムを用いて，小規模な関係データベースを設計，構築し，卒業研究等の
関連分野での研究に取り組めるレベルの理解を求める．

annual: ２年次

semesta:  後期

unitnum: 2 単位

teacher: 角 康之

None
name: ハードウェア設計（Hardware Design）

thema: 【テーマ・目標】
ハードウェアの設計に関する考え方を理解する．

_lecture_content: 【講義内容】
ハードウェア基礎から発展した内容を扱う．この講義では，現在のプロセッサが当然のように利
用している高性能化にかかわる技術や，ディジタル論理回路の具体的な設計法，身近に存在する
コンピュータシステムである組込システムに関する技術について学ぶ．
キーワード：プロセッサアーキテクチャ，メモリアーキテクチャ，記述言語，論理設計理論

scgedule: 2．講義計画
1 パイプラインプロセッサ(3)
・パイプラインデータパス，パイプライン制御，ハザード
2 メモリシステム(3)
・キャッシュメモリ
3 同期式順序回路の設計(4)
・同期式順序回路の設計，有限状態マシンの設計，順序回路のタイミング
4 ハードウェア記述言語(5)
・ハードウェア記述言語とは，組合せ論理回路の表現，構造化，順序回路
・論理回路シミュレーション

grade: 3．成績の評価方法
単位認定は以下の条件を前提とする．
・全講義回数の 2/3 以上の出席
・すべての課題の提出
・期末試験で 60 点以上の獲得

textbook: 4．教科書・参考書
(教科書) D. ハリス，S. ハリス: ディジタル回路設計とコンピュータアーキテクチャ， 翔泳社．
この教科書は 2 年生前期に開講されるハードウェア基礎でも使用する．

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
ハードウェアの設計に関する考え方を理解する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 白勢 政明

None
name: 電気回路（Electric Circuit）

thema: 【テーマ・目標】
電気，電子回路を理解する上で前提となる交流回路理論の基礎を学ぶとともに，回路の解析方法
を習得する.また周波数特性の概念を学び，周波数応答，交流回路の解析方法，微分方程式による
解法，フーリエ変換，ラプラス変換などの回路理論的意味などを理解する．

_lecture_content: 【講義内容】
本講義では電気回路の基礎として，電流・電圧，グラフ理論などを学ぶ．次に受動素子である抵
抗，キャパシタ（コンデンサ）
，インダクタ（コイル）の電気的性質を学び，回路方程式を理解す
る．
具体的にはキルヒホッフの法則を用いた回路方程式とその解法を理解し，
，
波形伝送やディジ
タル回路内での現象の理解のために，回路の時間応答を理解すると共に，複素関数としてのイン
ピーダンス，アドミタンスの理解と周波数特性との関係の理解へと進む．最後に，回路の過渡現
象解析として，微分方程式の解法，時定数とそれを用いた微分・積分回路の構成，さらに，時間
領域の解法であるフーリエ変換，ラプラス変換を学ぶ．回路理論は通信理論，信号処理（音声処
理や画像処理）およびシステム理論などの基礎理論として使われる重要な理論である．また，機
械系などの物理現象で微分方程式で表現可能なものは，等価な回路として回路理論により代数的
に解析可能であることからロボティクスなどの解析にも有用である．

scgedule: 2．講義計画
１.電気回路基礎
-電気回路と回路図
-グラフ理論
-電圧，電流
-交流回路解析
-交流電流・電圧の実効値
２.抵抗，キャパシタ，インダクタ
３.回路の定常状態と過渡状態
-回路方程式の微分方程式
-一般解，定常解，過渡解
4.回路解析のための基本法則
-オームの法則，キルヒホッフの法則
-接点解析，ループ解析
-重ね合わせの理
５．正弦波交流回路
-RLC 直列，並列回路
-共振周波数
６．正弦波交流回路の複素表示
-複素数
-複素インピーダンス
７．テブナンの定理
８．回路応答の過渡現象
-RL,RC 回路の過渡現象解析
-時定数，微分・積分回路
-フーリエ変換
-ラプラス変換

grade: 3．成績の評価方法
本科目の評価は，授業中の小テスト，課題レポート，中間試験，期末試験で決定する．基本的に
は中間試験，期末試験にて 8 割，小テスト，課題レポートにて 2 割の配分とする．

textbook: 4．教科書・参考書
教科書：基本から学ぶ電気回路 藤居信生著 電気学会 オーム社
参考書：電気回路教本 秋月影雄監修，橋本洋司著 オーム社

note: 5．履修にあたっての注意事項
数学（線形代数，解析学，微分方程式）および物理の基礎科目（電子工学基礎など）を履修して
いることが望ましい．

remark: ６．備考

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
電気，電子回路を理解する上で前提となる交流回路理論の基礎を学ぶとともに，回路の解析方法
を習得する.また周波数特性の概念を学び，周波数応答，交流回路の解析方法，微分方程式による
解法，フーリエ変換，ラプラス変換などの回路理論的意味などを理解する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 藤野 雄一

None
name: 認知心理学（Introduction to Cognitive Psychology）

thema: 【テーマ・目標】
認知心理学の基本的な問題について学ぶとともに，その研究方法の基礎を習得する．

_lecture_content: 【講義内容】
認知心理学で扱う諸問題について解説するとともに，基礎的な研究方法についての講義を行う．
認知心理学は，人間の認知過程を，目に見える行動の系統だった観察から出発して，科学的に解
明しようとする学問であり，人工知能，ロボティクス，脳科学などとも隣接している．また，人
間の行為の基礎にある暗黙知を認知心理学的に明らかにすることは，ヒューマンインターフェイ
スへの応用にもつながる． 本講義では，認知心理学の基本的な問題について学ぶとともに，実験
で得られたデータを分析するために統計法の基礎についても学習する．
キーワード: 知覚，行為，視覚，言語，学習，認知過程，ヒューマンインターフェイス，ロボテ
ィクス，統計的手法
keywords: perception, behavior, vision, language, learning, cognitive process, human
interface, robotics, statistical method

scgedule: 2．講義計画
実験で得られたデータを分析するために統計法の基礎についても学習する．
1. 認知心理学と研究計画法と統計法の関係
2. 認知心理学の歴史と未来大で学ぶ意味
3. 平均値と標準偏差
4. 正規分布と標準化
5. 相関
6. 統計的仮説検定
7. t 検定(1)
8. t 検定(2)
9. 視覚認知
10. 聴覚による認知（音の性質）
11. 聴覚による認知（外界の認知）
12. カテゴリー化・知識の表象と構造
13. 言語とコミュニケーション
14. 認知心理学講義のまとめ

grade: 3．成績の評価方法
授業時間中の小課題，レポートおよび期末試験により評価する．

textbook: 4．教科書・参考書
教科書 箱田裕司ほか 認知心理学 有斐閣
教科書 山内光哉 心理・教育のための統計法 第 3 版 サイエンス社

note: 5．履修にあたっての注意事項
「認知心理学演習」と同時に履修すること．
「確率・統計学」の知識に基礎をおくが，未履修でも受講可能とする．
教科書は，卒業研究の際に役立つ場合も多いので，必ず購入すること．

remark: ６．備考
なし．

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
認知心理学の基本的な問題について学ぶとともに，その研究方法の基礎を習得する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 美馬 のゆり
中田 隆行
伊藤 精英
花田 光彦
南部 美砂子

None
name: 認知心理学演習（Seminars in Cognitive Psychology）

thema: 【テーマ・目標】
認知過程の記述方法・推定方法の実際を，実験中心に体験的に学ぶ．

_lecture_content: 【講義内容】
認知心理学で扱ういくつかの基本的なトピックスを体験しながら，実験的手法の考え方および観
察法などの技法を学ぶ．
「認知心理学」
の講義と対応しながら統計的手法についても学び，
ここで
は実際のデータ分析に適用し，科学的に根拠のある結論を導く方法の習得をめざす．同時に，実
験レポートの書き方も習得する．
キーワード: 実験手法，観察，測定，データ分析，統計的手法，相互行為分析
keywords: experiment technique, observation, measurement, data analysis, statistical
method, interaction analysis

scgedule: 2．講義計画
下記のテーマについて 2 ないし 3 週ずつの演習をおこない，
解説を加え，
テーマごとにレポート
を提出する．必要に応じ，統計法を実際に使ってのデータ分析が求められる．
1. 解説：実験の行い方・心得
2. 解説：実験レポートの書き方
3. テーマ 1：両眼立体視 解説と実験
4. テーマ 1：両眼立体視 解説と実験
5. テーマ 2：重量弁別 解説と実験
6. テーマ 2：重量弁別 解説と実験
7. テーマ 2：重量弁別 解説と実験
8. テーマ 3：音楽の知覚・認知 解説と実験
9. テーマ 3：音楽の知覚・認知 解説と実験
10. テーマ 4：相互行為分析 解説と実験
11. テーマ 4：相互行為分析 解説と実験
12. テーマ 4：相互行為分析 解説と実験
13 レポートの.ピアレビュー
14. 解説：レポートの講評・ディスカッション

grade: 3．成績の評価方法
レポートにより評価する．すべてのテーマにおいて，データ収集に参加しかつレポートを提出す
ることが，単位認定の要件となる．

textbook: 4．教科書・参考書
教科書：なし
参考書：心理学実験指導会編 実験とテスト 心理学の基礎 実習編・解説編 培風館

note: 5．履修にあたっての注意事項
「認知心理学」と同時に履修すること．

remark: ６．備考
実験は割り当てられたグループで実施する．場合によっては，実験が演習時間内に終わらないこ
ともあるので，演習時間の後の予定には注意が必要．

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
認知過程の記述方法・推定方法の実際を，実験中心に体験的に学ぶ．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 美馬 のゆり
中田 隆行
伊藤 精英
花田 光彦
南部 美砂子

None
name: 微分方程式（Differential Equations）

thema: 【テーマ・目標】
微分方程式の考え方を学び，微分方程式の初等解法とその応用を習得する．

_lecture_content: 【講義内容】
私たちの暮らす実世界では，日々，物理現象，自然現象，社会現象，経済現象など時間的に変化
する様々な現象が起こっている．そうした時間変化する現象を表現し工学的に応用するときに微
分方程式が用いられる．
本講義では，
常微分方程式を中心に，
「微分方程式」
の考え方について学び初等解法を習得するこ
とを目的とする．いくつかの基本的な解法を身に付け，微分方程式の形に応じた解法を選択，利
用するための能力を養う．
キーワード：常微分方程式，線形微分方程式，一般解と特殊解，モデル化

scgedule: 2．講義計画
以下の項目について演習を交えつつ数回ずつ講義を行う．
1. 微分方程式とは？
2. 1 階微分方程式の解法
２-1 変数分離系の方程式の解法
2-2 1 階線形微分方程式の解法
3. 2 階微分方程式の解法
3-1 2 階線形同次微分方程式の解法
3-2 2 階線形非同次微分方程式の解法
4. 微分方程式によるモデル化と応用

grade: 3．成績の評価方法
課題（演習）の提出状況と中間試験の結果を加味しつつ，期末試験の結果に基づいて評価する．

textbook: 4．教科書・参考書
教科書： 石村園子著，
「やさしく学べる微分方程式」
，共立出版

note: 5．履修にあたっての注意事項
講義は微分・積分の基礎を習得していることを前提に行う．

remark: ６．備考
本科目は「センサ工学」
「制御理論」
「ロボティクス」の履修に向けて必要とされる科目である．

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
微分方程式の考え方を学び，微分方程式の初等解法とその応用を習得する．

annual: 2 年次

semesta:  後期

unitnum: 2 単位

teacher: 鈴木 昭二

None
name: パターン認識（Pattern Recognition）

thema: 【テーマ・目標】
画像処理や音声処理などの基礎となるパターン認識について学ぶ．

_lecture_content: 【講義内容】
コンピュータでパターンを「認識」するためにはさまざまな処理が必要である．まず外界の情報
をコンピュータに取り込み，基本的な処理を施した上で特徴を抽出する．さらに抽出した特徴に
クラスタリングという処理を施して分別する．そのように多くの段階を経てようやくパターンと
呼ばれるものが出現することになる．この講義では画像や音声を例にして具体的にどのような処
理でパターン認識を行なうかについて学ぶ．

scgedule: 2．講義計画
次の順番で行なう．
1: パタン認識入門
2: 基本的な前処理
3: 特徴抽出
4: クラスタリング基礎
5: クラスタリング応用

grade: 3．成績の評価方法
期末試験，及び出席状況とレポートの提出により総合的に評価する

textbook: 4．教科書・参考書
参考書：授業のときに指定する．

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
知能システム
コース専門選択

thema: 【テーマ・目標】
画像処理や音声処理などの基礎となるパターン認識について学ぶ．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 加藤 浩仁

None
name: オペレーティングシステム（Operating Systems）

thema: 【テーマ・目標】
オペレーティングシステムを構成する主要技術を理解する．

_lecture_content: 【講義内容】
オペレーティングシステムの存在意義を理解し，計算機資源の管理方法について学ぶ．プロセス
管理，入出力機器の管理，メモリ管理，セキュリティ管理について具体的に説明する．また，自
分が必要とするシステムを構築するのに適したオペレーティングシステムを選択できる素養を身
に付ける．
キーワード： ファイルシステム，I/O 管理，プロセス管理，スケジューリング，記憶管理

scgedule: 2．講義計画
1. オペレーティングシステムの概要，役割，位置づけ，必要性 (2 回)
2. プロセス (2 回)
3. メモリ管理 (2 回)
4. ファイルシステム (2 回)
5. 入出力 (2 回)
6. デッドロック(1 回)
7. セキュリティ (1 回)
8. Linux 等の OS について(2 回)
9. 演習(2 回)
※括弧内は授業回数の目安

grade: 3．成績の評価方法
評価方法はクラスにより異なる．
EFJKL クラス: 課題（各回の授業内容を確認する設問）および期末試験を総合して評価する．
ＧＨＩクラス:毎回行う練習課題，課題（レポート）
，期末試験の成績から総合的に決定する.

textbook: 4．教科書・参考書
教科書：未来へつなぐデジタルシリーズ 25 オペレーティングシステム，菱田隆彰，寺西裕一，
峰野博史，水野忠則著，共立出版
参考書：情報処理入門コース 2 オペレーティングシステム，清水謙多郎著 岩波書店
参考書：OS の基礎と応用 設計から実装，DOS から分散 OS Amoeba まで，.S.Tanenbaum
著引地信之，引地美恵子訳，株式会社ピアソンエデュケーション

note: 5．履修にあたっての注意事項
1 回目の講義で履修についての注意を行うので必ず出席すること

remark: ６．備考

target: 対象コース 複雑系
コース専門必修
知能システム
コース専門選択

thema: 【テーマ・目標】
オペレーティングシステムを構成する主要技術を理解する．

annual: ３年次

semesta:  前期

unitnum: 2 単位

teacher: 高橋 信行
松原 克弥

None
name: ゲーム理論（Game Theory）

thema: 【テーマ・目標】
ゲーム理論の基礎を理解する

_lecture_content: 【講義内容】
経済や社会は多数の人々や企業が互いに戦略的行動する
「ゲーム」
の様相を呈している．
この
「ゲ
ーム」の構造を分析し行動の指針を与えてくれるのがゲーム理論である．ゲーム理論は，複雑な
経済・社会関係を分析するには既存の数学では不十分だとして，偉大な数学者フォン・ノイマン
が生み出したものである．ゲーム理論の発明以降 50 年が経過した現代，ゲーム理論抜きでは社
会科学は語れない．この講義では，ゲーム理論の中心概念であるナッシュ均衡を中心として，さ
まざまな経済・社会問題を取り上げ，ゲーム理論による分析能力を身に付けていってもらう．特
に，社会のルールを新たにデザインするマーケット・デザインの領域を中心に講義する．その際，
各種の不可能性定理の紹介も行う．

scgedule: 2．講義計画
1. ゲーム理論とは
2. ゲーム理論の歴史
3. 戦略形ゲーム
4. 支配戦略
5. ナッシュ均衡
6. 展開形ゲーム
7. 混合戦略
8. 相関均衡
9. 繰り返しゲームと進化ゲーム
10. マーケット・デザイン
11. 単一財のオークション
12. 複数財のオークション
13. 投票理論
14. 不可能性定理
15. マッチング理論

grade: 3．成績の評価方法
出席点と期末試験による．成績は，出席点を約 3 割，期末試験を約 7 割の比率で評価して決定す
る．

textbook: 4．教科書・参考書
教科書：
川越敏司著，
『はじめてのゲーム理論』
，講談社ブルーバックス
川越敏司著，
『マーケット・デザイン オークションとマッチングの経済学』
，講談社選書メチエ
参考書：
川越敏司著，
『行動ゲーム理論入門』
，NTT 出版
川越敏司著，
『実験経済学』
，東京大学出版会

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
ゲーム理論の基礎を理解する

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 川越 敏司

None
name: システムと微分方程式続論（Advanced System and Differential Equation）

thema: 【テーマ・目標】
単独ではない微分方程式系を対象に，そのモデリングや解析手法を学ぶ．

_lecture_content: 【講義内容】
２×２の系を用いて，より大きな系を組織的に解析する手法を学ぶ．

scgedule: 2．講義計画
１．数理モデルからの導入
２ー７．相平面解析続論
8．前半のまとめと中間試験
9－１２．安定性理論
13ー14． 非線形系
15．後半のまとめ．

grade: 3．成績の評価方法
中間試験，期末試験により総合的に評価する．当該年度の進行状況に応じて課題（レポートや小
テスト）を課した場合には，それらも成績評価の対象とする．ただし，これらの比率は受講状況
によって決定され，授業内で受講生に通知される．

textbook: 4．教科書・参考書
システムと微分方程式の教科書と同一の教科書を用いる．
村上温夫『微分方程式入門』基礎数学叢書 10，新曜社（1997）
，ISBN : 4-7885-0617-3，
定価 2,000 円

note: 5．履修にあたっての注意事項
線形代数学Ⅰ・Ⅱ，解析学Ⅰ・Ⅱ，システム数学基礎，システムと微分方程式の知識が融合され
る．
「非線形力学」
（複雑系科学コース（Ｈ16～21 年入学）必修）は，本科目で読み替える．

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
単独ではない微分方程式系を対象に，そのモデリングや解析手法を学ぶ．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 高村 博之

None
name: 情報ネットワーク（Network of Information）

thema: 【テーマ・目標】
インターネットを支える各種ネットワーク技術について，その概要を理解する．

_lecture_content: 【講義内容】
現代のネットワーク社会を支えるインターネットは，現在社会インフラとしての地位を確固たる
ものとしつつある．本講義では，通信技術の基本的な原理からインターネットを初めとする各種
情報ネットワークの現状に至るまでを網羅的に学ぶ．インターネット上で提供されている種々の
サービスとその背景にある通信ネットワーク，各種プロトコルなどについての紹介を通じて，イ
ンターネット上で利用可能な各種の技術とネットワークに関する理解を深める．

scgedule: 2．講義計画
第 1 回 イントロダクション
第 2 回 ネットワークアーキテクチャとインターネット
第 3 回 インターネット構成要素
第 4 回 名前とアドレス，標準化
第 5 回 OSI 参照モデル
第 6 回 TCP/IP プロトコル群
第 7 回 各種通信プロトコル
第 8 回 www サービス
第 9 回 電子メールサービス
第 10 回 その他のネットワークサービス
第 11 回 広域ネットワーク
第 12 回 無線ネットワーク
第 13 回 モバイル/ユビキタスネットワーク
第 14 回 応用事例
第 15 回 まとめ

grade: 3．成績の評価方法
成績は期末試験と課題レポートの総合評価により行う．

textbook: 4．教科書・参考書
教科書：コンピュータネットワーク概論
（未来へつなぐデジタルシリーズ 27）
，
水野忠則等
（著）
，
共立出版

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
授業で使用する補足説明資料は，事前に公開する．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
インターネットを支える各種ネットワーク技術について，その概要を理解する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 稲村 浩

None
name: 信号処理基礎（Fundamental Signal Analysis）

thema: 【テーマ・目標】
Basic ideas and applications in signal processing: traditional methods of analysis

_lecture_content: 【講義内容】
The course introduces basic ideas of signal analysis used for image and signal
processing in various fields, including mechanical engineering, electronics, economy,
biophisics, and astrophysics. It includes two main parts.
Part 1. Time-frequency analysis of signals.
Part 2. Statistical analysis of signals.

scgedule: 2．講義計画
1. Introduction to signal processing. Definition of signal, its amplitude and phase
characteristics.
2. Principal types of signals used in communication and broadcasting systems.
3. Approximating functions with polynomials and harmonic functions. Fourier series.
4. Continuous Fourier transform. Fourier integral.
5. Classification of systems: Linear vs. nonlinear, deterministic vs. stochastic.
Frequency response (transfer) function. Impulse response function.
6. Linear oscillator: an example of linear system.
7. Filtering and convolution. Analogue filters. High-pass, low-pass, and band-pass
filters.
8. Statistical analysis of signals. Mean value, median, dispersion, histogram. Higher
moments.
9. Statistical tests: Student's t-test, F-test, Chi-square test, Kolmogorov-Smirnov
test.
10. Moving average and autoregressive filters.
11-15. Software. GNU Data Language (GDL) installation and training.
{http://gnudatalanguage.sourceforge.net/}

grade: 3．成績の評価方法
Attendance of lectures, homework reports, data analysis project.

textbook: 4．教科書・参考書
1) The Scientist and Engineer's Guide to Digital Signal Processing. S. W. Smith,
California
Technical Publishing, ISBN 0-9660176-3-3 (1997)
{http://www.dspguide.com/pdfbook.htm}
2) 電子情報通信学会知識データベース 1 群 9 編 ディジタル信号処理
{http://www.ieice-hbkb.org/portal/doc_571.html}

note: 5．履修にあたっての注意事項
Necessary: Analysis I,II; Linear Algebra I,II; Algorithms and data structures, Probability
and Statistics.

remark: ６．備考
{http://portal.fun.ac.jp/~riabov/Signal_Processing/ }

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
Basic ideas and applications in signal processing: traditional methods of analysis

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: V. Riabov

None
name: 数値解析（Numerical Analysis）

thema: 【テーマ・目標】
コンピュータを用いた数値計算に必要な基礎知識を学ぶ．

_lecture_content: 【講義内容】
数値計算とは，方程式の解にできるだけ近い解（近似解）を計算することである．複雑な現象を
モデル化した方程式は，紙と鉛筆だけでは解けない場合が多い．そのため，コンピュータを用い
た数値計算は必要不可欠であり，複雑系科学において重要な道具である．本講義では，数値計算
を支える理論と具体的な計算方法を理解することを目標とする．

scgedule: 2．講義計画
1. イントロダクション（1 週）
2. 数値の表現と誤差 （2～4 週）
3. 連立 1 次方程式 （5～6 週）
ガウスの消去法，ガウス・ザイデル法
4. 非線形方程式 （7～9 週）
2 分法，ニュートン法
5. 補間（10 週）
ラグランジュ補間
6. 数値積分 （11～12 週）
台形則，ガウス型積分公式
7. 常微分方程式の初期値問題 （13～14 週）
オイラー法，ルンゲ・クッタ法
8. その他の発展事項の紹介（15 週）

grade: 3．成績の評価方法
中間試験，期末試験，レポートから総合評価する．これらの比率は受講状況によって決定され，
授業内で受講生に通知される．

textbook: 4．教科書・参考書
教科書に関しては，別途授業時に指示を行う．
参考書として以下をあげておく．
山本哲朗 「数値解析入門」 サイエンス社
齊藤宣一 「数値解析入門」 東京大学出版会

note: 5．履修にあたっての注意事項
解析学，線形代数学，微分方程式などを前提とする．

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
コンピュータを用いた数値計算に必要な基礎知識を学ぶ．

annual: ３年次

semesta:  前期

unitnum: 2 単位

teacher: 鈴木 恵二

None
name: 生命科学と複雑系（Life Science and Complex Systems）

thema: 【テーマ・目標】
生命科学や生物システムにおける動力学の基礎知識を習得する．

_lecture_content: 【講義内容】
生物はミクロな分子の集積として成り立っている．それらの分子の相互作用は極めて複雑な
問題である．本講義では生物とその運動の成り立ちを分子のレベルからとらえ，特にタンパ
ク質の構造と動力学を中心に学ぶ．その時必要になる知識として，熱力学や非平衡系の物理
についても学ぶ．最後にそれらの知識を基に多角的に生命システムを考察し，生命システム
論としてまとめる．

scgedule: 2．講義計画
1. 序論「生命とは何か？」
2. 熱力学と生命
3. エネルギー変換とエントロピー
4. 微分方程式とポピュレーションダイナミクス
5. 反応速度論
6. 自己触媒とハイパーサイクル
7. 非線形振動子と協同現象
8. 非平衡科学と散逸構造
9. モータータンパク質
10. 1 分子科学とナノの世界
11. 生命システム論（哲学と歴史）
12. 生命システム論（共創と創発）
13. 生命システム論（自律性）
14. 生命システム論（起源と進化）
15. まとめと期末試験

grade: 3．成績の評価方法
期末試験 50%，課題（レポート）50%により評価する．

textbook: 4．教科書・参考書
なし

note: 5．履修にあたっての注意事項
生命情報学と生物物理の基礎を履修していることが望ましい．

remark: ６．備考
なし

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
生命科学や生物システムにおける動力学の基礎知識を習得する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 櫻沢 繁

None
name: 複雑系計算論（Complex Computation Theory）

thema: 【テーマ・目標】
コンピュータサイエンス，情報学の基盤である「計算理論」の基礎について学ぶ．

_lecture_content: 【講義内容】
計算やアルゴリズムという直感的な概念を定式化するために，20 世紀の初めに様々な計算のモ
デルが提案された．異なる方針によってモデル化されたにもかかわらず，これらのモデルは同一
の計算可能性を定義する．現在では，これらのモデルが共通して定める計算の概念が，計算の定
式化として広く受け入れられている．その一方で，この定式化を通して，万能な計算モデルには
計算不可能な問題が必然的に存在することも示された．この講義では，
（1）このような計算可能
性の理論を理解し，
（2）計算困難な最適化問題や新しい計算モデルなど先進的な話題を取り上げ
るなかで計算論の理解をさらに深める，ことを目的とする.

scgedule: 2．講義計画
1. 計算理論のための概念・用語
2. オートマトンと言語
2.1 有限オートマトン
2.2 文脈自由言語
3. 計算可能性
3.1 チューリング機械
3.2 万能チューリング機械
3.3 万能チューリング機械の限界
4. 計算の複雑さ
4.1 時間計算量
4.2 クラスＰ，クラスＮＰ
4.3 ＮＰ完全問題
4.4 近似アルゴリズム
5. 確率的近似学習
5.1 確率的近似学習(PAC)モデル
5.2 PAC 学習とブースティング

grade: 3．成績の評価方法
期末試験で行う．

textbook: 4．教科書・参考書
教科書： 開講時に指示する．
参考書： 「計算理論とオートマトン言語理論」 丸岡 章 サイエンス社
「計算論的学習」 榊原康文，小林聡， 横森貴 培風館
「計算理論の基礎」 Michael Sipser 著 渡辺・太田・監訳 共立出版 2000 年
「オートマトン・言語と計算理論」岩間一雄著（電子情報通信学会）コロナ社

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
コンピュータサイエンス，情報学の基盤である「計算理論」の基礎について学ぶ．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 竹之内 高志

None
name: ヒューマンインタフェース（Human Interface）

thema: 【テーマ・目標】
人間と機器システムとの自然な対話を実現するための設計手法を理解する．

_lecture_content: 【講義内容】
ヒューマンインタフェース（HI）は，認知科学，情報工学，デザインの領域からなる学際的な研
究領域である．ヒューマンインタフェースの具体的な探究課題は各領域にまたがり，コンピュー
タの画面表示や入力方式だけでなく，家電製品や駅の券売機などの公共機器の設計も含まれる．
この講義では，
人間と機器システムとの自然な対話を実現するために，
人間の認知特性を理解し，
人間のためのシステム設計とその評価手法などを学ぶ．具体的には，現状の問題認識から改善案
の展開，およびその評価検証まで，製品開発プロセスに沿って一連の講義を行う．
キーワード：インタフェース設計，インタフェースデザイン，認知，評価

scgedule: 2．講義計画
1. ヒューマンインタフェースの全体概念（1）
2. ヒューマンインタフェースの全体概念（2）
3. ユーザの認知特性（1）
4. ユーザの認知特性（2）
5. ユーザの認知特性（3）
6. ヒューマンインタフェースの設計方法（1）
7. ヒューマンインタフェースの設計方法（2）
8. ヒューマンインタフェースの評価方法（1）
9. ヒューマンインタフェースの評価方法（2）
10.ヒューマンインタフェースの評価方法（3）
11.ヒューマンインタフェース設計の現況
12.インタラクティブシステムの実現（1）
13.インタラクティブシステムの実現（2）
14.インタラクティブシステムの実現（3）
15.まとめ

grade: 3．成績の評価方法
単位認定は,期末試験の点数と出席状況を等しく重んじ,総合的に判断する.

textbook: 4．教科書・参考書
教科書はなし．
参考書は講義時に適宜推薦する．

note: 5．履修にあたっての注意事項
「認知心理学」を履修していることが望ましい．

remark: ６．備考

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
人間と機器システムとの自然な対話を実現するための設計手法を理解する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 安井 重哉
竹川 佳成
角 康之
南部 美砂子

None
name: 画像工学（Image Processing Technology）

thema: 【テーマ・目標】
画像情報処理システムについて，その概要と特徴を理解する．

_lecture_content: 【講義内容】
空間に分布した情報の視覚的表現が画像である．
本講義では，人間の視覚処理系をコンピュータで実現するための画像処理システムについて，そ
の原理と手法（画像を取り扱うための基礎技術）を解説する．
外界の環境をコンピュータに取り込むための画像センシング手法からはじまり，画像補正や画質
改善，さらに画像認識・理解を目的とした画像解析手法に至るまでを説明する．また，画像処理
技術を用いた応用事例に関しても随時紹介する．必要に応じて画像や映像を認識および理解する
ための認識アルゴリズムについて演習を交えながら講義を進める．

scgedule: 2．講義計画
第 1 部 画像処理技術の基礎(2 回)
画像処理技術の導入として，画像入出力装置，人間の視覚特性などについて説明する．
第 2 部 画像処理の基本手法
画像処理技術の基本的な手法を紹介する．大きくは以下の 2 つに分類される．
2 - 1. 画像の前処理（4 回）
解析，認識処理を容易にする，あるいは画像を見やすくするための前処理技術として，ノイズ
除去，幾何や濃度の補正などを理解する．
2 - 2. 特徴抽出（5 回）
ラベリングやハフ変換等，画像中に含まれる特徴を抽出するための処理について説明する．
第 3 部 画像認識技術（4 回）
テンプレートマッチング等，
パターンに基づいて画像を判別・分類する処理について説明する．

grade: 3．成績の評価方法
単位認定は
・全ての課題（レポート（プログラム及びその説明，実行結果の考察）＋オンラインテスト）が
提出されていること
・期末試験で 60 点以上獲得すること
を前提とする．成績は定期試験により行う．

textbook: 4．教科書・参考書
教科書：後日指定する．

note: 5．履修にあたっての注意事項
原則として「プログラミング基礎」
，
「線形代数学」を履修していること．

remark: ６．備考
なし．

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
画像情報処理システムについて，その概要と特徴を理解する．

annual: ３年次

semesta:  前期

unitnum: 2 単位

teacher: 長崎 健

None
name: 自律システム（Autonomous Systems）

thema: 【テーマ・目標】
The key feature of autonomous systems is that they can observe and react to
changes in their environment without requiring external instruction. This course
examines the technology necessary to produce such behaviour.

_lecture_content: 【講義内容】
We will start with the definition of an 'agent', and then examine four basic types of
agent:
1) Reflex agents; agents that just respond to simple stimuli in the environment
2) Reflex agents with state; the next stage of complexity. Actions are still reflex, but
can be based on past information
3) Goal-based agents; the agents now have goals that they explicitly try to achieve
4) Utility-based agents; how multiple goals can be balanced at once through the
concept of utility.
For actual practice, students will work on developing agents in a complex domain:
the "Carnage Heart EZ" game, played on PSPs.

scgedule: 2．講義計画
After an overview, we will tackle the different types of agent in order. A key concept
will be the notion of "rationality" which will allow us to talk meaningfully about the
notion of whether an agent is actually acting in its own self-interest.
The lectures will be accompanied with work on a practical implementation, using the
Carnage Heart EZ domain. The class has a number of PSPs with this game installed
for groups of students to borrow. It helps if students have an idea of who they want
to work with. It also helps if students with PSPs can use their own machines for
playing the game.
To study uncertainty, we will look at the Bayes' Networks (first studied in other AI
courses) and then at Bayes' Decision Networks (BDNs) and Dynamic Bayes'
Networks (DBNs). We will investigate these with the Netica system. This works up to
a beautiful algorithm for controlling an autonomous agent in real time.

grade: 3．成績の評価方法
Evaluation will be based on attendance and seven or eight weekly homeworks, plus
performance in a final Carnage Heart EZ contest, and its associated report.

textbook: 4．教科書・参考書
Appropriate papers and background material will be distributed in class.

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
The key feature of autonomous systems is that they can observe and react to
changes in their environment without requiring external instruction. This course
examines the technology necessary to produce such behaviour.

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: Ian Frank

None
name: 情報ネットワーク（Network of Information）

thema: 【テーマ・目標】
インターネットを支える各種ネットワーク技術について，その概要を理解する．

_lecture_content: 【講義内容】
現代のネットワーク社会を支えるインターネットは，現在社会インフラとしての地位を確固たる
ものとしつつある．本講義では，通信技術の基本的な原理からインターネットを初めとする各種
情報ネットワークの現状に至るまでを網羅的に学ぶ．インターネット上で提供されている種々の
サービスとその背景にある通信ネットワーク，各種プロトコルなどについての紹介を通じて，イ
ンターネット上で利用可能な各種の技術とネットワークに関する理解を深める．

scgedule: 2．講義計画
第 1 回 イントロダクション
第 2 回 ネットワークアーキテクチャとインターネット
第 3 回 インターネット構成要素
第 4 回 名前とアドレス，標準化
第 5 回 OSI 参照モデル
第 6 回 TCP/IP プロトコル群
第 7 回 各種通信プロトコル
第 8 回 www サービス
第 9 回 電子メールサービス
第 10 回 その他のネットワークサービス
第 11 回 広域ネットワーク
第 12 回 無線ネットワーク
第 13 回 モバイル/ユビキタスネットワーク
第 14 回 応用事例
第 15 回 まとめ

grade: 3．成績の評価方法
成績は期末試験と課題レポートの総合評価により行う．

textbook: 4．教科書・参考書
教科書：コンピュータネットワーク概論
（未来へつなぐデジタルシリーズ 27）
，
水野忠則等
（著）
，
共立出版

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
授業で使用する補足説明資料は，事前に公開する．

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
インターネットを支える各種ネットワーク技術について，その概要を理解する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 白石 陽

None
name: 人工知能続論（Advanced Theory of Artificial Intelligence）

thema: 【テーマ・目標】
「人工知能基礎」の講義を踏まえて，知的に柔軟に思考し問題解決を行う人工システムの実現方
法に関し，さらに発展的な話題について学ぶ．

_lecture_content: 【講義内容】
本講義では，数理論理学に基づく形式的な問題解決の手法，論理プログラムによる問題解決とそ
の計算原理，不確実な知識を用いた問題解決の手法，そして機械学習に関する基本手法について
学ぶ．本講義を履修することで，論理プログラムによる問題解決システムの構築方法，不確実性
を含む知識の表現方法とそれに基づく推論手法，そしてシステム自ら知識を獲得するための機械
学習の基本的手法について学ぶことができる．これらにより，人間の思考をモデル化し，それに
より複雑な問題に対して知的で柔軟な解決を行うシステムを設計することができるようになる．

scgedule: 2．講義計画
1. 命題論理(3 回)
2. 述語論理(5 回)
3. 不確実な知識と推論(3 回)
4. 機械学習(4 回)

grade: 3．成績の評価方法
課題，期末試験の総合的な評価による．
課題と試験の成績配分は以下の通り．
課題: 30%
期末試験: 70%

textbook: 4．教科書・参考書
西田豊明著:「人工知能の基礎」
，丸善

note: 5．履修にあたっての注意事項
「人工知能基礎」を履修していること．

remark: ６．備考

target: 対象コース 知能システム
コース専門必修

thema: 【テーマ・目標】
「人工知能基礎」の講義を踏まえて，知的に柔軟に思考し問題解決を行う人工システムの実現方
法に関し，さらに発展的な話題について学ぶ．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 大澤 英一

None
name: 制御理論（Control Theory）

thema: 【テーマ・目標】
フィードバック制御の基礎

_lecture_content: 【講義内容】
自動制御は，エアコンの温度調整や自動車の ABS など日常的に使用する機器の中に組み込まれ
ており，
ロボットの動作など高機能の機器の動きを実現する上でも欠かせない． 本講義では， 自
動制御の基本的な理論体系である古典制御理論に即して，一入力一出力系のフィードバック制御
を対象に自動制御の基礎を学習する．特に，伝達関数，応答，安定性などの制御における基礎概
念について学ぶとともに，微分方程式やラプラス変換を用いることでこれらの基礎概念と物理的
な現象とが数式により結びつけられることについて理解を深める．
キーワード：自動制御，フィードバック制御，伝達関数，応答

scgedule: 2．講義計画
下記の項目について講義を行なう．
1. 微分方程式と制御対象のモデル化
2. ラプラス変換
3. 伝達関数
4. ブロック線図
5. 過渡応答
6. 定常応答
7. 周波数応答
8. 安定性
9. フィードバック制御系の設計

grade: 3．成績の評価方法
中間試験の結果を加味しつつ期末試験の結果に基づいて評価する．

textbook: 4．教科書・参考書
江口弘文著，
「初めて学ぶ PID 制御の基礎」
，東京電機大学出版局

note: 5．履修にあたっての注意事項

remark: ６．備考
なし．

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
フィードバック制御の基礎

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 鈴木 昭二

None
name: 認知システム論（Cognitive Systems）

thema: 【テーマ・目標】
音楽と言語とイメージに関わる研究成果をもとに，認知システム，感情システム，そして認知シ
ステムと感情システムの間の相互作用について学習する．

_lecture_content: 【講義内容】
本講では，主に音楽と言語に関わる認知心理学，認知科学，そして認知神経科学領域の研究成果
をもとに，認知システム，感情システム，そして認知システムと感情システムの間の相互作用に
ついて学ぶ．講義の他にもグループ討論と口頭発表，実験用音刺激の作成とデータ分析，そして
レポートを作成する過程から理解を深める．

scgedule: 2．講義計画
1. 「認知システム論」についてのオリエンテーション
2. 認知システムとは
3-4. 認知システムとしての言語知覚と音楽知覚（グループ討論と口頭発表）
5-6. 音楽と認知発達（研究テーマの発表）
7. 試験（中間）
，音楽的特性が信号検出精度に与える特性についての実験：音刺激作成について
の説明
8-9. 研究成果の口頭発表
10. 実験
11. 実験データの分析
12. 音楽の進化論的分析
13. 脳の構造
14. 脳の構築
15. 試験（2 回目）
，総括

grade: 3．成績の評価方法
単位認定は全講義回数の 2/3 以上の出席を前提とする．小テスト，試験（2 回）
，レポートから
最終成績を算出する．

textbook: 4．教科書・参考書
参考書は以下を含む
･スティーブン・ミズン（著）熊谷淳子（訳）2006 歌うネアンデルタール 早川書房
･ジョセフ・ルドゥー，森憲作（監）
・谷垣暁美(訳） (2002). シナプスが人格をつくる みすず
書房
･ダニエル・レヴィティン（著）西田美緒子（訳）(2010). 音楽好きな脳ー人はなぜ音楽に夢中
になるのか 白揚社

note: 5．履修にあたっての注意事項
「認知心理学」
，
「認知心理学演習」を履修していること．
20 分以上の遅刻は欠席とみなす．

remark: ６．備考
なし．

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
音楽と言語とイメージに関わる研究成果をもとに，認知システム，感情システム，そして認知シ
ステムと感情システムの間の相互作用について学習する．

annual: 3 年次

semesta:  前期

unitnum: 2 単位

teacher: 中田 隆行

None
name: オペレーションズリサーチ（Operations Research）

thema: 【テーマ・目標】
オペレーションズリサーチ（ＯＲ）とは，現実社会のシステムにおける様々な問題の解決や戦略
立案などのために，
数学的なアプローチにより合理的な意思決定方法を導くための方法論である．
本講義ではＯＲへの入門として，
実問題の数理モデル化や数理計画法の基本手法の学習を通じて，
科学的・合理的判断に基づいた問題解決能力の素養を身につけることを目指す．

_lecture_content: 【講義内容】
ＯＲでは，現実社会の問題解決のために，対象の問題を数学的なモデルをとして表現する．本講
義では，我々の社会において現れる種々の問題（分析，意思決定，作戦立案，計画など）のモデ
ル化の基本的な例を通じ，ＯＲの考え方について紹介する．数学的に記述された問題を解くため
の手法として，応用上高い汎用性を持つ線形計画法をはじめ，ネットワーク計画や非線形計画法
の基礎を扱う．

scgedule: 2．講義計画
1－2 ＯＲの考え方： オペレーションズリサーチの基本思想を，現実社会の問題の数学的なモデ
ル化という形で紹介する．
3-4 線形計画問題： 線形計画問題を定式化し，標準形への変換，実行可能基底解とその最適性
判定条件を述べる．
5-6 シンプレックス法： 線形計画問題を解く標準的な方法であるシンプレックス法について解
説する．
7 線形計画における双対問題： 重要な概念である双対性について解説する．
8 中間まとめと中間試験
9－12 ネットワーク計画： 最短経路問題，最大流問題などに対する離散的解法を紹介する．
13－14 非線形計画： 非線形計画の基本概念について解説する．
15 全体のまとめ．

grade: 3．成績の評価方法
中間試験と期末試験により評価する．

textbook: 4．教科書・参考書
福島雅夫著，
「新版 数理計画入門」
，朝倉書店，２０１１を使用し，印刷資料も適宜配布すること
とする．

note: 5．履修にあたっての注意事項
汎用性の観点から一般的な定式化を述べる一方で，簡単な例における計算遂行能力も重視する．

remark: ６．備考

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
オペレーションズリサーチ（ＯＲ）とは，現実社会のシステムにおける様々な問題の解決や戦略
立案などのために，
数学的なアプローチにより合理的な意思決定方法を導くための方法論である．
本講義ではＯＲへの入門として，
実問題の数理モデル化や数理計画法の基本手法の学習を通じて，
科学的・合理的判断に基づいた問題解決能力の素養を身につけることを目指す．

annual: ３年次

semesta:  後期

unitnum: 2 単位

teacher: 鈴木 恵二

None
name: データベース工学（Database Engineering）

thema: 【テーマ・目標】
データベースは，実世界をデータモデルによって抽象化することから始まる．そこで開発された理
論や技術は，各種の情報処理システムの基盤として，重要な役割を果たしている．また，データベ
ースは高度情報化社会の中核技術のひとつとなっている．データベースの設計と構築ができる基礎
的能力を習得する．
【学習目標】
データベース管理システムを用いて，小規模な関係データベースを設計，構築し，卒業研究等の
関連分野での研究に取り組めるレベルの理解を求める．

_lecture_content: 【講義内容】
目的：情報の論理構造と物理構造の違いを認識し，その違いを支える仕掛けの原理を理解するとと
もに，大量の情報を蓄積・検索・管理するシステムの設計・利用法を習得する．
内容：授業は，データモデル，概念モデリング，関係代数，データベース設計理論，データベース
管理システムなどにおけるデータベースの原理や思考方法など，その基礎への理解力を培う．
キーワード：データベース，データモデル，関係データモデル，SQL，トランザクション処理

scgedule: 2．講義計画
1. データベースシステムの基本概念
2. データモデリング
3. 関係データモデル
4. データベース設計
5. SQL
6. 物理データ格納方式
7. 問合せ処理
8. トランザクション処理，障害回復
9. データベース管理
10. データベース応用，最近のデータベース
11. データベースからの知識発見
詳細はカリキュラムによって異なるので，各コースの講義ページを参照すること．

grade: 3．成績の評価方法
カリキュラムによって異なる．
知能システム，情報デザインコースは授業参加状況，課題（レポート）
，期末試験の総合評価によ
る．それ以外のコースは，小テストを 2 割，課題（レポート）を 3 割，期末試験を 5 割を目安に
総合評価する．
小テストは講義後に毎回行い，課題（レポート）は 2～3 回行う予定である．
ただし，1)小テストの提出回数が講義回数の 3 分の 2 に満たない場合，または，2)課題(レポート)
に未提出のものがある場合は，不合格とする場合がある．

textbook: 4．教科書・参考書
教科書: 速水治夫・宮崎収兄・山崎晴明：データベース， オーム社 IT TEXT
参考書: 北川博之: データベースシステム， 情報系教科書シリーズ第 14 巻， 昭晃堂
西尾章治郎，上林弥彦，植村俊亮: データベース， オーム社
ほか，必要に応じて講義中に紹介する．

note: 5．履修にあたっての注意事項
離散数学，代数・集合論，論理・述語論理，アルゴリズムとデータ構造など，コンピュータサイエ
ンスの基礎をしっかり習得していることが望む．OS，ネットワークなどの知識も重要である．

remark: ６．備考
データベース研究は，コンピュータサイエンス・情報科学の一翼を担う重要な分野であり，対象世
界をモデル化する考え方も論理的思考の手段として重要である．
将来 SE を目指す人は必修である．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
データベースは，実世界をデータモデルによって抽象化することから始まる．そこで開発された理
論や技術は，各種の情報処理システムの基盤として，重要な役割を果たしている．また，データベ
ースは高度情報化社会の中核技術のひとつとなっている．データベースの設計と構築ができる基礎
的能力を習得する．
【学習目標】
データベース管理システムを用いて，小規模な関係データベースを設計，構築し，卒業研究等の
関連分野での研究に取り組めるレベルの理解を求める．

annual: ３年次

semesta:  後期

unitnum: 2 単位

teacher: 新美 礼彦

None
name: 信号処理応用（Advanced Signal Analysis）

thema: 【テーマ・目標】
Advanced methods of signal processing: Windowed Fourier transform, wavelet
analysis, and correlation analysis

_lecture_content: 【講義内容】
The course introduces several advanced methods of signal processing and includes
many examples and practices of time series analysis
Keywords: sampling, correlation function, non-stationary signal, spectrogram,
scalogram

scgedule: 2．講義計画
1.Information content of continuous and discrete signals.
2. Kotel’nikov-Shannon-Whittaker (sampling) theorem.
3. Aliasing.
4. Random signals. Stationarity, ergodicity, and correlations.
5. Power specrum and autocorrelation function.
6. Fast Fourier Transform (FFT). Examples of application.
7. Windowed Fourier transform. Window choice.
8.Time and frequency resolution.
9. Continuous Wavelet transform. Filter banks and convolution.
10-12. Example: Analysis of a radio signal from Jupiter.
13-15. Software. GNU Data Language (GDL).
{http://gnudatalanguage.sourceforge.net/}

grade: 3．成績の評価方法
Attendance of lectures, homework reports, signal processing project.

textbook: 4．教科書・参考書
1) The Scientist and Engineer's Guide to Digital Signal Processing. S. W. Smith,
California Technical Publishing (1997) http://www.dspguide.com/pdfbook.htm
2) Numerical Recipes in C. The Art of Scientific Computing. W.H. Press, et al.,
CAMBRIDGE UNIVERSITY PRESS (1992) http://apps.nrbook.com/c/index.html
3) A Wavelet Tour of Signal Processing. S. Mallat, Academic Press, (1999).

note: 5．履修にあたっての注意事項
Necessary: Analysis I,II; Mathematics for System I; Probability and Statistics,
Fundamental Signal Analysis

remark: ６．備考
http://portal.fun.ac.jp/~riabov/Advanced_Signal_Processing/

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
Advanced methods of signal processing: Windowed Fourier transform, wavelet
analysis, and correlation analysis

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: V. Riabov

None
name: 複雑系科学演習（Exercise on Complex Systems）

thema: 【テーマ・目標】
カオスフラクタル 1,2 の講義内容についてノートパソコンを使った
演習を行い理解を深めることが目的である．

_lecture_content: 【講義内容】
自己相似性，フラクタル次元などについて基礎的な演習を行い，フラクタルの生成メカニズムの
視覚的に理解する．

scgedule: 2．講義計画
1. イントロダクション（1-3 週）
学生のパソコンの C 言語プログラミング環境及びグラフ描画ソフトの整備を行う. 簡単な数値
計算を行いそのデータをグラフ化しレポートを作成できるようにする.
2. 非線形力学（4-15 週）
ノートパソコンを用いて数値計算し, 得られたデータを可視化する.
具体的には，ロジスティック写像，テント写像，エノン写像を用いて以下の事柄を学ぶ.
・不動点
・周期的サイクル
・周期倍分岐
・3 周期窓
・間欠性
・カオス
・アトラクター・ベイスン
・ストレンジアトラクターのフラクタル構造と次元の評価

grade: 3．成績の評価方法
出席状況，課題レポートなどの総合評価.

textbook: 4．教科書・参考書
なし.

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
コース専門必修

thema: 【テーマ・目標】
カオスフラクタル 1,2 の講義内容についてノートパソコンを使った
演習を行い理解を深めることが目的である．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: V. Riabov
川口 聡
香取 勇一

None
name: 複雑系科学特別セミナーA（Special Seminar on Complex Systems Science A）

thema: 【テーマ・目標】
複雑系科学における発展・応用的な話題について，輪講形式で学ぶ．

_lecture_content: 【講義内容】
受講者は，担当教員が提案する複雑系科学に関連する学習テーマを輪講形式で学ぶ．
原則として英語で書かれたテキストを用いることとするが，必要に応じて適宜日本語のテキスト
も併用することがある．

scgedule: 2．講義計画
全 15 回行う．
受講者は輪講形式で学習を進める．原則として講義中では，発表者は一部分ずつ分担して発表を
行い，聴講者はその発表に対して質問や意見を求められる．
また適宜，テーマに応じてテキストの読み方，発表の準備・方法などについて担当教員から指導
を受ける．詳細は開講時に担当教員が説明する．

grade: 3．成績の評価方法
課題
（発表＋レポート）
，
質疑応答などの積極性および内容理解を確認するための小テストにより
総合的に評価する．輪講形式の講義であるため，試験は行わない．
詳細は開講時に担当教員が説明する．

textbook: 4．教科書・参考書
開講時にテーマに応じて担当教員が指定する．

note: 5．履修にあたっての注意事項
輪講形式であるので，毎回出席し質疑応答に積極的に加わることを心がけること．

remark: ６．備考
本セミナーのテーマ選択は，卒業研究の研究室配属の前提条件にはならない．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
複雑系科学における発展・応用的な話題について，輪講形式で学ぶ．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 鈴木 恵二

None
name: 複雑系科学特別セミナーB（Special Seminar on Complex Systems Science B）

thema: 【テーマ・目標】
複雑系科学における発展・応用的な話題について，輪講形式で学ぶ．

_lecture_content: 【講義内容】
受講者は，担当教員が提案する複雑系科学に関連する学習テーマから希望するものを選択し，
輪講形式で学ぶ．

scgedule: 2．講義計画
全 15 回行う．
受講者は輪講形式で学習を進める．原則として講義中では，発表者は一部分ずつ分担して発表を
行い，聴講者はその発表に対して質問や意見を求められる．
また適宜，テーマに応じてテキストの読み方，発表の準備・方法などについて担当教員から
指導を受ける．詳細は開講時に担当教員が説明する．

grade: 3．成績の評価方法
課題
（発表＋レポート）
，
質疑応答などの積極性および内容理解を確認するための小テストにより
総合的に評価する．輪講形式の講義であるため，試験は行わない．
詳細は開講時に担当教員が説明する．

textbook: 4．教科書・参考書
開講時にテーマに応じて担当教員が指定する．

note: 5．履修にあたっての注意事項
輪講形式であるので，毎回出席し質疑応答に積極的に加わることを心がけること．

remark: ６．備考
本セミナーのテーマ選択は，卒業研究の研究室配属の前提条件にはならない．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
複雑系科学における発展・応用的な話題について，輪講形式で学ぶ．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 川越 敏司

None
name: インタラクティブシステム（Interactive System）

thema: 【テーマ・目標】
・インタラクティブシステムを学び
・インタラクティブシステムを開発する
人間と人工物が情報を相互的にやりとりするシステムをインタラクティブシステムと呼ぶ．イン
タラクティブシステムの構成原理・構成方法・ソフトウエア技術の基礎について，講義およびプ
ログラミング（Unity など）をともなった演習を通して学ぶ．

_lecture_content: 【講義内容】
人間を中心としたインタフェース技術としてのインタラクティブシステムの構成原理・構成方
法・ソフトウエア技術について講義する．また，インタラクティブシステムを構築するためのプ
ログラミング演習を行う．

scgedule: 2．講義計画
1.インタラクティブシステムの概要
・インタラクティブシステムとは何か
・インタラクティブシステムの事例
2.インタラクティブシステムの構成原理と構成方法
・インタラクティブシステムのデザイン
・インタラクティブシステムソフトウエア技術
・インタラクティブシステムにおける認知
3.インタラクティブシステムの研究事例
例）エージェントインタフェース，ロボットインタフェース，実世界指向インタフェースなど
4.演習課題
・インタラクティブシステムの設計・開発・相互評価
例）シリアスゲームの提案など
・レポートの作成
・課題発表

grade: 3．成績の評価方法
提出課題，演習成果物,発表内容の成績を総合的に判断して評価を行う.

textbook: 4．教科書・参考書
教科書：Unity5 3D/2D ゲーム開発実践入門（ソシム）
，Unity5 入門（ソフトバンククリエイテ
ィブ）
その他，参考書について開講時に紹介する．

note: 5．履修にあたっての注意事項
実習においては，必ず前回の実習でのやり残しを消化してから授業に参加すること．

remark: ６．備考
演習課題にはプログラミングの作業が含まれる.

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
・インタラクティブシステムを学び
・インタラクティブシステムを開発する
人間と人工物が情報を相互的にやりとりするシステムをインタラクティブシステムと呼ぶ．イン
タラクティブシステムの構成原理・構成方法・ソフトウエア技術の基礎について，講義およびプ
ログラミング（Unity など）をともなった演習を通して学ぶ．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 角 薫

None
name: コンピュータグラフィックス（Computer Graphics）

thema: 【テーマ・目標】
コンピュータグラフィックスの基礎理論を中心に映像生成手法を理解する

_lecture_content: 【講義内容】
コンピュータグラフィックス技術は映像制作，エンターテイメント，デザイン，科学データの可
視化などに不可欠の技術で，物理的な世界と光の性質を数学的にモデル化し，それを計算に置き
換えることでリアルな情景を生成している．この授業では，コンピュータグラフィックスの数学
的基礎に始まり，シーン記述の技法，映像生成のアルゴリズム，リアルな映像生成の技法，動画
の生成等について学習する．本授業では，数回のミニプロジェクト（課題(プログラム)）を通じ
てグラフィックス技術と映像表現方法の実際を習得する．

scgedule: 2．講義計画
1 コンピュータグラフィックス技術の全体像
2 画像を扱うためのデータ構造と座標変換
3 2 次元のグラフィックス
4 3 次元座標系と幾何学的変換
5 形状のモデリング
6 照明と表面の光学的特性
7 複雑な曲面の表現
8 模様や質感をつける
9 レイトレーシング，Z バッファ法
10 3 次元アニメーション
11 コンピュータグラフィックスの応用
12～14 ミニプロジェクト
15 まとめ
○ プログラミング課題を随時提示する．
○ 上記のなかで Java, Processing, Unity などをつかったミニプロジェクトを随時実施する．
なお，コースによって取り扱う内容が変わる場合がある．

grade: 3．成績の評価方法
すべての課題の提出を前提とする．
成績は課題(レポート＋プログラム)の評価 30％と期末試験の
成績 70％の総合でおこなう．

textbook: 4．教科書・参考書
CGARTS 協会「コンピュータグラフィックス」

note: 5．履修にあたっての注意事項
「線形代数学」
，
「プログラミング基礎」
，
「アルゴリズムとデータ構造」を履修していること．

remark: ６．備考

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
コンピュータグラフィックスの基礎理論を中心に映像生成手法を理解する

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 川嶋 稔夫

None
name: ロボティクス（Robotics）

thema: 【テーマ・目標】
ロボットの運動制御の基礎理論を学ぶ

_lecture_content: 【講義内容】
ロボットを動かす上で必要となるさまざまな知識のうち，本講義では制御に関連する部分を中心
に扱う．ロボットの代表的なものは人間の腕に類似した形状を持つマニピュレータであり，マニ
ピューレタに作業を行わせるためにはロボットを構成する関節のフィードバック制御が必要であ
る．同時に関節ごとに作業に応じた適切な指令をどのように与えるかが課題となり，個々のフィ
ードバック制御系に対して適切な目標値を与える枠組みが重要である．本講議では，マニピュレ
ータの機構を考慮したロボットの制御指令の生成とモータによる関節のフィードバック制御の実
現を通じて，ロボットの作業に必要な指令を生成し制御系に与える方法について基本的な理論を
学ぶ．また，理論と実際の機器制御との関係について理解を深めていく．
キーワード：フィードバック制御，マニピュレータ，運動学，逆運動学

scgedule: 2．講義計画
以下の項目について数回ずつ講義を行う．
1. モータのフィードバック制御
2. 制御のためのセンシング
3. マニピュレータへの作業指示
4. 関節の制御
5. マニピュレータの機構
6. 位置・姿勢の表現と座標変換
7. マニピュレータの運動学
8. マニピュレータの逆運動学

grade: 3．成績の評価方法
課題（演習）の提出状況に加え，期末試験または課題（レポート）により総合的に評価する．

textbook: 4．教科書・参考書
講義開講時に指定する．

note: 5．履修にあたっての注意事項
制御理論を履修していることが望ましい．

remark: ６．備考

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
ロボットの運動制御の基礎理論を学ぶ

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 鈴木 昭二

None
name: 音声音楽処理（Speech and music processing）

thema: 【テーマ・目標】
・ 音の物理的な特徴，音響信号の処理方法，音声の分析や合成の方法を理解する．
・実践重視：ｃ言語によるプログラミング及びディジタル信号処理（数学）
．

_lecture_content: 【講義内容】
音声音楽信号をパソコン上で周波数分析し，スペクトルの特徴を理解する．また，アナログ信号
の標本化（離散信号化）と標本化定理について学ぶ．さらに，離散信号のフーリエ変換，Ｚ変換
の理論を学び，信号処理の基礎を理解する．最後に，これらの知識を基に，Ｚ変換の理論から実
際にディジタル・フィルタをプログラムし，音声音楽信号の処理方法を体得する．

scgedule: 2．講義計画
・ 音の伝搬と聴覚特性
・ パソコン上でのスペクトル分析法
・ 信号処理のプログラミング
・ 信号のフーリエ変換とラプラス変換
・ 離散信号のスペクトル
・ 標本化定理
・ Ｚ変換
・ ディジタル・フィルタ
・ ディジタル・フィルタによる音声音楽信号の処理プログラム
※講義の進捗状況に応じて講義内容が多少異なる場合があります．

grade: 3．成績の評価方法
・期末試験．
・状況に応じてレポート．
・講義中の質疑応答及び受講態度．
・課題に対するレポート提出が要求された場合は，必ず提出すること．
・再試験はありません．

textbook: 4．教科書・参考書
教科書（予定）
： ｃ言語ではじめる音のプログラミング 青木直史著 オーム社
注）変更の可能性があります．

note: 5．履修にあたっての注意事項
各自のパソコンでｃ言語のプログラムを作成・実行できること．
講義中に指示されたソフトウェアを各自のパソコンにダウンロードし，自己責任で実行できるこ
と．

remark: ６．備考
なし．

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
・ 音の物理的な特徴，音響信号の処理方法，音声の分析や合成の方法を理解する．
・実践重視：ｃ言語によるプログラミング及びディジタル信号処理（数学）
．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 佐藤 仁樹
(Hideki Satoh)

None
name: 人工知能とメディア（Artificial Intelligence and Media）

thema: 【テーマ・目標】
メディア(情報伝達媒体)の特性と，それを支える人工知能技術に関する教養を身に付ける．

_lecture_content: 【講義内容】
現代の情報メディアは，従来のメディアとは異なり，時空を超えた情報伝達を容易にした．近年
では，様々な情報伝達が多様な情報メディアを介して行われるようになり，流通する情報の量と
多様性は急速に増している．本講義では，そのような大規模かつ多様な情報を活用するために編
み出されてきた各種技術について俯瞰し，情報メディアの特性および現代の情報基盤・情報処理
技術に関する教養の習得を目指す．

scgedule: 2．講義計画
1 情報検索
・人類とメディアの歴史
・ウェブによる情報の集積と検索
・情報検索の手法
2 映像と言語
・言語
・映像
・映像と言語／ヒューマンコンピュータインタラクション
3 自然言語処理
4 表現と意味
・音楽情報学，音楽の意味論
・人工知能は音楽の意味を扱えるか
・記号，コミュニケーション，自然言語
5. 行動のモデル化・知的活動支援
・博物館や街を知識，文化，生活のメディアと捉え，その歴史，情報技術の導入，知能と認知な
どに関連するトピックを取り上げ，紹介する

grade: 3．成績の評価方法
各章ごとに指定される課題（レポート）によって評価を行う．

textbook: 4．教科書・参考書
とくに指定しない．必要に応じて電子資料を配布する．

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
メディア(情報伝達媒体)の特性と，それを支える人工知能技術に関する教養を身に付ける．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 川嶋 稔夫
角 康之
角 薫
平田 圭二
村井 源

None
name: 分散協調システム（Distributed Cooperative System）

thema: 【テーマ・目標】
複数のロボットやソフトウェアエージェントが分散環境において協調的に動作するための数理的
理論と具体的な手法について学び，応用に関する現状を理解する．

_lecture_content: 【講義内容】
分散協調システムとは，複数の自律的なシステムが，局所的な情報をもとに互いの動作を整合さ
せながら，より大域的な協調を達成することを目的としたシステムである．この講義では，分散
協調システムの基礎理論から応用までを学ぶ．まず，分散協調システムの必要性と利点について
理解するとともに，基本的な技法について学ぶ．続いて，協調，競合解消，そして交渉にかかわ
る基礎的数理について学ぶ．最後に，マルチエージェントシステムの構成，協調機構，さらに応
用について学ぶ．

scgedule: 2．講義計画
1. 分散協調問題解決の概要
2. 非協力，協力ゲームの基礎
3. 交渉の数理
4. 合理的エージェント
5. マルチエージェントシステム
6. 協調の手法
7. 組織的問題解決
8. 応用

grade: 3．成績の評価方法
4 つの課題（レポートとプログラム）により評価する．
一つでも未提出の課題がある場合には不合格となる．

textbook: 4．教科書・参考書
なし．

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考

target: 対象コース 知能システム
コース専門選択

thema: 【テーマ・目標】
複数のロボットやソフトウェアエージェントが分散環境において協調的に動作するための数理的
理論と具体的な手法について学び，応用に関する現状を理解する．

annual: 3 年次

semesta:  後期

unitnum: 2 単位

teacher: 大澤 英一

None
name: ブレインサイエンス（Brain Science）

thema: 【テーマ・目標】
脳生理を中心に，神経細胞レベルから認知・行動レベルまでの脳の働きを理解する.

_lecture_content: 【講義内容】
私たちの脳は１０００億の神経細胞からなり，これが機能的なネットワークを構成することで，
知覚や行動などを司る．本講義では，神経細胞レベルから認知・行動レベルまでの脳の働きにつ
いて，これを解明するための科学的な手法及び実験的な知見を解説する．さらに，実験的な知見
がどのようにモデル化されてきたかを理解することで，複雑なシステムを理解するための方法論
を学ぶ．

scgedule: 2．講義計画
1.イントロダクション
2. 脳の構造
3. ニューロン
4. シナプス
5. 視覚
6. 聴覚・体性感覚
7. 運動
8. 行動の化学的制御
9. 注意と意識
10. 動機づけ, 情動
11. 言語
12. 学習と記憶
13. 高次機能障害
14. 脳の計測技術
15. まとめ

grade: 3．成績の評価方法
主に講義中に行なう小テスト及び，期末試験の総合評価で行う．付加的に課題（レポート）を課
す場合がある．

textbook: 4．教科書・参考書
参考書：
「神経科学―脳の探求―」
，ベアー・コノーズ・パラディーソ，西村書店
参考書：
「バイオサイコロジー」, ピネル, 西村書店
参考書：
「脳科学大事典」
，甘利俊一・外山啓介編，朝倉書店

note: 5．履修にあたっての注意事項
なし．

remark: ６．備考
なし．

target: 対象コース 複雑系
知能システム
コース専門選択

thema: 【テーマ・目標】
脳生理を中心に，神経細胞レベルから認知・行動レベルまでの脳の働きを理解する.

annual: 4 年次

semesta:  前期

unitnum: 2 単位

teacher: 佐藤 直行

None
name: 画像工学（Image Processing Technology）

thema: 【テーマ・目標】
画像情報処理システムについて，その概要と特徴を理解する．

_lecture_content: 【講義内容】
空間に分布した情報の視覚的表現が画像である．
本講義では，人間の視覚処理系をコンピュータで実現するための画像処理システムについて，そ
の原理と手法（画像を取り扱うための基礎技術）を解説する．
外界の環境をコンピュータに取り込むための画像センシング手法からはじまり，画像補正や画質
改善，さらに画像認識・理解を目的とした画像解析手法に至るまでを説明する．また，画像処理
技術を用いた応用事例に関しても随時紹介する．必要に応じて画像や映像を認識および理解する
ための認識アルゴリズムについて演習を交えながら講義を進める．

scgedule: 2．講義計画
第 1 部 画像処理技術の基礎(2 回)
画像処理技術の導入として，画像入出力装置，人間の視覚特性などについて説明する．
第 2 部 画像処理の基本手法
画像処理技術の基本的な手法を紹介する．大きくは以下の 2 つに分類される．
2 - 1. 画像の前処理（4 回）
解析，認識処理を容易にする，あるいは画像を見やすくするための前処理技術として，ノイズ除
去，幾何や濃度の補正などを理解する．
2 - 2. 特徴抽出（5 回）
ラベリングやハフ変換等，画像中に含まれる特徴を抽出するための処理について説明する．
第 3 部 画像認識技術（4 回）
テンプレートマッチング等，パターンに基づいて画像を判別・分類する処理について説明する．

grade: 3．成績の評価方法
単位認定は
・全ての課題（レポート（プログラム及びその説明，実行結果の考察）＋オンラインテスト）が
提出されていること
・期末試験で 60 点以上獲得すること
を前提とする．成績は定期試験により行う．

textbook: 4．教科書・参考書
教科書：後日指定する．

note: 5．履修にあたっての注意事項
原則として「プログラミング基礎」
，
「線形代数学」を履修していること．

remark: ６．備考
なし．

target: 対象コース 複雑系
コース専門選択

thema: 【テーマ・目標】
画像情報処理システムについて，その概要と特徴を理解する．

annual: ４年次

semesta:  前期

unitnum: 2 単位

teacher: 長崎 健

None
name: 経済学特論（Advanced Economics）

thema: 【テーマ・目標】
ゲーム理論に関する進んだ話題を講義する

_lecture_content: 【講義内容】
ゲーム理論に関して，より発展して話題を講義する．具体的には，動学ゲーム（展開形ゲームや繰
り返しゲーム）
，非対称性情報ゲームとそれぞれに対応する均衡概念・均衡精緻化概念，また近年
発達している様々な行動ゲーム理論の諸理論（進化ダイナミクス，学習理論，限定合理性，不平等
回避，互恵性など）についても解説する．

scgedule: 2．講義計画
1．ゲーム理論の基礎
2．チェルメロの定理と必勝法の存在
3．混合戦略
4．計算モデルと限定合理性
5．進化的安定性
6．進化的ダイナミクス
7．展開形ゲームと均衡精緻化
8．共有知識
9．不平等回避と互恵性
10．罪回避
11．質的応答均衡
12．レベル K 理論
13．強化学習
14．信念学習
15．社会的学習

grade: 3．成績の評価方法
出席点と期末試験による．成績は，出席点を約 3 割，期末試験を約 7 割の比率で評価して決定す
る．

textbook: 4．教科書・参考書
教科書：
川越敏司『行動ゲーム理論入門』NTT 出版
川越敏司『実験経済学』東京大学出版会
参考書：
川越敏司『はじめてのゲーム理論』講談社ブルーバックス
川越敏司『マーケット・デザイン オークションとマッチングの経済学』講談社選書メチエ

note: 5．履修にあたっての注意事項

remark: ６．備考

target: 対象コース 複雑系
コース専門選択
○情報アーキテクチャ学科
181 情報システムコースおよび高度ＩＣＴコース
183 情報デザインコース
185 複雑系コース
187 知能システムコース
コース概要と履修モデル
○複雑系知能学科

thema: 【テーマ・目標】
ゲーム理論に関する進んだ話題を講義する

annual: 4 年次

semesta:  前期

unitnum: 2 単位

teacher: 川越 敏司

None
